/* automatically generated by rust-bindgen 0.71.1 */

#![allow(non_snake_case)]
#![allow(non_camel_case_types)]
#![allow(non_upper_case_globals)]
#![allow(dead_code)]
#![allow(unused_imports)]
#![allow(clippy::useless_transmute)]
#![allow(clippy::too_many_arguments)]
#![allow(clippy::ptr_offset_with_cast)]

pub type VkBool32 = u32;
pub type VkDeviceAddress = u64;
pub type VkDeviceSize = u64;
pub type VkFlags = u32;
pub type VkSampleMask = u32;
pub type VkBuffer = u64;
pub type VkImage = u64;
pub type VkInstance = *mut VkInstance_T;
pub type VkPhysicalDevice = *mut VkPhysicalDevice_T;
pub type VkDevice = *mut VkDevice_T;
pub type VkQueue = *mut VkQueue_T;
pub type VkSemaphore = u64;
pub type VkCommandBuffer = *mut VkCommandBuffer_T;
pub type VkFence = u64;
pub type VkDeviceMemory = u64;
pub type VkEvent = u64;
pub type VkQueryPool = u64;
pub type VkBufferView = u64;
pub type VkImageView = u64;
pub type VkShaderModule = u64;
pub type VkPipelineCache = u64;
pub type VkPipelineLayout = u64;
pub type VkPipeline = u64;
pub type VkRenderPass = u64;
pub type VkDescriptorSetLayout = u64;
pub type VkSampler = u64;
pub type VkDescriptorSet = u64;
pub type VkDescriptorPool = u64;
pub type VkFramebuffer = u64;
pub type VkCommandPool = u64;
pub type VkResult = ::core::ffi::c_int;
pub type VkStructureType = ::core::ffi::c_int;
pub type VkPipelineCacheHeaderVersion = ::core::ffi::c_int;
pub type VkImageLayout = ::core::ffi::c_int;
pub type VkObjectType = ::core::ffi::c_int;

pub const VkSubpassDescriptionFlagBits_VK_SUBPASS_DESCRIPTION_ENABLE_LEGACY_DITHERING_BIT_EXT:
    VkSubpassDescriptionFlagBits = 128;
pub const VkSubpassDescriptionFlagBits_VK_SUBPASS_DESCRIPTION_RASTERIZATION_ORDER_ATTACHMENT_COLOR_ACCESS_BIT_ARM : VkSubpassDescriptionFlagBits = 16 ;
pub const VkSubpassDescriptionFlagBits_VK_SUBPASS_DESCRIPTION_RASTERIZATION_ORDER_ATTACHMENT_DEPTH_ACCESS_BIT_ARM : VkSubpassDescriptionFlagBits = 32 ;
pub const VkSubpassDescriptionFlagBits_VK_SUBPASS_DESCRIPTION_RASTERIZATION_ORDER_ATTACHMENT_STENCIL_ACCESS_BIT_ARM : VkSubpassDescriptionFlagBits = 64 ;
pub const VkSubpassDescriptionFlagBits_VK_SUBPASS_DESCRIPTION_FLAG_BITS_MAX_ENUM:
    VkSubpassDescriptionFlagBits = 2147483647;
pub const VkCommandPoolCreateFlagBits_VK_COMMAND_POOL_CREATE_TRANSIENT_BIT:
    VkCommandPoolCreateFlagBits = 1;
pub const VkCommandPoolCreateFlagBits_VK_COMMAND_POOL_CREATE_RESET_COMMAND_BUFFER_BIT:
    VkCommandPoolCreateFlagBits = 2;
pub const VkCommandPoolCreateFlagBits_VK_COMMAND_POOL_CREATE_PROTECTED_BIT:
    VkCommandPoolCreateFlagBits = 4;
pub const VkCommandPoolCreateFlagBits_VK_COMMAND_POOL_CREATE_FLAG_BITS_MAX_ENUM:
    VkCommandPoolCreateFlagBits = 2147483647;
pub const VkCommandPoolResetFlagBits_VK_COMMAND_POOL_RESET_RELEASE_RESOURCES_BIT:
    VkCommandPoolResetFlagBits = 1;
pub const VkCommandPoolResetFlagBits_VK_COMMAND_POOL_RESET_FLAG_BITS_MAX_ENUM:
    VkCommandPoolResetFlagBits = 2147483647;
pub const VkCommandBufferUsageFlagBits_VK_COMMAND_BUFFER_USAGE_ONE_TIME_SUBMIT_BIT:
    VkCommandBufferUsageFlagBits = 1;
pub const VkCommandBufferUsageFlagBits_VK_COMMAND_BUFFER_USAGE_RENDER_PASS_CONTINUE_BIT:
    VkCommandBufferUsageFlagBits = 2;
pub const VkCommandBufferUsageFlagBits_VK_COMMAND_BUFFER_USAGE_SIMULTANEOUS_USE_BIT:
    VkCommandBufferUsageFlagBits = 4;
pub const VkCommandBufferUsageFlagBits_VK_COMMAND_BUFFER_USAGE_FLAG_BITS_MAX_ENUM:
    VkCommandBufferUsageFlagBits = 2147483647;
pub const VkQueryControlFlagBits_VK_QUERY_CONTROL_PRECISE_BIT: VkQueryControlFlagBits = 1;
pub const VkQueryControlFlagBits_VK_QUERY_CONTROL_FLAG_BITS_MAX_ENUM: VkQueryControlFlagBits =
    2147483647;
pub const VkCommandBufferResetFlagBits_VK_COMMAND_BUFFER_RESET_RELEASE_RESOURCES_BIT:
    VkCommandBufferResetFlagBits = 1;
pub const VkCommandBufferResetFlagBits_VK_COMMAND_BUFFER_RESET_FLAG_BITS_MAX_ENUM:
    VkCommandBufferResetFlagBits = 2147483647;
pub const VkStencilFaceFlagBits_VK_STENCIL_FACE_FRONT_BIT: VkStencilFaceFlagBits = 1;
pub const VkStencilFaceFlagBits_VK_STENCIL_FACE_BACK_BIT: VkStencilFaceFlagBits = 2;
pub const VkStencilFaceFlagBits_VK_STENCIL_FACE_FRONT_AND_BACK: VkStencilFaceFlagBits = 3;
#[doc = " VK_STENCIL_FRONT_AND_BACK is a deprecated alias"]
pub const VkStencilFaceFlagBits_VK_STENCIL_FRONT_AND_BACK: VkStencilFaceFlagBits = 3;
#[doc = " VK_STENCIL_FRONT_AND_BACK is a deprecated alias"]
pub const VkStencilFaceFlagBits_VK_STENCIL_FACE_FLAG_BITS_MAX_ENUM: VkStencilFaceFlagBits =
    2147483647;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkExtent2D"][::core::mem::size_of::<VkExtent2D>() - 8usize];
    ["Alignment of VkExtent2D"][::core::mem::align_of::<VkExtent2D>() - 4usize];
    ["Offset of field: VkExtent2D::width"][::core::mem::offset_of!(VkExtent2D, width) - 0usize];
    ["Offset of field: VkExtent2D::height"][::core::mem::offset_of!(VkExtent2D, height) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkExtent3D"][::core::mem::size_of::<VkExtent3D>() - 12usize];
    ["Alignment of VkExtent3D"][::core::mem::align_of::<VkExtent3D>() - 4usize];
    ["Offset of field: VkExtent3D::width"][::core::mem::offset_of!(VkExtent3D, width) - 0usize];
    ["Offset of field: VkExtent3D::height"][::core::mem::offset_of!(VkExtent3D, height) - 4usize];
    ["Offset of field: VkExtent3D::depth"][::core::mem::offset_of!(VkExtent3D, depth) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkOffset2D"][::core::mem::size_of::<VkOffset2D>() - 8usize];
    ["Alignment of VkOffset2D"][::core::mem::align_of::<VkOffset2D>() - 4usize];
    ["Offset of field: VkOffset2D::x"][::core::mem::offset_of!(VkOffset2D, x) - 0usize];
    ["Offset of field: VkOffset2D::y"][::core::mem::offset_of!(VkOffset2D, y) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkOffset3D"][::core::mem::size_of::<VkOffset3D>() - 12usize];
    ["Alignment of VkOffset3D"][::core::mem::align_of::<VkOffset3D>() - 4usize];
    ["Offset of field: VkOffset3D::x"][::core::mem::offset_of!(VkOffset3D, x) - 0usize];
    ["Offset of field: VkOffset3D::y"][::core::mem::offset_of!(VkOffset3D, y) - 4usize];
    ["Offset of field: VkOffset3D::z"][::core::mem::offset_of!(VkOffset3D, z) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkRect2D"][::core::mem::size_of::<VkRect2D>() - 16usize];
    ["Alignment of VkRect2D"][::core::mem::align_of::<VkRect2D>() - 4usize];
    ["Offset of field: VkRect2D::offset"][::core::mem::offset_of!(VkRect2D, offset) - 0usize];
    ["Offset of field: VkRect2D::extent"][::core::mem::offset_of!(VkRect2D, extent) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkBaseInStructure"][::core::mem::size_of::<VkBaseInStructure>() - 8usize];
    ["Alignment of VkBaseInStructure"][::core::mem::align_of::<VkBaseInStructure>() - 4usize];
    ["Offset of field: VkBaseInStructure::sType"]
        [::core::mem::offset_of!(VkBaseInStructure, sType) - 0usize];
    ["Offset of field: VkBaseInStructure::pNext"]
        [::core::mem::offset_of!(VkBaseInStructure, pNext) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkBaseOutStructure"][::core::mem::size_of::<VkBaseOutStructure>() - 8usize];
    ["Alignment of VkBaseOutStructure"][::core::mem::align_of::<VkBaseOutStructure>() - 4usize];
    ["Offset of field: VkBaseOutStructure::sType"]
        [::core::mem::offset_of!(VkBaseOutStructure, sType) - 0usize];
    ["Offset of field: VkBaseOutStructure::pNext"]
        [::core::mem::offset_of!(VkBaseOutStructure, pNext) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkBufferMemoryBarrier"][::core::mem::size_of::<VkBufferMemoryBarrier>() - 48usize];
    ["Alignment of VkBufferMemoryBarrier"]
        [::core::mem::align_of::<VkBufferMemoryBarrier>() - 8usize];
    ["Offset of field: VkBufferMemoryBarrier::sType"]
        [::core::mem::offset_of!(VkBufferMemoryBarrier, sType) - 0usize];
    ["Offset of field: VkBufferMemoryBarrier::pNext"]
        [::core::mem::offset_of!(VkBufferMemoryBarrier, pNext) - 4usize];
    ["Offset of field: VkBufferMemoryBarrier::srcAccessMask"]
        [::core::mem::offset_of!(VkBufferMemoryBarrier, srcAccessMask) - 8usize];
    ["Offset of field: VkBufferMemoryBarrier::dstAccessMask"]
        [::core::mem::offset_of!(VkBufferMemoryBarrier, dstAccessMask) - 12usize];
    ["Offset of field: VkBufferMemoryBarrier::srcQueueFamilyIndex"]
        [::core::mem::offset_of!(VkBufferMemoryBarrier, srcQueueFamilyIndex) - 16usize];
    ["Offset of field: VkBufferMemoryBarrier::dstQueueFamilyIndex"]
        [::core::mem::offset_of!(VkBufferMemoryBarrier, dstQueueFamilyIndex) - 20usize];
    ["Offset of field: VkBufferMemoryBarrier::buffer"]
        [::core::mem::offset_of!(VkBufferMemoryBarrier, buffer) - 24usize];
    ["Offset of field: VkBufferMemoryBarrier::offset"]
        [::core::mem::offset_of!(VkBufferMemoryBarrier, offset) - 32usize];
    ["Offset of field: VkBufferMemoryBarrier::size"]
        [::core::mem::offset_of!(VkBufferMemoryBarrier, size) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDispatchIndirectCommand"]
        [::core::mem::size_of::<VkDispatchIndirectCommand>() - 12usize];
    ["Alignment of VkDispatchIndirectCommand"]
        [::core::mem::align_of::<VkDispatchIndirectCommand>() - 4usize];
    ["Offset of field: VkDispatchIndirectCommand::x"]
        [::core::mem::offset_of!(VkDispatchIndirectCommand, x) - 0usize];
    ["Offset of field: VkDispatchIndirectCommand::y"]
        [::core::mem::offset_of!(VkDispatchIndirectCommand, y) - 4usize];
    ["Offset of field: VkDispatchIndirectCommand::z"]
        [::core::mem::offset_of!(VkDispatchIndirectCommand, z) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDrawIndexedIndirectCommand"]
        [::core::mem::size_of::<VkDrawIndexedIndirectCommand>() - 20usize];
    ["Alignment of VkDrawIndexedIndirectCommand"]
        [::core::mem::align_of::<VkDrawIndexedIndirectCommand>() - 4usize];
    ["Offset of field: VkDrawIndexedIndirectCommand::indexCount"]
        [::core::mem::offset_of!(VkDrawIndexedIndirectCommand, indexCount) - 0usize];
    ["Offset of field: VkDrawIndexedIndirectCommand::instanceCount"]
        [::core::mem::offset_of!(VkDrawIndexedIndirectCommand, instanceCount) - 4usize];
    ["Offset of field: VkDrawIndexedIndirectCommand::firstIndex"]
        [::core::mem::offset_of!(VkDrawIndexedIndirectCommand, firstIndex) - 8usize];
    ["Offset of field: VkDrawIndexedIndirectCommand::vertexOffset"]
        [::core::mem::offset_of!(VkDrawIndexedIndirectCommand, vertexOffset) - 12usize];
    ["Offset of field: VkDrawIndexedIndirectCommand::firstInstance"]
        [::core::mem::offset_of!(VkDrawIndexedIndirectCommand, firstInstance) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDrawIndirectCommand"][::core::mem::size_of::<VkDrawIndirectCommand>() - 16usize];
    ["Alignment of VkDrawIndirectCommand"]
        [::core::mem::align_of::<VkDrawIndirectCommand>() - 4usize];
    ["Offset of field: VkDrawIndirectCommand::vertexCount"]
        [::core::mem::offset_of!(VkDrawIndirectCommand, vertexCount) - 0usize];
    ["Offset of field: VkDrawIndirectCommand::instanceCount"]
        [::core::mem::offset_of!(VkDrawIndirectCommand, instanceCount) - 4usize];
    ["Offset of field: VkDrawIndirectCommand::firstVertex"]
        [::core::mem::offset_of!(VkDrawIndirectCommand, firstVertex) - 8usize];
    ["Offset of field: VkDrawIndirectCommand::firstInstance"]
        [::core::mem::offset_of!(VkDrawIndirectCommand, firstInstance) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImageSubresourceRange"]
        [::core::mem::size_of::<VkImageSubresourceRange>() - 20usize];
    ["Alignment of VkImageSubresourceRange"]
        [::core::mem::align_of::<VkImageSubresourceRange>() - 4usize];
    ["Offset of field: VkImageSubresourceRange::aspectMask"]
        [::core::mem::offset_of!(VkImageSubresourceRange, aspectMask) - 0usize];
    ["Offset of field: VkImageSubresourceRange::baseMipLevel"]
        [::core::mem::offset_of!(VkImageSubresourceRange, baseMipLevel) - 4usize];
    ["Offset of field: VkImageSubresourceRange::levelCount"]
        [::core::mem::offset_of!(VkImageSubresourceRange, levelCount) - 8usize];
    ["Offset of field: VkImageSubresourceRange::baseArrayLayer"]
        [::core::mem::offset_of!(VkImageSubresourceRange, baseArrayLayer) - 12usize];
    ["Offset of field: VkImageSubresourceRange::layerCount"]
        [::core::mem::offset_of!(VkImageSubresourceRange, layerCount) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImageMemoryBarrier"][::core::mem::size_of::<VkImageMemoryBarrier>() - 64usize];
    ["Alignment of VkImageMemoryBarrier"][::core::mem::align_of::<VkImageMemoryBarrier>() - 8usize];
    ["Offset of field: VkImageMemoryBarrier::sType"]
        [::core::mem::offset_of!(VkImageMemoryBarrier, sType) - 0usize];
    ["Offset of field: VkImageMemoryBarrier::pNext"]
        [::core::mem::offset_of!(VkImageMemoryBarrier, pNext) - 4usize];
    ["Offset of field: VkImageMemoryBarrier::srcAccessMask"]
        [::core::mem::offset_of!(VkImageMemoryBarrier, srcAccessMask) - 8usize];
    ["Offset of field: VkImageMemoryBarrier::dstAccessMask"]
        [::core::mem::offset_of!(VkImageMemoryBarrier, dstAccessMask) - 12usize];
    ["Offset of field: VkImageMemoryBarrier::oldLayout"]
        [::core::mem::offset_of!(VkImageMemoryBarrier, oldLayout) - 16usize];
    ["Offset of field: VkImageMemoryBarrier::newLayout"]
        [::core::mem::offset_of!(VkImageMemoryBarrier, newLayout) - 20usize];
    ["Offset of field: VkImageMemoryBarrier::srcQueueFamilyIndex"]
        [::core::mem::offset_of!(VkImageMemoryBarrier, srcQueueFamilyIndex) - 24usize];
    ["Offset of field: VkImageMemoryBarrier::dstQueueFamilyIndex"]
        [::core::mem::offset_of!(VkImageMemoryBarrier, dstQueueFamilyIndex) - 28usize];
    ["Offset of field: VkImageMemoryBarrier::image"]
        [::core::mem::offset_of!(VkImageMemoryBarrier, image) - 32usize];
    ["Offset of field: VkImageMemoryBarrier::subresourceRange"]
        [::core::mem::offset_of!(VkImageMemoryBarrier, subresourceRange) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkMemoryBarrier"][::core::mem::size_of::<VkMemoryBarrier>() - 16usize];
    ["Alignment of VkMemoryBarrier"][::core::mem::align_of::<VkMemoryBarrier>() - 4usize];
    ["Offset of field: VkMemoryBarrier::sType"]
        [::core::mem::offset_of!(VkMemoryBarrier, sType) - 0usize];
    ["Offset of field: VkMemoryBarrier::pNext"]
        [::core::mem::offset_of!(VkMemoryBarrier, pNext) - 4usize];
    ["Offset of field: VkMemoryBarrier::srcAccessMask"]
        [::core::mem::offset_of!(VkMemoryBarrier, srcAccessMask) - 8usize];
    ["Offset of field: VkMemoryBarrier::dstAccessMask"]
        [::core::mem::offset_of!(VkMemoryBarrier, dstAccessMask) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPipelineCacheHeaderVersionOne"]
        [::core::mem::size_of::<VkPipelineCacheHeaderVersionOne>() - 32usize];
    ["Alignment of VkPipelineCacheHeaderVersionOne"]
        [::core::mem::align_of::<VkPipelineCacheHeaderVersionOne>() - 4usize];
    ["Offset of field: VkPipelineCacheHeaderVersionOne::headerSize"]
        [::core::mem::offset_of!(VkPipelineCacheHeaderVersionOne, headerSize) - 0usize];
    ["Offset of field: VkPipelineCacheHeaderVersionOne::headerVersion"]
        [::core::mem::offset_of!(VkPipelineCacheHeaderVersionOne, headerVersion) - 4usize];
    ["Offset of field: VkPipelineCacheHeaderVersionOne::vendorID"]
        [::core::mem::offset_of!(VkPipelineCacheHeaderVersionOne, vendorID) - 8usize];
    ["Offset of field: VkPipelineCacheHeaderVersionOne::deviceID"]
        [::core::mem::offset_of!(VkPipelineCacheHeaderVersionOne, deviceID) - 12usize];
    ["Offset of field: VkPipelineCacheHeaderVersionOne::pipelineCacheUUID"]
        [::core::mem::offset_of!(VkPipelineCacheHeaderVersionOne, pipelineCacheUUID) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkAllocationCallbacks"][::core::mem::size_of::<VkAllocationCallbacks>() - 24usize];
    ["Alignment of VkAllocationCallbacks"]
        [::core::mem::align_of::<VkAllocationCallbacks>() - 4usize];
    ["Offset of field: VkAllocationCallbacks::pUserData"]
        [::core::mem::offset_of!(VkAllocationCallbacks, pUserData) - 0usize];
    ["Offset of field: VkAllocationCallbacks::pfnAllocation"]
        [::core::mem::offset_of!(VkAllocationCallbacks, pfnAllocation) - 4usize];
    ["Offset of field: VkAllocationCallbacks::pfnReallocation"]
        [::core::mem::offset_of!(VkAllocationCallbacks, pfnReallocation) - 8usize];
    ["Offset of field: VkAllocationCallbacks::pfnFree"]
        [::core::mem::offset_of!(VkAllocationCallbacks, pfnFree) - 12usize];
    ["Offset of field: VkAllocationCallbacks::pfnInternalAllocation"]
        [::core::mem::offset_of!(VkAllocationCallbacks, pfnInternalAllocation) - 16usize];
    ["Offset of field: VkAllocationCallbacks::pfnInternalFree"]
        [::core::mem::offset_of!(VkAllocationCallbacks, pfnInternalFree) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkApplicationInfo"][::core::mem::size_of::<VkApplicationInfo>() - 28usize];
    ["Alignment of VkApplicationInfo"][::core::mem::align_of::<VkApplicationInfo>() - 4usize];
    ["Offset of field: VkApplicationInfo::sType"]
        [::core::mem::offset_of!(VkApplicationInfo, sType) - 0usize];
    ["Offset of field: VkApplicationInfo::pNext"]
        [::core::mem::offset_of!(VkApplicationInfo, pNext) - 4usize];
    ["Offset of field: VkApplicationInfo::pApplicationName"]
        [::core::mem::offset_of!(VkApplicationInfo, pApplicationName) - 8usize];
    ["Offset of field: VkApplicationInfo::applicationVersion"]
        [::core::mem::offset_of!(VkApplicationInfo, applicationVersion) - 12usize];
    ["Offset of field: VkApplicationInfo::pEngineName"]
        [::core::mem::offset_of!(VkApplicationInfo, pEngineName) - 16usize];
    ["Offset of field: VkApplicationInfo::engineVersion"]
        [::core::mem::offset_of!(VkApplicationInfo, engineVersion) - 20usize];
    ["Offset of field: VkApplicationInfo::apiVersion"]
        [::core::mem::offset_of!(VkApplicationInfo, apiVersion) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkFormatProperties"][::core::mem::size_of::<VkFormatProperties>() - 12usize];
    ["Alignment of VkFormatProperties"][::core::mem::align_of::<VkFormatProperties>() - 4usize];
    ["Offset of field: VkFormatProperties::linearTilingFeatures"]
        [::core::mem::offset_of!(VkFormatProperties, linearTilingFeatures) - 0usize];
    ["Offset of field: VkFormatProperties::optimalTilingFeatures"]
        [::core::mem::offset_of!(VkFormatProperties, optimalTilingFeatures) - 4usize];
    ["Offset of field: VkFormatProperties::bufferFeatures"]
        [::core::mem::offset_of!(VkFormatProperties, bufferFeatures) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImageFormatProperties"]
        [::core::mem::size_of::<VkImageFormatProperties>() - 32usize];
    ["Alignment of VkImageFormatProperties"]
        [::core::mem::align_of::<VkImageFormatProperties>() - 8usize];
    ["Offset of field: VkImageFormatProperties::maxExtent"]
        [::core::mem::offset_of!(VkImageFormatProperties, maxExtent) - 0usize];
    ["Offset of field: VkImageFormatProperties::maxMipLevels"]
        [::core::mem::offset_of!(VkImageFormatProperties, maxMipLevels) - 12usize];
    ["Offset of field: VkImageFormatProperties::maxArrayLayers"]
        [::core::mem::offset_of!(VkImageFormatProperties, maxArrayLayers) - 16usize];
    ["Offset of field: VkImageFormatProperties::sampleCounts"]
        [::core::mem::offset_of!(VkImageFormatProperties, sampleCounts) - 20usize];
    ["Offset of field: VkImageFormatProperties::maxResourceSize"]
        [::core::mem::offset_of!(VkImageFormatProperties, maxResourceSize) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkInstanceCreateInfo"][::core::mem::size_of::<VkInstanceCreateInfo>() - 32usize];
    ["Alignment of VkInstanceCreateInfo"][::core::mem::align_of::<VkInstanceCreateInfo>() - 4usize];
    ["Offset of field: VkInstanceCreateInfo::sType"]
        [::core::mem::offset_of!(VkInstanceCreateInfo, sType) - 0usize];
    ["Offset of field: VkInstanceCreateInfo::pNext"]
        [::core::mem::offset_of!(VkInstanceCreateInfo, pNext) - 4usize];
    ["Offset of field: VkInstanceCreateInfo::flags"]
        [::core::mem::offset_of!(VkInstanceCreateInfo, flags) - 8usize];
    ["Offset of field: VkInstanceCreateInfo::pApplicationInfo"]
        [::core::mem::offset_of!(VkInstanceCreateInfo, pApplicationInfo) - 12usize];
    ["Offset of field: VkInstanceCreateInfo::enabledLayerCount"]
        [::core::mem::offset_of!(VkInstanceCreateInfo, enabledLayerCount) - 16usize];
    ["Offset of field: VkInstanceCreateInfo::ppEnabledLayerNames"]
        [::core::mem::offset_of!(VkInstanceCreateInfo, ppEnabledLayerNames) - 20usize];
    ["Offset of field: VkInstanceCreateInfo::enabledExtensionCount"]
        [::core::mem::offset_of!(VkInstanceCreateInfo, enabledExtensionCount) - 24usize];
    ["Offset of field: VkInstanceCreateInfo::ppEnabledExtensionNames"]
        [::core::mem::offset_of!(VkInstanceCreateInfo, ppEnabledExtensionNames) - 28usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkMemoryHeap"][::core::mem::size_of::<VkMemoryHeap>() - 16usize];
    ["Alignment of VkMemoryHeap"][::core::mem::align_of::<VkMemoryHeap>() - 8usize];
    ["Offset of field: VkMemoryHeap::size"][::core::mem::offset_of!(VkMemoryHeap, size) - 0usize];
    ["Offset of field: VkMemoryHeap::flags"][::core::mem::offset_of!(VkMemoryHeap, flags) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkMemoryType"][::core::mem::size_of::<VkMemoryType>() - 8usize];
    ["Alignment of VkMemoryType"][::core::mem::align_of::<VkMemoryType>() - 4usize];
    ["Offset of field: VkMemoryType::propertyFlags"]
        [::core::mem::offset_of!(VkMemoryType, propertyFlags) - 0usize];
    ["Offset of field: VkMemoryType::heapIndex"]
        [::core::mem::offset_of!(VkMemoryType, heapIndex) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceFeatures"]
        [::core::mem::size_of::<VkPhysicalDeviceFeatures>() - 220usize];
    ["Alignment of VkPhysicalDeviceFeatures"]
        [::core::mem::align_of::<VkPhysicalDeviceFeatures>() - 4usize];
    ["Offset of field: VkPhysicalDeviceFeatures::robustBufferAccess"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, robustBufferAccess) - 0usize];
    ["Offset of field: VkPhysicalDeviceFeatures::fullDrawIndexUint32"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, fullDrawIndexUint32) - 4usize];
    ["Offset of field: VkPhysicalDeviceFeatures::imageCubeArray"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, imageCubeArray) - 8usize];
    ["Offset of field: VkPhysicalDeviceFeatures::independentBlend"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, independentBlend) - 12usize];
    ["Offset of field: VkPhysicalDeviceFeatures::geometryShader"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, geometryShader) - 16usize];
    ["Offset of field: VkPhysicalDeviceFeatures::tessellationShader"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, tessellationShader) - 20usize];
    ["Offset of field: VkPhysicalDeviceFeatures::sampleRateShading"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, sampleRateShading) - 24usize];
    ["Offset of field: VkPhysicalDeviceFeatures::dualSrcBlend"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, dualSrcBlend) - 28usize];
    ["Offset of field: VkPhysicalDeviceFeatures::logicOp"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, logicOp) - 32usize];
    ["Offset of field: VkPhysicalDeviceFeatures::multiDrawIndirect"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, multiDrawIndirect) - 36usize];
    ["Offset of field: VkPhysicalDeviceFeatures::drawIndirectFirstInstance"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, drawIndirectFirstInstance) - 40usize];
    ["Offset of field: VkPhysicalDeviceFeatures::depthClamp"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, depthClamp) - 44usize];
    ["Offset of field: VkPhysicalDeviceFeatures::depthBiasClamp"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, depthBiasClamp) - 48usize];
    ["Offset of field: VkPhysicalDeviceFeatures::fillModeNonSolid"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, fillModeNonSolid) - 52usize];
    ["Offset of field: VkPhysicalDeviceFeatures::depthBounds"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, depthBounds) - 56usize];
    ["Offset of field: VkPhysicalDeviceFeatures::wideLines"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, wideLines) - 60usize];
    ["Offset of field: VkPhysicalDeviceFeatures::largePoints"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, largePoints) - 64usize];
    ["Offset of field: VkPhysicalDeviceFeatures::alphaToOne"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, alphaToOne) - 68usize];
    ["Offset of field: VkPhysicalDeviceFeatures::multiViewport"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, multiViewport) - 72usize];
    ["Offset of field: VkPhysicalDeviceFeatures::samplerAnisotropy"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, samplerAnisotropy) - 76usize];
    ["Offset of field: VkPhysicalDeviceFeatures::textureCompressionETC2"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, textureCompressionETC2) - 80usize];
    ["Offset of field: VkPhysicalDeviceFeatures::textureCompressionASTC_LDR"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, textureCompressionASTC_LDR) - 84usize];
    ["Offset of field: VkPhysicalDeviceFeatures::textureCompressionBC"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, textureCompressionBC) - 88usize];
    ["Offset of field: VkPhysicalDeviceFeatures::occlusionQueryPrecise"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, occlusionQueryPrecise) - 92usize];
    ["Offset of field: VkPhysicalDeviceFeatures::pipelineStatisticsQuery"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, pipelineStatisticsQuery) - 96usize];
    ["Offset of field: VkPhysicalDeviceFeatures::vertexPipelineStoresAndAtomics"][::core::mem::offset_of!(
        VkPhysicalDeviceFeatures,
        vertexPipelineStoresAndAtomics
    ) - 100usize];
    ["Offset of field: VkPhysicalDeviceFeatures::fragmentStoresAndAtomics"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, fragmentStoresAndAtomics) - 104usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderTessellationAndGeometryPointSize"][::core::mem::offset_of!(
        VkPhysicalDeviceFeatures,
        shaderTessellationAndGeometryPointSize
    )
        - 108usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderImageGatherExtended"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, shaderImageGatherExtended) - 112usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderStorageImageExtendedFormats"][::core::mem::offset_of!(
        VkPhysicalDeviceFeatures,
        shaderStorageImageExtendedFormats
    ) - 116usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderStorageImageMultisample"][::core::mem::offset_of!(
        VkPhysicalDeviceFeatures,
        shaderStorageImageMultisample
    ) - 120usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderStorageImageReadWithoutFormat"][::core::mem::offset_of!(
        VkPhysicalDeviceFeatures,
        shaderStorageImageReadWithoutFormat
    )
        - 124usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderStorageImageWriteWithoutFormat"][::core::mem::offset_of!(
        VkPhysicalDeviceFeatures,
        shaderStorageImageWriteWithoutFormat
    )
        - 128usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderUniformBufferArrayDynamicIndexing"][::core::mem::offset_of!(
        VkPhysicalDeviceFeatures,
        shaderUniformBufferArrayDynamicIndexing
    )
        - 132usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderSampledImageArrayDynamicIndexing"][::core::mem::offset_of!(
        VkPhysicalDeviceFeatures,
        shaderSampledImageArrayDynamicIndexing
    )
        - 136usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderStorageBufferArrayDynamicIndexing"][::core::mem::offset_of!(
        VkPhysicalDeviceFeatures,
        shaderStorageBufferArrayDynamicIndexing
    )
        - 140usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderStorageImageArrayDynamicIndexing"][::core::mem::offset_of!(
        VkPhysicalDeviceFeatures,
        shaderStorageImageArrayDynamicIndexing
    )
        - 144usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderClipDistance"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, shaderClipDistance) - 148usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderCullDistance"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, shaderCullDistance) - 152usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderFloat64"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, shaderFloat64) - 156usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderInt64"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, shaderInt64) - 160usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderInt16"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, shaderInt16) - 164usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderResourceResidency"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, shaderResourceResidency) - 168usize];
    ["Offset of field: VkPhysicalDeviceFeatures::shaderResourceMinLod"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, shaderResourceMinLod) - 172usize];
    ["Offset of field: VkPhysicalDeviceFeatures::sparseBinding"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, sparseBinding) - 176usize];
    ["Offset of field: VkPhysicalDeviceFeatures::sparseResidencyBuffer"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, sparseResidencyBuffer) - 180usize];
    ["Offset of field: VkPhysicalDeviceFeatures::sparseResidencyImage2D"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, sparseResidencyImage2D) - 184usize];
    ["Offset of field: VkPhysicalDeviceFeatures::sparseResidencyImage3D"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, sparseResidencyImage3D) - 188usize];
    ["Offset of field: VkPhysicalDeviceFeatures::sparseResidency2Samples"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, sparseResidency2Samples) - 192usize];
    ["Offset of field: VkPhysicalDeviceFeatures::sparseResidency4Samples"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, sparseResidency4Samples) - 196usize];
    ["Offset of field: VkPhysicalDeviceFeatures::sparseResidency8Samples"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, sparseResidency8Samples) - 200usize];
    ["Offset of field: VkPhysicalDeviceFeatures::sparseResidency16Samples"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, sparseResidency16Samples) - 204usize];
    ["Offset of field: VkPhysicalDeviceFeatures::sparseResidencyAliased"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, sparseResidencyAliased) - 208usize];
    ["Offset of field: VkPhysicalDeviceFeatures::variableMultisampleRate"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, variableMultisampleRate) - 212usize];
    ["Offset of field: VkPhysicalDeviceFeatures::inheritedQueries"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures, inheritedQueries) - 216usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceLimits"][::core::mem::size_of::<VkPhysicalDeviceLimits>() - 496usize];
    ["Alignment of VkPhysicalDeviceLimits"]
        [::core::mem::align_of::<VkPhysicalDeviceLimits>() - 8usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxImageDimension1D"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxImageDimension1D) - 0usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxImageDimension2D"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxImageDimension2D) - 4usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxImageDimension3D"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxImageDimension3D) - 8usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxImageDimensionCube"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxImageDimensionCube) - 12usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxImageArrayLayers"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxImageArrayLayers) - 16usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxTexelBufferElements"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxTexelBufferElements) - 20usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxUniformBufferRange"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxUniformBufferRange) - 24usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxStorageBufferRange"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxStorageBufferRange) - 28usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxPushConstantsSize"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxPushConstantsSize) - 32usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxMemoryAllocationCount"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxMemoryAllocationCount) - 36usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxSamplerAllocationCount"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxSamplerAllocationCount) - 40usize];
    ["Offset of field: VkPhysicalDeviceLimits::bufferImageGranularity"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, bufferImageGranularity) - 48usize];
    ["Offset of field: VkPhysicalDeviceLimits::sparseAddressSpaceSize"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, sparseAddressSpaceSize) - 56usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxBoundDescriptorSets"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxBoundDescriptorSets) - 64usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxPerStageDescriptorSamplers"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxPerStageDescriptorSamplers) - 68usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxPerStageDescriptorUniformBuffers"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxPerStageDescriptorUniformBuffers
    ) - 72usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxPerStageDescriptorStorageBuffers"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxPerStageDescriptorStorageBuffers
    ) - 76usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxPerStageDescriptorSampledImages"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxPerStageDescriptorSampledImages
    ) - 80usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxPerStageDescriptorStorageImages"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxPerStageDescriptorStorageImages
    ) - 84usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxPerStageDescriptorInputAttachments"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxPerStageDescriptorInputAttachments
    ) - 88usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxPerStageResources"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxPerStageResources) - 92usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxDescriptorSetSamplers"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxDescriptorSetSamplers) - 96usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxDescriptorSetUniformBuffers"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxDescriptorSetUniformBuffers
    ) - 100usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxDescriptorSetUniformBuffersDynamic"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxDescriptorSetUniformBuffersDynamic
    )
        - 104usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxDescriptorSetStorageBuffers"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxDescriptorSetStorageBuffers
    ) - 108usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxDescriptorSetStorageBuffersDynamic"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxDescriptorSetStorageBuffersDynamic
    )
        - 112usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxDescriptorSetSampledImages"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxDescriptorSetSampledImages) - 116usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxDescriptorSetStorageImages"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxDescriptorSetStorageImages) - 120usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxDescriptorSetInputAttachments"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxDescriptorSetInputAttachments
    ) - 124usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxVertexInputAttributes"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxVertexInputAttributes) - 128usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxVertexInputBindings"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxVertexInputBindings) - 132usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxVertexInputAttributeOffset"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxVertexInputAttributeOffset) - 136usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxVertexInputBindingStride"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxVertexInputBindingStride) - 140usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxVertexOutputComponents"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxVertexOutputComponents) - 144usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxTessellationGenerationLevel"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxTessellationGenerationLevel
    ) - 148usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxTessellationPatchSize"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxTessellationPatchSize) - 152usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxTessellationControlPerVertexInputComponents"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxTessellationControlPerVertexInputComponents
    )
        - 156usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxTessellationControlPerVertexOutputComponents"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxTessellationControlPerVertexOutputComponents
    )
        - 160usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxTessellationControlPerPatchOutputComponents"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxTessellationControlPerPatchOutputComponents
    )
        - 164usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxTessellationControlTotalOutputComponents"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxTessellationControlTotalOutputComponents
    )
        - 168usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxTessellationEvaluationInputComponents"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxTessellationEvaluationInputComponents
    )
        - 172usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxTessellationEvaluationOutputComponents"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxTessellationEvaluationOutputComponents
    )
        - 176usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxGeometryShaderInvocations"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxGeometryShaderInvocations) - 180usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxGeometryInputComponents"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxGeometryInputComponents) - 184usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxGeometryOutputComponents"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxGeometryOutputComponents) - 188usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxGeometryOutputVertices"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxGeometryOutputVertices) - 192usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxGeometryTotalOutputComponents"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxGeometryTotalOutputComponents
    ) - 196usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxFragmentInputComponents"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxFragmentInputComponents) - 200usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxFragmentOutputAttachments"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxFragmentOutputAttachments) - 204usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxFragmentDualSrcAttachments"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxFragmentDualSrcAttachments) - 208usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxFragmentCombinedOutputResources"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxFragmentCombinedOutputResources
    ) - 212usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxComputeSharedMemorySize"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxComputeSharedMemorySize) - 216usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxComputeWorkGroupCount"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxComputeWorkGroupCount) - 220usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxComputeWorkGroupInvocations"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxComputeWorkGroupInvocations
    ) - 232usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxComputeWorkGroupSize"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxComputeWorkGroupSize) - 236usize];
    ["Offset of field: VkPhysicalDeviceLimits::subPixelPrecisionBits"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, subPixelPrecisionBits) - 248usize];
    ["Offset of field: VkPhysicalDeviceLimits::subTexelPrecisionBits"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, subTexelPrecisionBits) - 252usize];
    ["Offset of field: VkPhysicalDeviceLimits::mipmapPrecisionBits"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, mipmapPrecisionBits) - 256usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxDrawIndexedIndexValue"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxDrawIndexedIndexValue) - 260usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxDrawIndirectCount"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxDrawIndirectCount) - 264usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxSamplerLodBias"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxSamplerLodBias) - 268usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxSamplerAnisotropy"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxSamplerAnisotropy) - 272usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxViewports"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxViewports) - 276usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxViewportDimensions"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxViewportDimensions) - 280usize];
    ["Offset of field: VkPhysicalDeviceLimits::viewportBoundsRange"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, viewportBoundsRange) - 288usize];
    ["Offset of field: VkPhysicalDeviceLimits::viewportSubPixelBits"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, viewportSubPixelBits) - 296usize];
    ["Offset of field: VkPhysicalDeviceLimits::minMemoryMapAlignment"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, minMemoryMapAlignment) - 300usize];
    ["Offset of field: VkPhysicalDeviceLimits::minTexelBufferOffsetAlignment"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, minTexelBufferOffsetAlignment) - 304usize];
    ["Offset of field: VkPhysicalDeviceLimits::minUniformBufferOffsetAlignment"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        minUniformBufferOffsetAlignment
    ) - 312usize];
    ["Offset of field: VkPhysicalDeviceLimits::minStorageBufferOffsetAlignment"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        minStorageBufferOffsetAlignment
    ) - 320usize];
    ["Offset of field: VkPhysicalDeviceLimits::minTexelOffset"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, minTexelOffset) - 328usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxTexelOffset"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxTexelOffset) - 332usize];
    ["Offset of field: VkPhysicalDeviceLimits::minTexelGatherOffset"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, minTexelGatherOffset) - 336usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxTexelGatherOffset"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxTexelGatherOffset) - 340usize];
    ["Offset of field: VkPhysicalDeviceLimits::minInterpolationOffset"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, minInterpolationOffset) - 344usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxInterpolationOffset"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxInterpolationOffset) - 348usize];
    ["Offset of field: VkPhysicalDeviceLimits::subPixelInterpolationOffsetBits"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        subPixelInterpolationOffsetBits
    ) - 352usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxFramebufferWidth"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxFramebufferWidth) - 356usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxFramebufferHeight"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxFramebufferHeight) - 360usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxFramebufferLayers"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxFramebufferLayers) - 364usize];
    ["Offset of field: VkPhysicalDeviceLimits::framebufferColorSampleCounts"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, framebufferColorSampleCounts) - 368usize];
    ["Offset of field: VkPhysicalDeviceLimits::framebufferDepthSampleCounts"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, framebufferDepthSampleCounts) - 372usize];
    ["Offset of field: VkPhysicalDeviceLimits::framebufferStencilSampleCounts"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        framebufferStencilSampleCounts
    ) - 376usize];
    ["Offset of field: VkPhysicalDeviceLimits::framebufferNoAttachmentsSampleCounts"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        framebufferNoAttachmentsSampleCounts
    ) - 380usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxColorAttachments"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxColorAttachments) - 384usize];
    ["Offset of field: VkPhysicalDeviceLimits::sampledImageColorSampleCounts"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, sampledImageColorSampleCounts) - 388usize];
    ["Offset of field: VkPhysicalDeviceLimits::sampledImageIntegerSampleCounts"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        sampledImageIntegerSampleCounts
    ) - 392usize];
    ["Offset of field: VkPhysicalDeviceLimits::sampledImageDepthSampleCounts"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, sampledImageDepthSampleCounts) - 396usize];
    ["Offset of field: VkPhysicalDeviceLimits::sampledImageStencilSampleCounts"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        sampledImageStencilSampleCounts
    ) - 400usize];
    ["Offset of field: VkPhysicalDeviceLimits::storageImageSampleCounts"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, storageImageSampleCounts) - 404usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxSampleMaskWords"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxSampleMaskWords) - 408usize];
    ["Offset of field: VkPhysicalDeviceLimits::timestampComputeAndGraphics"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, timestampComputeAndGraphics) - 412usize];
    ["Offset of field: VkPhysicalDeviceLimits::timestampPeriod"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, timestampPeriod) - 416usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxClipDistances"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxClipDistances) - 420usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxCullDistances"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, maxCullDistances) - 424usize];
    ["Offset of field: VkPhysicalDeviceLimits::maxCombinedClipAndCullDistances"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        maxCombinedClipAndCullDistances
    ) - 428usize];
    ["Offset of field: VkPhysicalDeviceLimits::discreteQueuePriorities"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, discreteQueuePriorities) - 432usize];
    ["Offset of field: VkPhysicalDeviceLimits::pointSizeRange"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, pointSizeRange) - 436usize];
    ["Offset of field: VkPhysicalDeviceLimits::lineWidthRange"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, lineWidthRange) - 444usize];
    ["Offset of field: VkPhysicalDeviceLimits::pointSizeGranularity"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, pointSizeGranularity) - 452usize];
    ["Offset of field: VkPhysicalDeviceLimits::lineWidthGranularity"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, lineWidthGranularity) - 456usize];
    ["Offset of field: VkPhysicalDeviceLimits::strictLines"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, strictLines) - 460usize];
    ["Offset of field: VkPhysicalDeviceLimits::standardSampleLocations"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, standardSampleLocations) - 464usize];
    ["Offset of field: VkPhysicalDeviceLimits::optimalBufferCopyOffsetAlignment"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        optimalBufferCopyOffsetAlignment
    ) - 472usize];
    ["Offset of field: VkPhysicalDeviceLimits::optimalBufferCopyRowPitchAlignment"][::core::mem::offset_of!(
        VkPhysicalDeviceLimits,
        optimalBufferCopyRowPitchAlignment
    ) - 480usize];
    ["Offset of field: VkPhysicalDeviceLimits::nonCoherentAtomSize"]
        [::core::mem::offset_of!(VkPhysicalDeviceLimits, nonCoherentAtomSize) - 488usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceMemoryProperties"]
        [::core::mem::size_of::<VkPhysicalDeviceMemoryProperties>() - 520usize];
    ["Alignment of VkPhysicalDeviceMemoryProperties"]
        [::core::mem::align_of::<VkPhysicalDeviceMemoryProperties>() - 8usize];
    ["Offset of field: VkPhysicalDeviceMemoryProperties::memoryTypeCount"]
        [::core::mem::offset_of!(VkPhysicalDeviceMemoryProperties, memoryTypeCount) - 0usize];
    ["Offset of field: VkPhysicalDeviceMemoryProperties::memoryTypes"]
        [::core::mem::offset_of!(VkPhysicalDeviceMemoryProperties, memoryTypes) - 4usize];
    ["Offset of field: VkPhysicalDeviceMemoryProperties::memoryHeapCount"]
        [::core::mem::offset_of!(VkPhysicalDeviceMemoryProperties, memoryHeapCount) - 260usize];
    ["Offset of field: VkPhysicalDeviceMemoryProperties::memoryHeaps"]
        [::core::mem::offset_of!(VkPhysicalDeviceMemoryProperties, memoryHeaps) - 264usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceSparseProperties"]
        [::core::mem::size_of::<VkPhysicalDeviceSparseProperties>() - 20usize];
    ["Alignment of VkPhysicalDeviceSparseProperties"]
        [::core::mem::align_of::<VkPhysicalDeviceSparseProperties>() - 4usize];
    ["Offset of field: VkPhysicalDeviceSparseProperties::residencyStandard2DBlockShape"][::core::mem::offset_of!(
        VkPhysicalDeviceSparseProperties,
        residencyStandard2DBlockShape
    )
        - 0usize];
    ["Offset of field: VkPhysicalDeviceSparseProperties::residencyStandard2DMultisampleBlockShape"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceSparseProperties , residencyStandard2DMultisampleBlockShape) - 4usize] ;
    ["Offset of field: VkPhysicalDeviceSparseProperties::residencyStandard3DBlockShape"][::core::mem::offset_of!(
        VkPhysicalDeviceSparseProperties,
        residencyStandard3DBlockShape
    )
        - 8usize];
    ["Offset of field: VkPhysicalDeviceSparseProperties::residencyAlignedMipSize"][::core::mem::offset_of!(
        VkPhysicalDeviceSparseProperties,
        residencyAlignedMipSize
    ) - 12usize];
    ["Offset of field: VkPhysicalDeviceSparseProperties::residencyNonResidentStrict"][::core::mem::offset_of!(
        VkPhysicalDeviceSparseProperties,
        residencyNonResidentStrict
    ) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceProperties"]
        [::core::mem::size_of::<VkPhysicalDeviceProperties>() - 816usize];
    ["Alignment of VkPhysicalDeviceProperties"]
        [::core::mem::align_of::<VkPhysicalDeviceProperties>() - 8usize];
    ["Offset of field: VkPhysicalDeviceProperties::apiVersion"]
        [::core::mem::offset_of!(VkPhysicalDeviceProperties, apiVersion) - 0usize];
    ["Offset of field: VkPhysicalDeviceProperties::driverVersion"]
        [::core::mem::offset_of!(VkPhysicalDeviceProperties, driverVersion) - 4usize];
    ["Offset of field: VkPhysicalDeviceProperties::vendorID"]
        [::core::mem::offset_of!(VkPhysicalDeviceProperties, vendorID) - 8usize];
    ["Offset of field: VkPhysicalDeviceProperties::deviceID"]
        [::core::mem::offset_of!(VkPhysicalDeviceProperties, deviceID) - 12usize];
    ["Offset of field: VkPhysicalDeviceProperties::deviceType"]
        [::core::mem::offset_of!(VkPhysicalDeviceProperties, deviceType) - 16usize];
    ["Offset of field: VkPhysicalDeviceProperties::deviceName"]
        [::core::mem::offset_of!(VkPhysicalDeviceProperties, deviceName) - 20usize];
    ["Offset of field: VkPhysicalDeviceProperties::pipelineCacheUUID"]
        [::core::mem::offset_of!(VkPhysicalDeviceProperties, pipelineCacheUUID) - 276usize];
    ["Offset of field: VkPhysicalDeviceProperties::limits"]
        [::core::mem::offset_of!(VkPhysicalDeviceProperties, limits) - 296usize];
    ["Offset of field: VkPhysicalDeviceProperties::sparseProperties"]
        [::core::mem::offset_of!(VkPhysicalDeviceProperties, sparseProperties) - 792usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkQueueFamilyProperties"]
        [::core::mem::size_of::<VkQueueFamilyProperties>() - 24usize];
    ["Alignment of VkQueueFamilyProperties"]
        [::core::mem::align_of::<VkQueueFamilyProperties>() - 4usize];
    ["Offset of field: VkQueueFamilyProperties::queueFlags"]
        [::core::mem::offset_of!(VkQueueFamilyProperties, queueFlags) - 0usize];
    ["Offset of field: VkQueueFamilyProperties::queueCount"]
        [::core::mem::offset_of!(VkQueueFamilyProperties, queueCount) - 4usize];
    ["Offset of field: VkQueueFamilyProperties::timestampValidBits"]
        [::core::mem::offset_of!(VkQueueFamilyProperties, timestampValidBits) - 8usize];
    ["Offset of field: VkQueueFamilyProperties::minImageTransferGranularity"]
        [::core::mem::offset_of!(VkQueueFamilyProperties, minImageTransferGranularity) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDeviceQueueCreateInfo"]
        [::core::mem::size_of::<VkDeviceQueueCreateInfo>() - 24usize];
    ["Alignment of VkDeviceQueueCreateInfo"]
        [::core::mem::align_of::<VkDeviceQueueCreateInfo>() - 4usize];
    ["Offset of field: VkDeviceQueueCreateInfo::sType"]
        [::core::mem::offset_of!(VkDeviceQueueCreateInfo, sType) - 0usize];
    ["Offset of field: VkDeviceQueueCreateInfo::pNext"]
        [::core::mem::offset_of!(VkDeviceQueueCreateInfo, pNext) - 4usize];
    ["Offset of field: VkDeviceQueueCreateInfo::flags"]
        [::core::mem::offset_of!(VkDeviceQueueCreateInfo, flags) - 8usize];
    ["Offset of field: VkDeviceQueueCreateInfo::queueFamilyIndex"]
        [::core::mem::offset_of!(VkDeviceQueueCreateInfo, queueFamilyIndex) - 12usize];
    ["Offset of field: VkDeviceQueueCreateInfo::queueCount"]
        [::core::mem::offset_of!(VkDeviceQueueCreateInfo, queueCount) - 16usize];
    ["Offset of field: VkDeviceQueueCreateInfo::pQueuePriorities"]
        [::core::mem::offset_of!(VkDeviceQueueCreateInfo, pQueuePriorities) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDeviceCreateInfo"][::core::mem::size_of::<VkDeviceCreateInfo>() - 40usize];
    ["Alignment of VkDeviceCreateInfo"][::core::mem::align_of::<VkDeviceCreateInfo>() - 4usize];
    ["Offset of field: VkDeviceCreateInfo::sType"]
        [::core::mem::offset_of!(VkDeviceCreateInfo, sType) - 0usize];
    ["Offset of field: VkDeviceCreateInfo::pNext"]
        [::core::mem::offset_of!(VkDeviceCreateInfo, pNext) - 4usize];
    ["Offset of field: VkDeviceCreateInfo::flags"]
        [::core::mem::offset_of!(VkDeviceCreateInfo, flags) - 8usize];
    ["Offset of field: VkDeviceCreateInfo::queueCreateInfoCount"]
        [::core::mem::offset_of!(VkDeviceCreateInfo, queueCreateInfoCount) - 12usize];
    ["Offset of field: VkDeviceCreateInfo::pQueueCreateInfos"]
        [::core::mem::offset_of!(VkDeviceCreateInfo, pQueueCreateInfos) - 16usize];
    ["Offset of field: VkDeviceCreateInfo::enabledLayerCount"]
        [::core::mem::offset_of!(VkDeviceCreateInfo, enabledLayerCount) - 20usize];
    ["Offset of field: VkDeviceCreateInfo::ppEnabledLayerNames"]
        [::core::mem::offset_of!(VkDeviceCreateInfo, ppEnabledLayerNames) - 24usize];
    ["Offset of field: VkDeviceCreateInfo::enabledExtensionCount"]
        [::core::mem::offset_of!(VkDeviceCreateInfo, enabledExtensionCount) - 28usize];
    ["Offset of field: VkDeviceCreateInfo::ppEnabledExtensionNames"]
        [::core::mem::offset_of!(VkDeviceCreateInfo, ppEnabledExtensionNames) - 32usize];
    ["Offset of field: VkDeviceCreateInfo::pEnabledFeatures"]
        [::core::mem::offset_of!(VkDeviceCreateInfo, pEnabledFeatures) - 36usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkExtensionProperties"][::core::mem::size_of::<VkExtensionProperties>() - 260usize];
    ["Alignment of VkExtensionProperties"]
        [::core::mem::align_of::<VkExtensionProperties>() - 4usize];
    ["Offset of field: VkExtensionProperties::extensionName"]
        [::core::mem::offset_of!(VkExtensionProperties, extensionName) - 0usize];
    ["Offset of field: VkExtensionProperties::specVersion"]
        [::core::mem::offset_of!(VkExtensionProperties, specVersion) - 256usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkLayerProperties"][::core::mem::size_of::<VkLayerProperties>() - 520usize];
    ["Alignment of VkLayerProperties"][::core::mem::align_of::<VkLayerProperties>() - 4usize];
    ["Offset of field: VkLayerProperties::layerName"]
        [::core::mem::offset_of!(VkLayerProperties, layerName) - 0usize];
    ["Offset of field: VkLayerProperties::specVersion"]
        [::core::mem::offset_of!(VkLayerProperties, specVersion) - 256usize];
    ["Offset of field: VkLayerProperties::implementationVersion"]
        [::core::mem::offset_of!(VkLayerProperties, implementationVersion) - 260usize];
    ["Offset of field: VkLayerProperties::description"]
        [::core::mem::offset_of!(VkLayerProperties, description) - 264usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSubmitInfo"][::core::mem::size_of::<VkSubmitInfo>() - 36usize];
    ["Alignment of VkSubmitInfo"][::core::mem::align_of::<VkSubmitInfo>() - 4usize];
    ["Offset of field: VkSubmitInfo::sType"][::core::mem::offset_of!(VkSubmitInfo, sType) - 0usize];
    ["Offset of field: VkSubmitInfo::pNext"][::core::mem::offset_of!(VkSubmitInfo, pNext) - 4usize];
    ["Offset of field: VkSubmitInfo::waitSemaphoreCount"]
        [::core::mem::offset_of!(VkSubmitInfo, waitSemaphoreCount) - 8usize];
    ["Offset of field: VkSubmitInfo::pWaitSemaphores"]
        [::core::mem::offset_of!(VkSubmitInfo, pWaitSemaphores) - 12usize];
    ["Offset of field: VkSubmitInfo::pWaitDstStageMask"]
        [::core::mem::offset_of!(VkSubmitInfo, pWaitDstStageMask) - 16usize];
    ["Offset of field: VkSubmitInfo::commandBufferCount"]
        [::core::mem::offset_of!(VkSubmitInfo, commandBufferCount) - 20usize];
    ["Offset of field: VkSubmitInfo::pCommandBuffers"]
        [::core::mem::offset_of!(VkSubmitInfo, pCommandBuffers) - 24usize];
    ["Offset of field: VkSubmitInfo::signalSemaphoreCount"]
        [::core::mem::offset_of!(VkSubmitInfo, signalSemaphoreCount) - 28usize];
    ["Offset of field: VkSubmitInfo::pSignalSemaphores"]
        [::core::mem::offset_of!(VkSubmitInfo, pSignalSemaphores) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkMappedMemoryRange"][::core::mem::size_of::<VkMappedMemoryRange>() - 32usize];
    ["Alignment of VkMappedMemoryRange"][::core::mem::align_of::<VkMappedMemoryRange>() - 8usize];
    ["Offset of field: VkMappedMemoryRange::sType"]
        [::core::mem::offset_of!(VkMappedMemoryRange, sType) - 0usize];
    ["Offset of field: VkMappedMemoryRange::pNext"]
        [::core::mem::offset_of!(VkMappedMemoryRange, pNext) - 4usize];
    ["Offset of field: VkMappedMemoryRange::memory"]
        [::core::mem::offset_of!(VkMappedMemoryRange, memory) - 8usize];
    ["Offset of field: VkMappedMemoryRange::offset"]
        [::core::mem::offset_of!(VkMappedMemoryRange, offset) - 16usize];
    ["Offset of field: VkMappedMemoryRange::size"]
        [::core::mem::offset_of!(VkMappedMemoryRange, size) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkMemoryAllocateInfo"][::core::mem::size_of::<VkMemoryAllocateInfo>() - 24usize];
    ["Alignment of VkMemoryAllocateInfo"][::core::mem::align_of::<VkMemoryAllocateInfo>() - 8usize];
    ["Offset of field: VkMemoryAllocateInfo::sType"]
        [::core::mem::offset_of!(VkMemoryAllocateInfo, sType) - 0usize];
    ["Offset of field: VkMemoryAllocateInfo::pNext"]
        [::core::mem::offset_of!(VkMemoryAllocateInfo, pNext) - 4usize];
    ["Offset of field: VkMemoryAllocateInfo::allocationSize"]
        [::core::mem::offset_of!(VkMemoryAllocateInfo, allocationSize) - 8usize];
    ["Offset of field: VkMemoryAllocateInfo::memoryTypeIndex"]
        [::core::mem::offset_of!(VkMemoryAllocateInfo, memoryTypeIndex) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkMemoryRequirements"][::core::mem::size_of::<VkMemoryRequirements>() - 24usize];
    ["Alignment of VkMemoryRequirements"][::core::mem::align_of::<VkMemoryRequirements>() - 8usize];
    ["Offset of field: VkMemoryRequirements::size"]
        [::core::mem::offset_of!(VkMemoryRequirements, size) - 0usize];
    ["Offset of field: VkMemoryRequirements::alignment"]
        [::core::mem::offset_of!(VkMemoryRequirements, alignment) - 8usize];
    ["Offset of field: VkMemoryRequirements::memoryTypeBits"]
        [::core::mem::offset_of!(VkMemoryRequirements, memoryTypeBits) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSparseMemoryBind"][::core::mem::size_of::<VkSparseMemoryBind>() - 40usize];
    ["Alignment of VkSparseMemoryBind"][::core::mem::align_of::<VkSparseMemoryBind>() - 8usize];
    ["Offset of field: VkSparseMemoryBind::resourceOffset"]
        [::core::mem::offset_of!(VkSparseMemoryBind, resourceOffset) - 0usize];
    ["Offset of field: VkSparseMemoryBind::size"]
        [::core::mem::offset_of!(VkSparseMemoryBind, size) - 8usize];
    ["Offset of field: VkSparseMemoryBind::memory"]
        [::core::mem::offset_of!(VkSparseMemoryBind, memory) - 16usize];
    ["Offset of field: VkSparseMemoryBind::memoryOffset"]
        [::core::mem::offset_of!(VkSparseMemoryBind, memoryOffset) - 24usize];
    ["Offset of field: VkSparseMemoryBind::flags"]
        [::core::mem::offset_of!(VkSparseMemoryBind, flags) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSparseBufferMemoryBindInfo"]
        [::core::mem::size_of::<VkSparseBufferMemoryBindInfo>() - 16usize];
    ["Alignment of VkSparseBufferMemoryBindInfo"]
        [::core::mem::align_of::<VkSparseBufferMemoryBindInfo>() - 8usize];
    ["Offset of field: VkSparseBufferMemoryBindInfo::buffer"]
        [::core::mem::offset_of!(VkSparseBufferMemoryBindInfo, buffer) - 0usize];
    ["Offset of field: VkSparseBufferMemoryBindInfo::bindCount"]
        [::core::mem::offset_of!(VkSparseBufferMemoryBindInfo, bindCount) - 8usize];
    ["Offset of field: VkSparseBufferMemoryBindInfo::pBinds"]
        [::core::mem::offset_of!(VkSparseBufferMemoryBindInfo, pBinds) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSparseImageOpaqueMemoryBindInfo"]
        [::core::mem::size_of::<VkSparseImageOpaqueMemoryBindInfo>() - 16usize];
    ["Alignment of VkSparseImageOpaqueMemoryBindInfo"]
        [::core::mem::align_of::<VkSparseImageOpaqueMemoryBindInfo>() - 8usize];
    ["Offset of field: VkSparseImageOpaqueMemoryBindInfo::image"]
        [::core::mem::offset_of!(VkSparseImageOpaqueMemoryBindInfo, image) - 0usize];
    ["Offset of field: VkSparseImageOpaqueMemoryBindInfo::bindCount"]
        [::core::mem::offset_of!(VkSparseImageOpaqueMemoryBindInfo, bindCount) - 8usize];
    ["Offset of field: VkSparseImageOpaqueMemoryBindInfo::pBinds"]
        [::core::mem::offset_of!(VkSparseImageOpaqueMemoryBindInfo, pBinds) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImageSubresource"][::core::mem::size_of::<VkImageSubresource>() - 12usize];
    ["Alignment of VkImageSubresource"][::core::mem::align_of::<VkImageSubresource>() - 4usize];
    ["Offset of field: VkImageSubresource::aspectMask"]
        [::core::mem::offset_of!(VkImageSubresource, aspectMask) - 0usize];
    ["Offset of field: VkImageSubresource::mipLevel"]
        [::core::mem::offset_of!(VkImageSubresource, mipLevel) - 4usize];
    ["Offset of field: VkImageSubresource::arrayLayer"]
        [::core::mem::offset_of!(VkImageSubresource, arrayLayer) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSparseImageMemoryBind"]
        [::core::mem::size_of::<VkSparseImageMemoryBind>() - 64usize];
    ["Alignment of VkSparseImageMemoryBind"]
        [::core::mem::align_of::<VkSparseImageMemoryBind>() - 8usize];
    ["Offset of field: VkSparseImageMemoryBind::subresource"]
        [::core::mem::offset_of!(VkSparseImageMemoryBind, subresource) - 0usize];
    ["Offset of field: VkSparseImageMemoryBind::offset"]
        [::core::mem::offset_of!(VkSparseImageMemoryBind, offset) - 12usize];
    ["Offset of field: VkSparseImageMemoryBind::extent"]
        [::core::mem::offset_of!(VkSparseImageMemoryBind, extent) - 24usize];
    ["Offset of field: VkSparseImageMemoryBind::memory"]
        [::core::mem::offset_of!(VkSparseImageMemoryBind, memory) - 40usize];
    ["Offset of field: VkSparseImageMemoryBind::memoryOffset"]
        [::core::mem::offset_of!(VkSparseImageMemoryBind, memoryOffset) - 48usize];
    ["Offset of field: VkSparseImageMemoryBind::flags"]
        [::core::mem::offset_of!(VkSparseImageMemoryBind, flags) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSparseImageMemoryBindInfo"]
        [::core::mem::size_of::<VkSparseImageMemoryBindInfo>() - 16usize];
    ["Alignment of VkSparseImageMemoryBindInfo"]
        [::core::mem::align_of::<VkSparseImageMemoryBindInfo>() - 8usize];
    ["Offset of field: VkSparseImageMemoryBindInfo::image"]
        [::core::mem::offset_of!(VkSparseImageMemoryBindInfo, image) - 0usize];
    ["Offset of field: VkSparseImageMemoryBindInfo::bindCount"]
        [::core::mem::offset_of!(VkSparseImageMemoryBindInfo, bindCount) - 8usize];
    ["Offset of field: VkSparseImageMemoryBindInfo::pBinds"]
        [::core::mem::offset_of!(VkSparseImageMemoryBindInfo, pBinds) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkBindSparseInfo"][::core::mem::size_of::<VkBindSparseInfo>() - 48usize];
    ["Alignment of VkBindSparseInfo"][::core::mem::align_of::<VkBindSparseInfo>() - 4usize];
    ["Offset of field: VkBindSparseInfo::sType"]
        [::core::mem::offset_of!(VkBindSparseInfo, sType) - 0usize];
    ["Offset of field: VkBindSparseInfo::pNext"]
        [::core::mem::offset_of!(VkBindSparseInfo, pNext) - 4usize];
    ["Offset of field: VkBindSparseInfo::waitSemaphoreCount"]
        [::core::mem::offset_of!(VkBindSparseInfo, waitSemaphoreCount) - 8usize];
    ["Offset of field: VkBindSparseInfo::pWaitSemaphores"]
        [::core::mem::offset_of!(VkBindSparseInfo, pWaitSemaphores) - 12usize];
    ["Offset of field: VkBindSparseInfo::bufferBindCount"]
        [::core::mem::offset_of!(VkBindSparseInfo, bufferBindCount) - 16usize];
    ["Offset of field: VkBindSparseInfo::pBufferBinds"]
        [::core::mem::offset_of!(VkBindSparseInfo, pBufferBinds) - 20usize];
    ["Offset of field: VkBindSparseInfo::imageOpaqueBindCount"]
        [::core::mem::offset_of!(VkBindSparseInfo, imageOpaqueBindCount) - 24usize];
    ["Offset of field: VkBindSparseInfo::pImageOpaqueBinds"]
        [::core::mem::offset_of!(VkBindSparseInfo, pImageOpaqueBinds) - 28usize];
    ["Offset of field: VkBindSparseInfo::imageBindCount"]
        [::core::mem::offset_of!(VkBindSparseInfo, imageBindCount) - 32usize];
    ["Offset of field: VkBindSparseInfo::pImageBinds"]
        [::core::mem::offset_of!(VkBindSparseInfo, pImageBinds) - 36usize];
    ["Offset of field: VkBindSparseInfo::signalSemaphoreCount"]
        [::core::mem::offset_of!(VkBindSparseInfo, signalSemaphoreCount) - 40usize];
    ["Offset of field: VkBindSparseInfo::pSignalSemaphores"]
        [::core::mem::offset_of!(VkBindSparseInfo, pSignalSemaphores) - 44usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSparseImageFormatProperties"]
        [::core::mem::size_of::<VkSparseImageFormatProperties>() - 20usize];
    ["Alignment of VkSparseImageFormatProperties"]
        [::core::mem::align_of::<VkSparseImageFormatProperties>() - 4usize];
    ["Offset of field: VkSparseImageFormatProperties::aspectMask"]
        [::core::mem::offset_of!(VkSparseImageFormatProperties, aspectMask) - 0usize];
    ["Offset of field: VkSparseImageFormatProperties::imageGranularity"]
        [::core::mem::offset_of!(VkSparseImageFormatProperties, imageGranularity) - 4usize];
    ["Offset of field: VkSparseImageFormatProperties::flags"]
        [::core::mem::offset_of!(VkSparseImageFormatProperties, flags) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSparseImageMemoryRequirements"]
        [::core::mem::size_of::<VkSparseImageMemoryRequirements>() - 48usize];
    ["Alignment of VkSparseImageMemoryRequirements"]
        [::core::mem::align_of::<VkSparseImageMemoryRequirements>() - 8usize];
    ["Offset of field: VkSparseImageMemoryRequirements::formatProperties"]
        [::core::mem::offset_of!(VkSparseImageMemoryRequirements, formatProperties) - 0usize];
    ["Offset of field: VkSparseImageMemoryRequirements::imageMipTailFirstLod"]
        [::core::mem::offset_of!(VkSparseImageMemoryRequirements, imageMipTailFirstLod) - 20usize];
    ["Offset of field: VkSparseImageMemoryRequirements::imageMipTailSize"]
        [::core::mem::offset_of!(VkSparseImageMemoryRequirements, imageMipTailSize) - 24usize];
    ["Offset of field: VkSparseImageMemoryRequirements::imageMipTailOffset"]
        [::core::mem::offset_of!(VkSparseImageMemoryRequirements, imageMipTailOffset) - 32usize];
    ["Offset of field: VkSparseImageMemoryRequirements::imageMipTailStride"]
        [::core::mem::offset_of!(VkSparseImageMemoryRequirements, imageMipTailStride) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkFenceCreateInfo"][::core::mem::size_of::<VkFenceCreateInfo>() - 12usize];
    ["Alignment of VkFenceCreateInfo"][::core::mem::align_of::<VkFenceCreateInfo>() - 4usize];
    ["Offset of field: VkFenceCreateInfo::sType"]
        [::core::mem::offset_of!(VkFenceCreateInfo, sType) - 0usize];
    ["Offset of field: VkFenceCreateInfo::pNext"]
        [::core::mem::offset_of!(VkFenceCreateInfo, pNext) - 4usize];
    ["Offset of field: VkFenceCreateInfo::flags"]
        [::core::mem::offset_of!(VkFenceCreateInfo, flags) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSemaphoreCreateInfo"][::core::mem::size_of::<VkSemaphoreCreateInfo>() - 12usize];
    ["Alignment of VkSemaphoreCreateInfo"]
        [::core::mem::align_of::<VkSemaphoreCreateInfo>() - 4usize];
    ["Offset of field: VkSemaphoreCreateInfo::sType"]
        [::core::mem::offset_of!(VkSemaphoreCreateInfo, sType) - 0usize];
    ["Offset of field: VkSemaphoreCreateInfo::pNext"]
        [::core::mem::offset_of!(VkSemaphoreCreateInfo, pNext) - 4usize];
    ["Offset of field: VkSemaphoreCreateInfo::flags"]
        [::core::mem::offset_of!(VkSemaphoreCreateInfo, flags) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkEventCreateInfo"][::core::mem::size_of::<VkEventCreateInfo>() - 12usize];
    ["Alignment of VkEventCreateInfo"][::core::mem::align_of::<VkEventCreateInfo>() - 4usize];
    ["Offset of field: VkEventCreateInfo::sType"]
        [::core::mem::offset_of!(VkEventCreateInfo, sType) - 0usize];
    ["Offset of field: VkEventCreateInfo::pNext"]
        [::core::mem::offset_of!(VkEventCreateInfo, pNext) - 4usize];
    ["Offset of field: VkEventCreateInfo::flags"]
        [::core::mem::offset_of!(VkEventCreateInfo, flags) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkQueryPoolCreateInfo"][::core::mem::size_of::<VkQueryPoolCreateInfo>() - 24usize];
    ["Alignment of VkQueryPoolCreateInfo"]
        [::core::mem::align_of::<VkQueryPoolCreateInfo>() - 4usize];
    ["Offset of field: VkQueryPoolCreateInfo::sType"]
        [::core::mem::offset_of!(VkQueryPoolCreateInfo, sType) - 0usize];
    ["Offset of field: VkQueryPoolCreateInfo::pNext"]
        [::core::mem::offset_of!(VkQueryPoolCreateInfo, pNext) - 4usize];
    ["Offset of field: VkQueryPoolCreateInfo::flags"]
        [::core::mem::offset_of!(VkQueryPoolCreateInfo, flags) - 8usize];
    ["Offset of field: VkQueryPoolCreateInfo::queryType"]
        [::core::mem::offset_of!(VkQueryPoolCreateInfo, queryType) - 12usize];
    ["Offset of field: VkQueryPoolCreateInfo::queryCount"]
        [::core::mem::offset_of!(VkQueryPoolCreateInfo, queryCount) - 16usize];
    ["Offset of field: VkQueryPoolCreateInfo::pipelineStatistics"]
        [::core::mem::offset_of!(VkQueryPoolCreateInfo, pipelineStatistics) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkBufferCreateInfo"][::core::mem::size_of::<VkBufferCreateInfo>() - 40usize];
    ["Alignment of VkBufferCreateInfo"][::core::mem::align_of::<VkBufferCreateInfo>() - 8usize];
    ["Offset of field: VkBufferCreateInfo::sType"]
        [::core::mem::offset_of!(VkBufferCreateInfo, sType) - 0usize];
    ["Offset of field: VkBufferCreateInfo::pNext"]
        [::core::mem::offset_of!(VkBufferCreateInfo, pNext) - 4usize];
    ["Offset of field: VkBufferCreateInfo::flags"]
        [::core::mem::offset_of!(VkBufferCreateInfo, flags) - 8usize];
    ["Offset of field: VkBufferCreateInfo::size"]
        [::core::mem::offset_of!(VkBufferCreateInfo, size) - 16usize];
    ["Offset of field: VkBufferCreateInfo::usage"]
        [::core::mem::offset_of!(VkBufferCreateInfo, usage) - 24usize];
    ["Offset of field: VkBufferCreateInfo::sharingMode"]
        [::core::mem::offset_of!(VkBufferCreateInfo, sharingMode) - 28usize];
    ["Offset of field: VkBufferCreateInfo::queueFamilyIndexCount"]
        [::core::mem::offset_of!(VkBufferCreateInfo, queueFamilyIndexCount) - 32usize];
    ["Offset of field: VkBufferCreateInfo::pQueueFamilyIndices"]
        [::core::mem::offset_of!(VkBufferCreateInfo, pQueueFamilyIndices) - 36usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkBufferViewCreateInfo"][::core::mem::size_of::<VkBufferViewCreateInfo>() - 48usize];
    ["Alignment of VkBufferViewCreateInfo"]
        [::core::mem::align_of::<VkBufferViewCreateInfo>() - 8usize];
    ["Offset of field: VkBufferViewCreateInfo::sType"]
        [::core::mem::offset_of!(VkBufferViewCreateInfo, sType) - 0usize];
    ["Offset of field: VkBufferViewCreateInfo::pNext"]
        [::core::mem::offset_of!(VkBufferViewCreateInfo, pNext) - 4usize];
    ["Offset of field: VkBufferViewCreateInfo::flags"]
        [::core::mem::offset_of!(VkBufferViewCreateInfo, flags) - 8usize];
    ["Offset of field: VkBufferViewCreateInfo::buffer"]
        [::core::mem::offset_of!(VkBufferViewCreateInfo, buffer) - 16usize];
    ["Offset of field: VkBufferViewCreateInfo::format"]
        [::core::mem::offset_of!(VkBufferViewCreateInfo, format) - 24usize];
    ["Offset of field: VkBufferViewCreateInfo::offset"]
        [::core::mem::offset_of!(VkBufferViewCreateInfo, offset) - 32usize];
    ["Offset of field: VkBufferViewCreateInfo::range"]
        [::core::mem::offset_of!(VkBufferViewCreateInfo, range) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImageCreateInfo"][::core::mem::size_of::<VkImageCreateInfo>() - 68usize];
    ["Alignment of VkImageCreateInfo"][::core::mem::align_of::<VkImageCreateInfo>() - 4usize];
    ["Offset of field: VkImageCreateInfo::sType"]
        [::core::mem::offset_of!(VkImageCreateInfo, sType) - 0usize];
    ["Offset of field: VkImageCreateInfo::pNext"]
        [::core::mem::offset_of!(VkImageCreateInfo, pNext) - 4usize];
    ["Offset of field: VkImageCreateInfo::flags"]
        [::core::mem::offset_of!(VkImageCreateInfo, flags) - 8usize];
    ["Offset of field: VkImageCreateInfo::imageType"]
        [::core::mem::offset_of!(VkImageCreateInfo, imageType) - 12usize];
    ["Offset of field: VkImageCreateInfo::format"]
        [::core::mem::offset_of!(VkImageCreateInfo, format) - 16usize];
    ["Offset of field: VkImageCreateInfo::extent"]
        [::core::mem::offset_of!(VkImageCreateInfo, extent) - 20usize];
    ["Offset of field: VkImageCreateInfo::mipLevels"]
        [::core::mem::offset_of!(VkImageCreateInfo, mipLevels) - 32usize];
    ["Offset of field: VkImageCreateInfo::arrayLayers"]
        [::core::mem::offset_of!(VkImageCreateInfo, arrayLayers) - 36usize];
    ["Offset of field: VkImageCreateInfo::samples"]
        [::core::mem::offset_of!(VkImageCreateInfo, samples) - 40usize];
    ["Offset of field: VkImageCreateInfo::tiling"]
        [::core::mem::offset_of!(VkImageCreateInfo, tiling) - 44usize];
    ["Offset of field: VkImageCreateInfo::usage"]
        [::core::mem::offset_of!(VkImageCreateInfo, usage) - 48usize];
    ["Offset of field: VkImageCreateInfo::sharingMode"]
        [::core::mem::offset_of!(VkImageCreateInfo, sharingMode) - 52usize];
    ["Offset of field: VkImageCreateInfo::queueFamilyIndexCount"]
        [::core::mem::offset_of!(VkImageCreateInfo, queueFamilyIndexCount) - 56usize];
    ["Offset of field: VkImageCreateInfo::pQueueFamilyIndices"]
        [::core::mem::offset_of!(VkImageCreateInfo, pQueueFamilyIndices) - 60usize];
    ["Offset of field: VkImageCreateInfo::initialLayout"]
        [::core::mem::offset_of!(VkImageCreateInfo, initialLayout) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSubresourceLayout"][::core::mem::size_of::<VkSubresourceLayout>() - 40usize];
    ["Alignment of VkSubresourceLayout"][::core::mem::align_of::<VkSubresourceLayout>() - 8usize];
    ["Offset of field: VkSubresourceLayout::offset"]
        [::core::mem::offset_of!(VkSubresourceLayout, offset) - 0usize];
    ["Offset of field: VkSubresourceLayout::size"]
        [::core::mem::offset_of!(VkSubresourceLayout, size) - 8usize];
    ["Offset of field: VkSubresourceLayout::rowPitch"]
        [::core::mem::offset_of!(VkSubresourceLayout, rowPitch) - 16usize];
    ["Offset of field: VkSubresourceLayout::arrayPitch"]
        [::core::mem::offset_of!(VkSubresourceLayout, arrayPitch) - 24usize];
    ["Offset of field: VkSubresourceLayout::depthPitch"]
        [::core::mem::offset_of!(VkSubresourceLayout, depthPitch) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkComponentMapping"][::core::mem::size_of::<VkComponentMapping>() - 16usize];
    ["Alignment of VkComponentMapping"][::core::mem::align_of::<VkComponentMapping>() - 4usize];
    ["Offset of field: VkComponentMapping::r"]
        [::core::mem::offset_of!(VkComponentMapping, r) - 0usize];
    ["Offset of field: VkComponentMapping::g"]
        [::core::mem::offset_of!(VkComponentMapping, g) - 4usize];
    ["Offset of field: VkComponentMapping::b"]
        [::core::mem::offset_of!(VkComponentMapping, b) - 8usize];
    ["Offset of field: VkComponentMapping::a"]
        [::core::mem::offset_of!(VkComponentMapping, a) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImageViewCreateInfo"][::core::mem::size_of::<VkImageViewCreateInfo>() - 72usize];
    ["Alignment of VkImageViewCreateInfo"]
        [::core::mem::align_of::<VkImageViewCreateInfo>() - 8usize];
    ["Offset of field: VkImageViewCreateInfo::sType"]
        [::core::mem::offset_of!(VkImageViewCreateInfo, sType) - 0usize];
    ["Offset of field: VkImageViewCreateInfo::pNext"]
        [::core::mem::offset_of!(VkImageViewCreateInfo, pNext) - 4usize];
    ["Offset of field: VkImageViewCreateInfo::flags"]
        [::core::mem::offset_of!(VkImageViewCreateInfo, flags) - 8usize];
    ["Offset of field: VkImageViewCreateInfo::image"]
        [::core::mem::offset_of!(VkImageViewCreateInfo, image) - 16usize];
    ["Offset of field: VkImageViewCreateInfo::viewType"]
        [::core::mem::offset_of!(VkImageViewCreateInfo, viewType) - 24usize];
    ["Offset of field: VkImageViewCreateInfo::format"]
        [::core::mem::offset_of!(VkImageViewCreateInfo, format) - 28usize];
    ["Offset of field: VkImageViewCreateInfo::components"]
        [::core::mem::offset_of!(VkImageViewCreateInfo, components) - 32usize];
    ["Offset of field: VkImageViewCreateInfo::subresourceRange"]
        [::core::mem::offset_of!(VkImageViewCreateInfo, subresourceRange) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkShaderModuleCreateInfo"]
        [::core::mem::size_of::<VkShaderModuleCreateInfo>() - 20usize];
    ["Alignment of VkShaderModuleCreateInfo"]
        [::core::mem::align_of::<VkShaderModuleCreateInfo>() - 4usize];
    ["Offset of field: VkShaderModuleCreateInfo::sType"]
        [::core::mem::offset_of!(VkShaderModuleCreateInfo, sType) - 0usize];
    ["Offset of field: VkShaderModuleCreateInfo::pNext"]
        [::core::mem::offset_of!(VkShaderModuleCreateInfo, pNext) - 4usize];
    ["Offset of field: VkShaderModuleCreateInfo::flags"]
        [::core::mem::offset_of!(VkShaderModuleCreateInfo, flags) - 8usize];
    ["Offset of field: VkShaderModuleCreateInfo::codeSize"]
        [::core::mem::offset_of!(VkShaderModuleCreateInfo, codeSize) - 12usize];
    ["Offset of field: VkShaderModuleCreateInfo::pCode"]
        [::core::mem::offset_of!(VkShaderModuleCreateInfo, pCode) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPipelineCacheCreateInfo"]
        [::core::mem::size_of::<VkPipelineCacheCreateInfo>() - 20usize];
    ["Alignment of VkPipelineCacheCreateInfo"]
        [::core::mem::align_of::<VkPipelineCacheCreateInfo>() - 4usize];
    ["Offset of field: VkPipelineCacheCreateInfo::sType"]
        [::core::mem::offset_of!(VkPipelineCacheCreateInfo, sType) - 0usize];
    ["Offset of field: VkPipelineCacheCreateInfo::pNext"]
        [::core::mem::offset_of!(VkPipelineCacheCreateInfo, pNext) - 4usize];
    ["Offset of field: VkPipelineCacheCreateInfo::flags"]
        [::core::mem::offset_of!(VkPipelineCacheCreateInfo, flags) - 8usize];
    ["Offset of field: VkPipelineCacheCreateInfo::initialDataSize"]
        [::core::mem::offset_of!(VkPipelineCacheCreateInfo, initialDataSize) - 12usize];
    ["Offset of field: VkPipelineCacheCreateInfo::pInitialData"]
        [::core::mem::offset_of!(VkPipelineCacheCreateInfo, pInitialData) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSpecializationMapEntry"]
        [::core::mem::size_of::<VkSpecializationMapEntry>() - 12usize];
    ["Alignment of VkSpecializationMapEntry"]
        [::core::mem::align_of::<VkSpecializationMapEntry>() - 4usize];
    ["Offset of field: VkSpecializationMapEntry::constantID"]
        [::core::mem::offset_of!(VkSpecializationMapEntry, constantID) - 0usize];
    ["Offset of field: VkSpecializationMapEntry::offset"]
        [::core::mem::offset_of!(VkSpecializationMapEntry, offset) - 4usize];
    ["Offset of field: VkSpecializationMapEntry::size"]
        [::core::mem::offset_of!(VkSpecializationMapEntry, size) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSpecializationInfo"][::core::mem::size_of::<VkSpecializationInfo>() - 16usize];
    ["Alignment of VkSpecializationInfo"][::core::mem::align_of::<VkSpecializationInfo>() - 4usize];
    ["Offset of field: VkSpecializationInfo::mapEntryCount"]
        [::core::mem::offset_of!(VkSpecializationInfo, mapEntryCount) - 0usize];
    ["Offset of field: VkSpecializationInfo::pMapEntries"]
        [::core::mem::offset_of!(VkSpecializationInfo, pMapEntries) - 4usize];
    ["Offset of field: VkSpecializationInfo::dataSize"]
        [::core::mem::offset_of!(VkSpecializationInfo, dataSize) - 8usize];
    ["Offset of field: VkSpecializationInfo::pData"]
        [::core::mem::offset_of!(VkSpecializationInfo, pData) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPipelineShaderStageCreateInfo"]
        [::core::mem::size_of::<VkPipelineShaderStageCreateInfo>() - 32usize];
    ["Alignment of VkPipelineShaderStageCreateInfo"]
        [::core::mem::align_of::<VkPipelineShaderStageCreateInfo>() - 8usize];
    ["Offset of field: VkPipelineShaderStageCreateInfo::sType"]
        [::core::mem::offset_of!(VkPipelineShaderStageCreateInfo, sType) - 0usize];
    ["Offset of field: VkPipelineShaderStageCreateInfo::pNext"]
        [::core::mem::offset_of!(VkPipelineShaderStageCreateInfo, pNext) - 4usize];
    ["Offset of field: VkPipelineShaderStageCreateInfo::flags"]
        [::core::mem::offset_of!(VkPipelineShaderStageCreateInfo, flags) - 8usize];
    ["Offset of field: VkPipelineShaderStageCreateInfo::stage"]
        [::core::mem::offset_of!(VkPipelineShaderStageCreateInfo, stage) - 12usize];
    ["Offset of field: VkPipelineShaderStageCreateInfo::module"]
        [::core::mem::offset_of!(VkPipelineShaderStageCreateInfo, module) - 16usize];
    ["Offset of field: VkPipelineShaderStageCreateInfo::pName"]
        [::core::mem::offset_of!(VkPipelineShaderStageCreateInfo, pName) - 24usize];
    ["Offset of field: VkPipelineShaderStageCreateInfo::pSpecializationInfo"]
        [::core::mem::offset_of!(VkPipelineShaderStageCreateInfo, pSpecializationInfo) - 28usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkComputePipelineCreateInfo"]
        [::core::mem::size_of::<VkComputePipelineCreateInfo>() - 72usize];
    ["Alignment of VkComputePipelineCreateInfo"]
        [::core::mem::align_of::<VkComputePipelineCreateInfo>() - 8usize];
    ["Offset of field: VkComputePipelineCreateInfo::sType"]
        [::core::mem::offset_of!(VkComputePipelineCreateInfo, sType) - 0usize];
    ["Offset of field: VkComputePipelineCreateInfo::pNext"]
        [::core::mem::offset_of!(VkComputePipelineCreateInfo, pNext) - 4usize];
    ["Offset of field: VkComputePipelineCreateInfo::flags"]
        [::core::mem::offset_of!(VkComputePipelineCreateInfo, flags) - 8usize];
    ["Offset of field: VkComputePipelineCreateInfo::stage"]
        [::core::mem::offset_of!(VkComputePipelineCreateInfo, stage) - 16usize];
    ["Offset of field: VkComputePipelineCreateInfo::layout"]
        [::core::mem::offset_of!(VkComputePipelineCreateInfo, layout) - 48usize];
    ["Offset of field: VkComputePipelineCreateInfo::basePipelineHandle"]
        [::core::mem::offset_of!(VkComputePipelineCreateInfo, basePipelineHandle) - 56usize];
    ["Offset of field: VkComputePipelineCreateInfo::basePipelineIndex"]
        [::core::mem::offset_of!(VkComputePipelineCreateInfo, basePipelineIndex) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkVertexInputBindingDescription"]
        [::core::mem::size_of::<VkVertexInputBindingDescription>() - 12usize];
    ["Alignment of VkVertexInputBindingDescription"]
        [::core::mem::align_of::<VkVertexInputBindingDescription>() - 4usize];
    ["Offset of field: VkVertexInputBindingDescription::binding"]
        [::core::mem::offset_of!(VkVertexInputBindingDescription, binding) - 0usize];
    ["Offset of field: VkVertexInputBindingDescription::stride"]
        [::core::mem::offset_of!(VkVertexInputBindingDescription, stride) - 4usize];
    ["Offset of field: VkVertexInputBindingDescription::inputRate"]
        [::core::mem::offset_of!(VkVertexInputBindingDescription, inputRate) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkVertexInputAttributeDescription"]
        [::core::mem::size_of::<VkVertexInputAttributeDescription>() - 16usize];
    ["Alignment of VkVertexInputAttributeDescription"]
        [::core::mem::align_of::<VkVertexInputAttributeDescription>() - 4usize];
    ["Offset of field: VkVertexInputAttributeDescription::location"]
        [::core::mem::offset_of!(VkVertexInputAttributeDescription, location) - 0usize];
    ["Offset of field: VkVertexInputAttributeDescription::binding"]
        [::core::mem::offset_of!(VkVertexInputAttributeDescription, binding) - 4usize];
    ["Offset of field: VkVertexInputAttributeDescription::format"]
        [::core::mem::offset_of!(VkVertexInputAttributeDescription, format) - 8usize];
    ["Offset of field: VkVertexInputAttributeDescription::offset"]
        [::core::mem::offset_of!(VkVertexInputAttributeDescription, offset) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPipelineVertexInputStateCreateInfo"]
        [::core::mem::size_of::<VkPipelineVertexInputStateCreateInfo>() - 28usize];
    ["Alignment of VkPipelineVertexInputStateCreateInfo"]
        [::core::mem::align_of::<VkPipelineVertexInputStateCreateInfo>() - 4usize];
    ["Offset of field: VkPipelineVertexInputStateCreateInfo::sType"]
        [::core::mem::offset_of!(VkPipelineVertexInputStateCreateInfo, sType) - 0usize];
    ["Offset of field: VkPipelineVertexInputStateCreateInfo::pNext"]
        [::core::mem::offset_of!(VkPipelineVertexInputStateCreateInfo, pNext) - 4usize];
    ["Offset of field: VkPipelineVertexInputStateCreateInfo::flags"]
        [::core::mem::offset_of!(VkPipelineVertexInputStateCreateInfo, flags) - 8usize];
    ["Offset of field: VkPipelineVertexInputStateCreateInfo::vertexBindingDescriptionCount"][::core::mem::offset_of!(
        VkPipelineVertexInputStateCreateInfo,
        vertexBindingDescriptionCount
    )
        - 12usize];
    ["Offset of field: VkPipelineVertexInputStateCreateInfo::pVertexBindingDescriptions"][::core::mem::offset_of!(
        VkPipelineVertexInputStateCreateInfo,
        pVertexBindingDescriptions
    )
        - 16usize];
    ["Offset of field: VkPipelineVertexInputStateCreateInfo::vertexAttributeDescriptionCount"][::core::mem::offset_of!(
        VkPipelineVertexInputStateCreateInfo,
        vertexAttributeDescriptionCount
    )
        - 20usize];
    ["Offset of field: VkPipelineVertexInputStateCreateInfo::pVertexAttributeDescriptions"][::core::mem::offset_of!(
        VkPipelineVertexInputStateCreateInfo,
        pVertexAttributeDescriptions
    )
        - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPipelineInputAssemblyStateCreateInfo"]
        [::core::mem::size_of::<VkPipelineInputAssemblyStateCreateInfo>() - 20usize];
    ["Alignment of VkPipelineInputAssemblyStateCreateInfo"]
        [::core::mem::align_of::<VkPipelineInputAssemblyStateCreateInfo>() - 4usize];
    ["Offset of field: VkPipelineInputAssemblyStateCreateInfo::sType"]
        [::core::mem::offset_of!(VkPipelineInputAssemblyStateCreateInfo, sType) - 0usize];
    ["Offset of field: VkPipelineInputAssemblyStateCreateInfo::pNext"]
        [::core::mem::offset_of!(VkPipelineInputAssemblyStateCreateInfo, pNext) - 4usize];
    ["Offset of field: VkPipelineInputAssemblyStateCreateInfo::flags"]
        [::core::mem::offset_of!(VkPipelineInputAssemblyStateCreateInfo, flags) - 8usize];
    ["Offset of field: VkPipelineInputAssemblyStateCreateInfo::topology"]
        [::core::mem::offset_of!(VkPipelineInputAssemblyStateCreateInfo, topology) - 12usize];
    ["Offset of field: VkPipelineInputAssemblyStateCreateInfo::primitiveRestartEnable"][::core::mem::offset_of!(
        VkPipelineInputAssemblyStateCreateInfo,
        primitiveRestartEnable
    )
        - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPipelineTessellationStateCreateInfo"]
        [::core::mem::size_of::<VkPipelineTessellationStateCreateInfo>() - 16usize];
    ["Alignment of VkPipelineTessellationStateCreateInfo"]
        [::core::mem::align_of::<VkPipelineTessellationStateCreateInfo>() - 4usize];
    ["Offset of field: VkPipelineTessellationStateCreateInfo::sType"]
        [::core::mem::offset_of!(VkPipelineTessellationStateCreateInfo, sType) - 0usize];
    ["Offset of field: VkPipelineTessellationStateCreateInfo::pNext"]
        [::core::mem::offset_of!(VkPipelineTessellationStateCreateInfo, pNext) - 4usize];
    ["Offset of field: VkPipelineTessellationStateCreateInfo::flags"]
        [::core::mem::offset_of!(VkPipelineTessellationStateCreateInfo, flags) - 8usize];
    ["Offset of field: VkPipelineTessellationStateCreateInfo::patchControlPoints"][::core::mem::offset_of!(
        VkPipelineTessellationStateCreateInfo,
        patchControlPoints
    ) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkViewport"][::core::mem::size_of::<VkViewport>() - 24usize];
    ["Alignment of VkViewport"][::core::mem::align_of::<VkViewport>() - 4usize];
    ["Offset of field: VkViewport::x"][::core::mem::offset_of!(VkViewport, x) - 0usize];
    ["Offset of field: VkViewport::y"][::core::mem::offset_of!(VkViewport, y) - 4usize];
    ["Offset of field: VkViewport::width"][::core::mem::offset_of!(VkViewport, width) - 8usize];
    ["Offset of field: VkViewport::height"][::core::mem::offset_of!(VkViewport, height) - 12usize];
    ["Offset of field: VkViewport::minDepth"]
        [::core::mem::offset_of!(VkViewport, minDepth) - 16usize];
    ["Offset of field: VkViewport::maxDepth"]
        [::core::mem::offset_of!(VkViewport, maxDepth) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPipelineViewportStateCreateInfo"]
        [::core::mem::size_of::<VkPipelineViewportStateCreateInfo>() - 28usize];
    ["Alignment of VkPipelineViewportStateCreateInfo"]
        [::core::mem::align_of::<VkPipelineViewportStateCreateInfo>() - 4usize];
    ["Offset of field: VkPipelineViewportStateCreateInfo::sType"]
        [::core::mem::offset_of!(VkPipelineViewportStateCreateInfo, sType) - 0usize];
    ["Offset of field: VkPipelineViewportStateCreateInfo::pNext"]
        [::core::mem::offset_of!(VkPipelineViewportStateCreateInfo, pNext) - 4usize];
    ["Offset of field: VkPipelineViewportStateCreateInfo::flags"]
        [::core::mem::offset_of!(VkPipelineViewportStateCreateInfo, flags) - 8usize];
    ["Offset of field: VkPipelineViewportStateCreateInfo::viewportCount"]
        [::core::mem::offset_of!(VkPipelineViewportStateCreateInfo, viewportCount) - 12usize];
    ["Offset of field: VkPipelineViewportStateCreateInfo::pViewports"]
        [::core::mem::offset_of!(VkPipelineViewportStateCreateInfo, pViewports) - 16usize];
    ["Offset of field: VkPipelineViewportStateCreateInfo::scissorCount"]
        [::core::mem::offset_of!(VkPipelineViewportStateCreateInfo, scissorCount) - 20usize];
    ["Offset of field: VkPipelineViewportStateCreateInfo::pScissors"]
        [::core::mem::offset_of!(VkPipelineViewportStateCreateInfo, pScissors) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPipelineRasterizationStateCreateInfo"]
        [::core::mem::size_of::<VkPipelineRasterizationStateCreateInfo>() - 52usize];
    ["Alignment of VkPipelineRasterizationStateCreateInfo"]
        [::core::mem::align_of::<VkPipelineRasterizationStateCreateInfo>() - 4usize];
    ["Offset of field: VkPipelineRasterizationStateCreateInfo::sType"]
        [::core::mem::offset_of!(VkPipelineRasterizationStateCreateInfo, sType) - 0usize];
    ["Offset of field: VkPipelineRasterizationStateCreateInfo::pNext"]
        [::core::mem::offset_of!(VkPipelineRasterizationStateCreateInfo, pNext) - 4usize];
    ["Offset of field: VkPipelineRasterizationStateCreateInfo::flags"]
        [::core::mem::offset_of!(VkPipelineRasterizationStateCreateInfo, flags) - 8usize];
    ["Offset of field: VkPipelineRasterizationStateCreateInfo::depthClampEnable"][::core::mem::offset_of!(
        VkPipelineRasterizationStateCreateInfo,
        depthClampEnable
    ) - 12usize];
    ["Offset of field: VkPipelineRasterizationStateCreateInfo::rasterizerDiscardEnable"][::core::mem::offset_of!(
        VkPipelineRasterizationStateCreateInfo,
        rasterizerDiscardEnable
    )
        - 16usize];
    ["Offset of field: VkPipelineRasterizationStateCreateInfo::polygonMode"]
        [::core::mem::offset_of!(VkPipelineRasterizationStateCreateInfo, polygonMode) - 20usize];
    ["Offset of field: VkPipelineRasterizationStateCreateInfo::cullMode"]
        [::core::mem::offset_of!(VkPipelineRasterizationStateCreateInfo, cullMode) - 24usize];
    ["Offset of field: VkPipelineRasterizationStateCreateInfo::frontFace"]
        [::core::mem::offset_of!(VkPipelineRasterizationStateCreateInfo, frontFace) - 28usize];
    ["Offset of field: VkPipelineRasterizationStateCreateInfo::depthBiasEnable"][::core::mem::offset_of!(
        VkPipelineRasterizationStateCreateInfo,
        depthBiasEnable
    ) - 32usize];
    ["Offset of field: VkPipelineRasterizationStateCreateInfo::depthBiasConstantFactor"][::core::mem::offset_of!(
        VkPipelineRasterizationStateCreateInfo,
        depthBiasConstantFactor
    )
        - 36usize];
    ["Offset of field: VkPipelineRasterizationStateCreateInfo::depthBiasClamp"]
        [::core::mem::offset_of!(VkPipelineRasterizationStateCreateInfo, depthBiasClamp) - 40usize];
    ["Offset of field: VkPipelineRasterizationStateCreateInfo::depthBiasSlopeFactor"][::core::mem::offset_of!(
        VkPipelineRasterizationStateCreateInfo,
        depthBiasSlopeFactor
    ) - 44usize];
    ["Offset of field: VkPipelineRasterizationStateCreateInfo::lineWidth"]
        [::core::mem::offset_of!(VkPipelineRasterizationStateCreateInfo, lineWidth) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPipelineMultisampleStateCreateInfo"]
        [::core::mem::size_of::<VkPipelineMultisampleStateCreateInfo>() - 36usize];
    ["Alignment of VkPipelineMultisampleStateCreateInfo"]
        [::core::mem::align_of::<VkPipelineMultisampleStateCreateInfo>() - 4usize];
    ["Offset of field: VkPipelineMultisampleStateCreateInfo::sType"]
        [::core::mem::offset_of!(VkPipelineMultisampleStateCreateInfo, sType) - 0usize];
    ["Offset of field: VkPipelineMultisampleStateCreateInfo::pNext"]
        [::core::mem::offset_of!(VkPipelineMultisampleStateCreateInfo, pNext) - 4usize];
    ["Offset of field: VkPipelineMultisampleStateCreateInfo::flags"]
        [::core::mem::offset_of!(VkPipelineMultisampleStateCreateInfo, flags) - 8usize];
    ["Offset of field: VkPipelineMultisampleStateCreateInfo::rasterizationSamples"][::core::mem::offset_of!(
        VkPipelineMultisampleStateCreateInfo,
        rasterizationSamples
    ) - 12usize];
    ["Offset of field: VkPipelineMultisampleStateCreateInfo::sampleShadingEnable"][::core::mem::offset_of!(
        VkPipelineMultisampleStateCreateInfo,
        sampleShadingEnable
    ) - 16usize];
    ["Offset of field: VkPipelineMultisampleStateCreateInfo::minSampleShading"]
        [::core::mem::offset_of!(VkPipelineMultisampleStateCreateInfo, minSampleShading) - 20usize];
    ["Offset of field: VkPipelineMultisampleStateCreateInfo::pSampleMask"]
        [::core::mem::offset_of!(VkPipelineMultisampleStateCreateInfo, pSampleMask) - 24usize];
    ["Offset of field: VkPipelineMultisampleStateCreateInfo::alphaToCoverageEnable"][::core::mem::offset_of!(
        VkPipelineMultisampleStateCreateInfo,
        alphaToCoverageEnable
    ) - 28usize];
    ["Offset of field: VkPipelineMultisampleStateCreateInfo::alphaToOneEnable"]
        [::core::mem::offset_of!(VkPipelineMultisampleStateCreateInfo, alphaToOneEnable) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkStencilOpState"][::core::mem::size_of::<VkStencilOpState>() - 28usize];
    ["Alignment of VkStencilOpState"][::core::mem::align_of::<VkStencilOpState>() - 4usize];
    ["Offset of field: VkStencilOpState::failOp"]
        [::core::mem::offset_of!(VkStencilOpState, failOp) - 0usize];
    ["Offset of field: VkStencilOpState::passOp"]
        [::core::mem::offset_of!(VkStencilOpState, passOp) - 4usize];
    ["Offset of field: VkStencilOpState::depthFailOp"]
        [::core::mem::offset_of!(VkStencilOpState, depthFailOp) - 8usize];
    ["Offset of field: VkStencilOpState::compareOp"]
        [::core::mem::offset_of!(VkStencilOpState, compareOp) - 12usize];
    ["Offset of field: VkStencilOpState::compareMask"]
        [::core::mem::offset_of!(VkStencilOpState, compareMask) - 16usize];
    ["Offset of field: VkStencilOpState::writeMask"]
        [::core::mem::offset_of!(VkStencilOpState, writeMask) - 20usize];
    ["Offset of field: VkStencilOpState::reference"]
        [::core::mem::offset_of!(VkStencilOpState, reference) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPipelineDepthStencilStateCreateInfo"]
        [::core::mem::size_of::<VkPipelineDepthStencilStateCreateInfo>() - 96usize];
    ["Alignment of VkPipelineDepthStencilStateCreateInfo"]
        [::core::mem::align_of::<VkPipelineDepthStencilStateCreateInfo>() - 4usize];
    ["Offset of field: VkPipelineDepthStencilStateCreateInfo::sType"]
        [::core::mem::offset_of!(VkPipelineDepthStencilStateCreateInfo, sType) - 0usize];
    ["Offset of field: VkPipelineDepthStencilStateCreateInfo::pNext"]
        [::core::mem::offset_of!(VkPipelineDepthStencilStateCreateInfo, pNext) - 4usize];
    ["Offset of field: VkPipelineDepthStencilStateCreateInfo::flags"]
        [::core::mem::offset_of!(VkPipelineDepthStencilStateCreateInfo, flags) - 8usize];
    ["Offset of field: VkPipelineDepthStencilStateCreateInfo::depthTestEnable"]
        [::core::mem::offset_of!(VkPipelineDepthStencilStateCreateInfo, depthTestEnable) - 12usize];
    ["Offset of field: VkPipelineDepthStencilStateCreateInfo::depthWriteEnable"][::core::mem::offset_of!(
        VkPipelineDepthStencilStateCreateInfo,
        depthWriteEnable
    ) - 16usize];
    ["Offset of field: VkPipelineDepthStencilStateCreateInfo::depthCompareOp"]
        [::core::mem::offset_of!(VkPipelineDepthStencilStateCreateInfo, depthCompareOp) - 20usize];
    ["Offset of field: VkPipelineDepthStencilStateCreateInfo::depthBoundsTestEnable"][::core::mem::offset_of!(
        VkPipelineDepthStencilStateCreateInfo,
        depthBoundsTestEnable
    ) - 24usize];
    ["Offset of field: VkPipelineDepthStencilStateCreateInfo::stencilTestEnable"][::core::mem::offset_of!(
        VkPipelineDepthStencilStateCreateInfo,
        stencilTestEnable
    ) - 28usize];
    ["Offset of field: VkPipelineDepthStencilStateCreateInfo::front"]
        [::core::mem::offset_of!(VkPipelineDepthStencilStateCreateInfo, front) - 32usize];
    ["Offset of field: VkPipelineDepthStencilStateCreateInfo::back"]
        [::core::mem::offset_of!(VkPipelineDepthStencilStateCreateInfo, back) - 60usize];
    ["Offset of field: VkPipelineDepthStencilStateCreateInfo::minDepthBounds"]
        [::core::mem::offset_of!(VkPipelineDepthStencilStateCreateInfo, minDepthBounds) - 88usize];
    ["Offset of field: VkPipelineDepthStencilStateCreateInfo::maxDepthBounds"]
        [::core::mem::offset_of!(VkPipelineDepthStencilStateCreateInfo, maxDepthBounds) - 92usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPipelineColorBlendAttachmentState"]
        [::core::mem::size_of::<VkPipelineColorBlendAttachmentState>() - 32usize];
    ["Alignment of VkPipelineColorBlendAttachmentState"]
        [::core::mem::align_of::<VkPipelineColorBlendAttachmentState>() - 4usize];
    ["Offset of field: VkPipelineColorBlendAttachmentState::blendEnable"]
        [::core::mem::offset_of!(VkPipelineColorBlendAttachmentState, blendEnable) - 0usize];
    ["Offset of field: VkPipelineColorBlendAttachmentState::srcColorBlendFactor"][::core::mem::offset_of!(
        VkPipelineColorBlendAttachmentState,
        srcColorBlendFactor
    ) - 4usize];
    ["Offset of field: VkPipelineColorBlendAttachmentState::dstColorBlendFactor"][::core::mem::offset_of!(
        VkPipelineColorBlendAttachmentState,
        dstColorBlendFactor
    ) - 8usize];
    ["Offset of field: VkPipelineColorBlendAttachmentState::colorBlendOp"]
        [::core::mem::offset_of!(VkPipelineColorBlendAttachmentState, colorBlendOp) - 12usize];
    ["Offset of field: VkPipelineColorBlendAttachmentState::srcAlphaBlendFactor"][::core::mem::offset_of!(
        VkPipelineColorBlendAttachmentState,
        srcAlphaBlendFactor
    ) - 16usize];
    ["Offset of field: VkPipelineColorBlendAttachmentState::dstAlphaBlendFactor"][::core::mem::offset_of!(
        VkPipelineColorBlendAttachmentState,
        dstAlphaBlendFactor
    ) - 20usize];
    ["Offset of field: VkPipelineColorBlendAttachmentState::alphaBlendOp"]
        [::core::mem::offset_of!(VkPipelineColorBlendAttachmentState, alphaBlendOp) - 24usize];
    ["Offset of field: VkPipelineColorBlendAttachmentState::colorWriteMask"]
        [::core::mem::offset_of!(VkPipelineColorBlendAttachmentState, colorWriteMask) - 28usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPipelineColorBlendStateCreateInfo"]
        [::core::mem::size_of::<VkPipelineColorBlendStateCreateInfo>() - 44usize];
    ["Alignment of VkPipelineColorBlendStateCreateInfo"]
        [::core::mem::align_of::<VkPipelineColorBlendStateCreateInfo>() - 4usize];
    ["Offset of field: VkPipelineColorBlendStateCreateInfo::sType"]
        [::core::mem::offset_of!(VkPipelineColorBlendStateCreateInfo, sType) - 0usize];
    ["Offset of field: VkPipelineColorBlendStateCreateInfo::pNext"]
        [::core::mem::offset_of!(VkPipelineColorBlendStateCreateInfo, pNext) - 4usize];
    ["Offset of field: VkPipelineColorBlendStateCreateInfo::flags"]
        [::core::mem::offset_of!(VkPipelineColorBlendStateCreateInfo, flags) - 8usize];
    ["Offset of field: VkPipelineColorBlendStateCreateInfo::logicOpEnable"]
        [::core::mem::offset_of!(VkPipelineColorBlendStateCreateInfo, logicOpEnable) - 12usize];
    ["Offset of field: VkPipelineColorBlendStateCreateInfo::logicOp"]
        [::core::mem::offset_of!(VkPipelineColorBlendStateCreateInfo, logicOp) - 16usize];
    ["Offset of field: VkPipelineColorBlendStateCreateInfo::attachmentCount"]
        [::core::mem::offset_of!(VkPipelineColorBlendStateCreateInfo, attachmentCount) - 20usize];
    ["Offset of field: VkPipelineColorBlendStateCreateInfo::pAttachments"]
        [::core::mem::offset_of!(VkPipelineColorBlendStateCreateInfo, pAttachments) - 24usize];
    ["Offset of field: VkPipelineColorBlendStateCreateInfo::blendConstants"]
        [::core::mem::offset_of!(VkPipelineColorBlendStateCreateInfo, blendConstants) - 28usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPipelineDynamicStateCreateInfo"]
        [::core::mem::size_of::<VkPipelineDynamicStateCreateInfo>() - 20usize];
    ["Alignment of VkPipelineDynamicStateCreateInfo"]
        [::core::mem::align_of::<VkPipelineDynamicStateCreateInfo>() - 4usize];
    ["Offset of field: VkPipelineDynamicStateCreateInfo::sType"]
        [::core::mem::offset_of!(VkPipelineDynamicStateCreateInfo, sType) - 0usize];
    ["Offset of field: VkPipelineDynamicStateCreateInfo::pNext"]
        [::core::mem::offset_of!(VkPipelineDynamicStateCreateInfo, pNext) - 4usize];
    ["Offset of field: VkPipelineDynamicStateCreateInfo::flags"]
        [::core::mem::offset_of!(VkPipelineDynamicStateCreateInfo, flags) - 8usize];
    ["Offset of field: VkPipelineDynamicStateCreateInfo::dynamicStateCount"]
        [::core::mem::offset_of!(VkPipelineDynamicStateCreateInfo, dynamicStateCount) - 12usize];
    ["Offset of field: VkPipelineDynamicStateCreateInfo::pDynamicStates"]
        [::core::mem::offset_of!(VkPipelineDynamicStateCreateInfo, pDynamicStates) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkGraphicsPipelineCreateInfo"]
        [::core::mem::size_of::<VkGraphicsPipelineCreateInfo>() - 96usize];
    ["Alignment of VkGraphicsPipelineCreateInfo"]
        [::core::mem::align_of::<VkGraphicsPipelineCreateInfo>() - 8usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::sType"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, sType) - 0usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::pNext"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, pNext) - 4usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::flags"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, flags) - 8usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::stageCount"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, stageCount) - 12usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::pStages"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, pStages) - 16usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::pVertexInputState"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, pVertexInputState) - 20usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::pInputAssemblyState"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, pInputAssemblyState) - 24usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::pTessellationState"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, pTessellationState) - 28usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::pViewportState"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, pViewportState) - 32usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::pRasterizationState"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, pRasterizationState) - 36usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::pMultisampleState"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, pMultisampleState) - 40usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::pDepthStencilState"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, pDepthStencilState) - 44usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::pColorBlendState"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, pColorBlendState) - 48usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::pDynamicState"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, pDynamicState) - 52usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::layout"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, layout) - 56usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::renderPass"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, renderPass) - 64usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::subpass"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, subpass) - 72usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::basePipelineHandle"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, basePipelineHandle) - 80usize];
    ["Offset of field: VkGraphicsPipelineCreateInfo::basePipelineIndex"]
        [::core::mem::offset_of!(VkGraphicsPipelineCreateInfo, basePipelineIndex) - 88usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPushConstantRange"][::core::mem::size_of::<VkPushConstantRange>() - 12usize];
    ["Alignment of VkPushConstantRange"][::core::mem::align_of::<VkPushConstantRange>() - 4usize];
    ["Offset of field: VkPushConstantRange::stageFlags"]
        [::core::mem::offset_of!(VkPushConstantRange, stageFlags) - 0usize];
    ["Offset of field: VkPushConstantRange::offset"]
        [::core::mem::offset_of!(VkPushConstantRange, offset) - 4usize];
    ["Offset of field: VkPushConstantRange::size"]
        [::core::mem::offset_of!(VkPushConstantRange, size) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPipelineLayoutCreateInfo"]
        [::core::mem::size_of::<VkPipelineLayoutCreateInfo>() - 28usize];
    ["Alignment of VkPipelineLayoutCreateInfo"]
        [::core::mem::align_of::<VkPipelineLayoutCreateInfo>() - 4usize];
    ["Offset of field: VkPipelineLayoutCreateInfo::sType"]
        [::core::mem::offset_of!(VkPipelineLayoutCreateInfo, sType) - 0usize];
    ["Offset of field: VkPipelineLayoutCreateInfo::pNext"]
        [::core::mem::offset_of!(VkPipelineLayoutCreateInfo, pNext) - 4usize];
    ["Offset of field: VkPipelineLayoutCreateInfo::flags"]
        [::core::mem::offset_of!(VkPipelineLayoutCreateInfo, flags) - 8usize];
    ["Offset of field: VkPipelineLayoutCreateInfo::setLayoutCount"]
        [::core::mem::offset_of!(VkPipelineLayoutCreateInfo, setLayoutCount) - 12usize];
    ["Offset of field: VkPipelineLayoutCreateInfo::pSetLayouts"]
        [::core::mem::offset_of!(VkPipelineLayoutCreateInfo, pSetLayouts) - 16usize];
    ["Offset of field: VkPipelineLayoutCreateInfo::pushConstantRangeCount"]
        [::core::mem::offset_of!(VkPipelineLayoutCreateInfo, pushConstantRangeCount) - 20usize];
    ["Offset of field: VkPipelineLayoutCreateInfo::pPushConstantRanges"]
        [::core::mem::offset_of!(VkPipelineLayoutCreateInfo, pPushConstantRanges) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSamplerCreateInfo"][::core::mem::size_of::<VkSamplerCreateInfo>() - 72usize];
    ["Alignment of VkSamplerCreateInfo"][::core::mem::align_of::<VkSamplerCreateInfo>() - 4usize];
    ["Offset of field: VkSamplerCreateInfo::sType"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, sType) - 0usize];
    ["Offset of field: VkSamplerCreateInfo::pNext"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, pNext) - 4usize];
    ["Offset of field: VkSamplerCreateInfo::flags"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, flags) - 8usize];
    ["Offset of field: VkSamplerCreateInfo::magFilter"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, magFilter) - 12usize];
    ["Offset of field: VkSamplerCreateInfo::minFilter"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, minFilter) - 16usize];
    ["Offset of field: VkSamplerCreateInfo::mipmapMode"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, mipmapMode) - 20usize];
    ["Offset of field: VkSamplerCreateInfo::addressModeU"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, addressModeU) - 24usize];
    ["Offset of field: VkSamplerCreateInfo::addressModeV"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, addressModeV) - 28usize];
    ["Offset of field: VkSamplerCreateInfo::addressModeW"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, addressModeW) - 32usize];
    ["Offset of field: VkSamplerCreateInfo::mipLodBias"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, mipLodBias) - 36usize];
    ["Offset of field: VkSamplerCreateInfo::anisotropyEnable"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, anisotropyEnable) - 40usize];
    ["Offset of field: VkSamplerCreateInfo::maxAnisotropy"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, maxAnisotropy) - 44usize];
    ["Offset of field: VkSamplerCreateInfo::compareEnable"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, compareEnable) - 48usize];
    ["Offset of field: VkSamplerCreateInfo::compareOp"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, compareOp) - 52usize];
    ["Offset of field: VkSamplerCreateInfo::minLod"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, minLod) - 56usize];
    ["Offset of field: VkSamplerCreateInfo::maxLod"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, maxLod) - 60usize];
    ["Offset of field: VkSamplerCreateInfo::borderColor"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, borderColor) - 64usize];
    ["Offset of field: VkSamplerCreateInfo::unnormalizedCoordinates"]
        [::core::mem::offset_of!(VkSamplerCreateInfo, unnormalizedCoordinates) - 68usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkCopyDescriptorSet"][::core::mem::size_of::<VkCopyDescriptorSet>() - 48usize];
    ["Alignment of VkCopyDescriptorSet"][::core::mem::align_of::<VkCopyDescriptorSet>() - 8usize];
    ["Offset of field: VkCopyDescriptorSet::sType"]
        [::core::mem::offset_of!(VkCopyDescriptorSet, sType) - 0usize];
    ["Offset of field: VkCopyDescriptorSet::pNext"]
        [::core::mem::offset_of!(VkCopyDescriptorSet, pNext) - 4usize];
    ["Offset of field: VkCopyDescriptorSet::srcSet"]
        [::core::mem::offset_of!(VkCopyDescriptorSet, srcSet) - 8usize];
    ["Offset of field: VkCopyDescriptorSet::srcBinding"]
        [::core::mem::offset_of!(VkCopyDescriptorSet, srcBinding) - 16usize];
    ["Offset of field: VkCopyDescriptorSet::srcArrayElement"]
        [::core::mem::offset_of!(VkCopyDescriptorSet, srcArrayElement) - 20usize];
    ["Offset of field: VkCopyDescriptorSet::dstSet"]
        [::core::mem::offset_of!(VkCopyDescriptorSet, dstSet) - 24usize];
    ["Offset of field: VkCopyDescriptorSet::dstBinding"]
        [::core::mem::offset_of!(VkCopyDescriptorSet, dstBinding) - 32usize];
    ["Offset of field: VkCopyDescriptorSet::dstArrayElement"]
        [::core::mem::offset_of!(VkCopyDescriptorSet, dstArrayElement) - 36usize];
    ["Offset of field: VkCopyDescriptorSet::descriptorCount"]
        [::core::mem::offset_of!(VkCopyDescriptorSet, descriptorCount) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDescriptorBufferInfo"][::core::mem::size_of::<VkDescriptorBufferInfo>() - 24usize];
    ["Alignment of VkDescriptorBufferInfo"]
        [::core::mem::align_of::<VkDescriptorBufferInfo>() - 8usize];
    ["Offset of field: VkDescriptorBufferInfo::buffer"]
        [::core::mem::offset_of!(VkDescriptorBufferInfo, buffer) - 0usize];
    ["Offset of field: VkDescriptorBufferInfo::offset"]
        [::core::mem::offset_of!(VkDescriptorBufferInfo, offset) - 8usize];
    ["Offset of field: VkDescriptorBufferInfo::range"]
        [::core::mem::offset_of!(VkDescriptorBufferInfo, range) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDescriptorImageInfo"][::core::mem::size_of::<VkDescriptorImageInfo>() - 24usize];
    ["Alignment of VkDescriptorImageInfo"]
        [::core::mem::align_of::<VkDescriptorImageInfo>() - 8usize];
    ["Offset of field: VkDescriptorImageInfo::sampler"]
        [::core::mem::offset_of!(VkDescriptorImageInfo, sampler) - 0usize];
    ["Offset of field: VkDescriptorImageInfo::imageView"]
        [::core::mem::offset_of!(VkDescriptorImageInfo, imageView) - 8usize];
    ["Offset of field: VkDescriptorImageInfo::imageLayout"]
        [::core::mem::offset_of!(VkDescriptorImageInfo, imageLayout) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDescriptorPoolSize"][::core::mem::size_of::<VkDescriptorPoolSize>() - 8usize];
    ["Alignment of VkDescriptorPoolSize"][::core::mem::align_of::<VkDescriptorPoolSize>() - 4usize];
    ["Offset of field: VkDescriptorPoolSize::type_"]
        [::core::mem::offset_of!(VkDescriptorPoolSize, type_) - 0usize];
    ["Offset of field: VkDescriptorPoolSize::descriptorCount"]
        [::core::mem::offset_of!(VkDescriptorPoolSize, descriptorCount) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDescriptorPoolCreateInfo"]
        [::core::mem::size_of::<VkDescriptorPoolCreateInfo>() - 24usize];
    ["Alignment of VkDescriptorPoolCreateInfo"]
        [::core::mem::align_of::<VkDescriptorPoolCreateInfo>() - 4usize];
    ["Offset of field: VkDescriptorPoolCreateInfo::sType"]
        [::core::mem::offset_of!(VkDescriptorPoolCreateInfo, sType) - 0usize];
    ["Offset of field: VkDescriptorPoolCreateInfo::pNext"]
        [::core::mem::offset_of!(VkDescriptorPoolCreateInfo, pNext) - 4usize];
    ["Offset of field: VkDescriptorPoolCreateInfo::flags"]
        [::core::mem::offset_of!(VkDescriptorPoolCreateInfo, flags) - 8usize];
    ["Offset of field: VkDescriptorPoolCreateInfo::maxSets"]
        [::core::mem::offset_of!(VkDescriptorPoolCreateInfo, maxSets) - 12usize];
    ["Offset of field: VkDescriptorPoolCreateInfo::poolSizeCount"]
        [::core::mem::offset_of!(VkDescriptorPoolCreateInfo, poolSizeCount) - 16usize];
    ["Offset of field: VkDescriptorPoolCreateInfo::pPoolSizes"]
        [::core::mem::offset_of!(VkDescriptorPoolCreateInfo, pPoolSizes) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDescriptorSetAllocateInfo"]
        [::core::mem::size_of::<VkDescriptorSetAllocateInfo>() - 24usize];
    ["Alignment of VkDescriptorSetAllocateInfo"]
        [::core::mem::align_of::<VkDescriptorSetAllocateInfo>() - 8usize];
    ["Offset of field: VkDescriptorSetAllocateInfo::sType"]
        [::core::mem::offset_of!(VkDescriptorSetAllocateInfo, sType) - 0usize];
    ["Offset of field: VkDescriptorSetAllocateInfo::pNext"]
        [::core::mem::offset_of!(VkDescriptorSetAllocateInfo, pNext) - 4usize];
    ["Offset of field: VkDescriptorSetAllocateInfo::descriptorPool"]
        [::core::mem::offset_of!(VkDescriptorSetAllocateInfo, descriptorPool) - 8usize];
    ["Offset of field: VkDescriptorSetAllocateInfo::descriptorSetCount"]
        [::core::mem::offset_of!(VkDescriptorSetAllocateInfo, descriptorSetCount) - 16usize];
    ["Offset of field: VkDescriptorSetAllocateInfo::pSetLayouts"]
        [::core::mem::offset_of!(VkDescriptorSetAllocateInfo, pSetLayouts) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDescriptorSetLayoutBinding"]
        [::core::mem::size_of::<VkDescriptorSetLayoutBinding>() - 20usize];
    ["Alignment of VkDescriptorSetLayoutBinding"]
        [::core::mem::align_of::<VkDescriptorSetLayoutBinding>() - 4usize];
    ["Offset of field: VkDescriptorSetLayoutBinding::binding"]
        [::core::mem::offset_of!(VkDescriptorSetLayoutBinding, binding) - 0usize];
    ["Offset of field: VkDescriptorSetLayoutBinding::descriptorType"]
        [::core::mem::offset_of!(VkDescriptorSetLayoutBinding, descriptorType) - 4usize];
    ["Offset of field: VkDescriptorSetLayoutBinding::descriptorCount"]
        [::core::mem::offset_of!(VkDescriptorSetLayoutBinding, descriptorCount) - 8usize];
    ["Offset of field: VkDescriptorSetLayoutBinding::stageFlags"]
        [::core::mem::offset_of!(VkDescriptorSetLayoutBinding, stageFlags) - 12usize];
    ["Offset of field: VkDescriptorSetLayoutBinding::pImmutableSamplers"]
        [::core::mem::offset_of!(VkDescriptorSetLayoutBinding, pImmutableSamplers) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDescriptorSetLayoutCreateInfo"]
        [::core::mem::size_of::<VkDescriptorSetLayoutCreateInfo>() - 20usize];
    ["Alignment of VkDescriptorSetLayoutCreateInfo"]
        [::core::mem::align_of::<VkDescriptorSetLayoutCreateInfo>() - 4usize];
    ["Offset of field: VkDescriptorSetLayoutCreateInfo::sType"]
        [::core::mem::offset_of!(VkDescriptorSetLayoutCreateInfo, sType) - 0usize];
    ["Offset of field: VkDescriptorSetLayoutCreateInfo::pNext"]
        [::core::mem::offset_of!(VkDescriptorSetLayoutCreateInfo, pNext) - 4usize];
    ["Offset of field: VkDescriptorSetLayoutCreateInfo::flags"]
        [::core::mem::offset_of!(VkDescriptorSetLayoutCreateInfo, flags) - 8usize];
    ["Offset of field: VkDescriptorSetLayoutCreateInfo::bindingCount"]
        [::core::mem::offset_of!(VkDescriptorSetLayoutCreateInfo, bindingCount) - 12usize];
    ["Offset of field: VkDescriptorSetLayoutCreateInfo::pBindings"]
        [::core::mem::offset_of!(VkDescriptorSetLayoutCreateInfo, pBindings) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkWriteDescriptorSet"][::core::mem::size_of::<VkWriteDescriptorSet>() - 48usize];
    ["Alignment of VkWriteDescriptorSet"][::core::mem::align_of::<VkWriteDescriptorSet>() - 8usize];
    ["Offset of field: VkWriteDescriptorSet::sType"]
        [::core::mem::offset_of!(VkWriteDescriptorSet, sType) - 0usize];
    ["Offset of field: VkWriteDescriptorSet::pNext"]
        [::core::mem::offset_of!(VkWriteDescriptorSet, pNext) - 4usize];
    ["Offset of field: VkWriteDescriptorSet::dstSet"]
        [::core::mem::offset_of!(VkWriteDescriptorSet, dstSet) - 8usize];
    ["Offset of field: VkWriteDescriptorSet::dstBinding"]
        [::core::mem::offset_of!(VkWriteDescriptorSet, dstBinding) - 16usize];
    ["Offset of field: VkWriteDescriptorSet::dstArrayElement"]
        [::core::mem::offset_of!(VkWriteDescriptorSet, dstArrayElement) - 20usize];
    ["Offset of field: VkWriteDescriptorSet::descriptorCount"]
        [::core::mem::offset_of!(VkWriteDescriptorSet, descriptorCount) - 24usize];
    ["Offset of field: VkWriteDescriptorSet::descriptorType"]
        [::core::mem::offset_of!(VkWriteDescriptorSet, descriptorType) - 28usize];
    ["Offset of field: VkWriteDescriptorSet::pImageInfo"]
        [::core::mem::offset_of!(VkWriteDescriptorSet, pImageInfo) - 32usize];
    ["Offset of field: VkWriteDescriptorSet::pBufferInfo"]
        [::core::mem::offset_of!(VkWriteDescriptorSet, pBufferInfo) - 36usize];
    ["Offset of field: VkWriteDescriptorSet::pTexelBufferView"]
        [::core::mem::offset_of!(VkWriteDescriptorSet, pTexelBufferView) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkAttachmentDescription"]
        [::core::mem::size_of::<VkAttachmentDescription>() - 36usize];
    ["Alignment of VkAttachmentDescription"]
        [::core::mem::align_of::<VkAttachmentDescription>() - 4usize];
    ["Offset of field: VkAttachmentDescription::flags"]
        [::core::mem::offset_of!(VkAttachmentDescription, flags) - 0usize];
    ["Offset of field: VkAttachmentDescription::format"]
        [::core::mem::offset_of!(VkAttachmentDescription, format) - 4usize];
    ["Offset of field: VkAttachmentDescription::samples"]
        [::core::mem::offset_of!(VkAttachmentDescription, samples) - 8usize];
    ["Offset of field: VkAttachmentDescription::loadOp"]
        [::core::mem::offset_of!(VkAttachmentDescription, loadOp) - 12usize];
    ["Offset of field: VkAttachmentDescription::storeOp"]
        [::core::mem::offset_of!(VkAttachmentDescription, storeOp) - 16usize];
    ["Offset of field: VkAttachmentDescription::stencilLoadOp"]
        [::core::mem::offset_of!(VkAttachmentDescription, stencilLoadOp) - 20usize];
    ["Offset of field: VkAttachmentDescription::stencilStoreOp"]
        [::core::mem::offset_of!(VkAttachmentDescription, stencilStoreOp) - 24usize];
    ["Offset of field: VkAttachmentDescription::initialLayout"]
        [::core::mem::offset_of!(VkAttachmentDescription, initialLayout) - 28usize];
    ["Offset of field: VkAttachmentDescription::finalLayout"]
        [::core::mem::offset_of!(VkAttachmentDescription, finalLayout) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkAttachmentReference"][::core::mem::size_of::<VkAttachmentReference>() - 8usize];
    ["Alignment of VkAttachmentReference"]
        [::core::mem::align_of::<VkAttachmentReference>() - 4usize];
    ["Offset of field: VkAttachmentReference::attachment"]
        [::core::mem::offset_of!(VkAttachmentReference, attachment) - 0usize];
    ["Offset of field: VkAttachmentReference::layout"]
        [::core::mem::offset_of!(VkAttachmentReference, layout) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkFramebufferCreateInfo"]
        [::core::mem::size_of::<VkFramebufferCreateInfo>() - 48usize];
    ["Alignment of VkFramebufferCreateInfo"]
        [::core::mem::align_of::<VkFramebufferCreateInfo>() - 8usize];
    ["Offset of field: VkFramebufferCreateInfo::sType"]
        [::core::mem::offset_of!(VkFramebufferCreateInfo, sType) - 0usize];
    ["Offset of field: VkFramebufferCreateInfo::pNext"]
        [::core::mem::offset_of!(VkFramebufferCreateInfo, pNext) - 4usize];
    ["Offset of field: VkFramebufferCreateInfo::flags"]
        [::core::mem::offset_of!(VkFramebufferCreateInfo, flags) - 8usize];
    ["Offset of field: VkFramebufferCreateInfo::renderPass"]
        [::core::mem::offset_of!(VkFramebufferCreateInfo, renderPass) - 16usize];
    ["Offset of field: VkFramebufferCreateInfo::attachmentCount"]
        [::core::mem::offset_of!(VkFramebufferCreateInfo, attachmentCount) - 24usize];
    ["Offset of field: VkFramebufferCreateInfo::pAttachments"]
        [::core::mem::offset_of!(VkFramebufferCreateInfo, pAttachments) - 28usize];
    ["Offset of field: VkFramebufferCreateInfo::width"]
        [::core::mem::offset_of!(VkFramebufferCreateInfo, width) - 32usize];
    ["Offset of field: VkFramebufferCreateInfo::height"]
        [::core::mem::offset_of!(VkFramebufferCreateInfo, height) - 36usize];
    ["Offset of field: VkFramebufferCreateInfo::layers"]
        [::core::mem::offset_of!(VkFramebufferCreateInfo, layers) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSubpassDescription"][::core::mem::size_of::<VkSubpassDescription>() - 40usize];
    ["Alignment of VkSubpassDescription"][::core::mem::align_of::<VkSubpassDescription>() - 4usize];
    ["Offset of field: VkSubpassDescription::flags"]
        [::core::mem::offset_of!(VkSubpassDescription, flags) - 0usize];
    ["Offset of field: VkSubpassDescription::pipelineBindPoint"]
        [::core::mem::offset_of!(VkSubpassDescription, pipelineBindPoint) - 4usize];
    ["Offset of field: VkSubpassDescription::inputAttachmentCount"]
        [::core::mem::offset_of!(VkSubpassDescription, inputAttachmentCount) - 8usize];
    ["Offset of field: VkSubpassDescription::pInputAttachments"]
        [::core::mem::offset_of!(VkSubpassDescription, pInputAttachments) - 12usize];
    ["Offset of field: VkSubpassDescription::colorAttachmentCount"]
        [::core::mem::offset_of!(VkSubpassDescription, colorAttachmentCount) - 16usize];
    ["Offset of field: VkSubpassDescription::pColorAttachments"]
        [::core::mem::offset_of!(VkSubpassDescription, pColorAttachments) - 20usize];
    ["Offset of field: VkSubpassDescription::pResolveAttachments"]
        [::core::mem::offset_of!(VkSubpassDescription, pResolveAttachments) - 24usize];
    ["Offset of field: VkSubpassDescription::pDepthStencilAttachment"]
        [::core::mem::offset_of!(VkSubpassDescription, pDepthStencilAttachment) - 28usize];
    ["Offset of field: VkSubpassDescription::preserveAttachmentCount"]
        [::core::mem::offset_of!(VkSubpassDescription, preserveAttachmentCount) - 32usize];
    ["Offset of field: VkSubpassDescription::pPreserveAttachments"]
        [::core::mem::offset_of!(VkSubpassDescription, pPreserveAttachments) - 36usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSubpassDependency"][::core::mem::size_of::<VkSubpassDependency>() - 28usize];
    ["Alignment of VkSubpassDependency"][::core::mem::align_of::<VkSubpassDependency>() - 4usize];
    ["Offset of field: VkSubpassDependency::srcSubpass"]
        [::core::mem::offset_of!(VkSubpassDependency, srcSubpass) - 0usize];
    ["Offset of field: VkSubpassDependency::dstSubpass"]
        [::core::mem::offset_of!(VkSubpassDependency, dstSubpass) - 4usize];
    ["Offset of field: VkSubpassDependency::srcStageMask"]
        [::core::mem::offset_of!(VkSubpassDependency, srcStageMask) - 8usize];
    ["Offset of field: VkSubpassDependency::dstStageMask"]
        [::core::mem::offset_of!(VkSubpassDependency, dstStageMask) - 12usize];
    ["Offset of field: VkSubpassDependency::srcAccessMask"]
        [::core::mem::offset_of!(VkSubpassDependency, srcAccessMask) - 16usize];
    ["Offset of field: VkSubpassDependency::dstAccessMask"]
        [::core::mem::offset_of!(VkSubpassDependency, dstAccessMask) - 20usize];
    ["Offset of field: VkSubpassDependency::dependencyFlags"]
        [::core::mem::offset_of!(VkSubpassDependency, dependencyFlags) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkRenderPassCreateInfo"][::core::mem::size_of::<VkRenderPassCreateInfo>() - 36usize];
    ["Alignment of VkRenderPassCreateInfo"]
        [::core::mem::align_of::<VkRenderPassCreateInfo>() - 4usize];
    ["Offset of field: VkRenderPassCreateInfo::sType"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo, sType) - 0usize];
    ["Offset of field: VkRenderPassCreateInfo::pNext"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo, pNext) - 4usize];
    ["Offset of field: VkRenderPassCreateInfo::flags"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo, flags) - 8usize];
    ["Offset of field: VkRenderPassCreateInfo::attachmentCount"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo, attachmentCount) - 12usize];
    ["Offset of field: VkRenderPassCreateInfo::pAttachments"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo, pAttachments) - 16usize];
    ["Offset of field: VkRenderPassCreateInfo::subpassCount"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo, subpassCount) - 20usize];
    ["Offset of field: VkRenderPassCreateInfo::pSubpasses"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo, pSubpasses) - 24usize];
    ["Offset of field: VkRenderPassCreateInfo::dependencyCount"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo, dependencyCount) - 28usize];
    ["Offset of field: VkRenderPassCreateInfo::pDependencies"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo, pDependencies) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkCommandPoolCreateInfo"]
        [::core::mem::size_of::<VkCommandPoolCreateInfo>() - 16usize];
    ["Alignment of VkCommandPoolCreateInfo"]
        [::core::mem::align_of::<VkCommandPoolCreateInfo>() - 4usize];
    ["Offset of field: VkCommandPoolCreateInfo::sType"]
        [::core::mem::offset_of!(VkCommandPoolCreateInfo, sType) - 0usize];
    ["Offset of field: VkCommandPoolCreateInfo::pNext"]
        [::core::mem::offset_of!(VkCommandPoolCreateInfo, pNext) - 4usize];
    ["Offset of field: VkCommandPoolCreateInfo::flags"]
        [::core::mem::offset_of!(VkCommandPoolCreateInfo, flags) - 8usize];
    ["Offset of field: VkCommandPoolCreateInfo::queueFamilyIndex"]
        [::core::mem::offset_of!(VkCommandPoolCreateInfo, queueFamilyIndex) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkCommandBufferAllocateInfo"]
        [::core::mem::size_of::<VkCommandBufferAllocateInfo>() - 24usize];
    ["Alignment of VkCommandBufferAllocateInfo"]
        [::core::mem::align_of::<VkCommandBufferAllocateInfo>() - 8usize];
    ["Offset of field: VkCommandBufferAllocateInfo::sType"]
        [::core::mem::offset_of!(VkCommandBufferAllocateInfo, sType) - 0usize];
    ["Offset of field: VkCommandBufferAllocateInfo::pNext"]
        [::core::mem::offset_of!(VkCommandBufferAllocateInfo, pNext) - 4usize];
    ["Offset of field: VkCommandBufferAllocateInfo::commandPool"]
        [::core::mem::offset_of!(VkCommandBufferAllocateInfo, commandPool) - 8usize];
    ["Offset of field: VkCommandBufferAllocateInfo::level"]
        [::core::mem::offset_of!(VkCommandBufferAllocateInfo, level) - 16usize];
    ["Offset of field: VkCommandBufferAllocateInfo::commandBufferCount"]
        [::core::mem::offset_of!(VkCommandBufferAllocateInfo, commandBufferCount) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkCommandBufferInheritanceInfo"]
        [::core::mem::size_of::<VkCommandBufferInheritanceInfo>() - 48usize];
    ["Alignment of VkCommandBufferInheritanceInfo"]
        [::core::mem::align_of::<VkCommandBufferInheritanceInfo>() - 8usize];
    ["Offset of field: VkCommandBufferInheritanceInfo::sType"]
        [::core::mem::offset_of!(VkCommandBufferInheritanceInfo, sType) - 0usize];
    ["Offset of field: VkCommandBufferInheritanceInfo::pNext"]
        [::core::mem::offset_of!(VkCommandBufferInheritanceInfo, pNext) - 4usize];
    ["Offset of field: VkCommandBufferInheritanceInfo::renderPass"]
        [::core::mem::offset_of!(VkCommandBufferInheritanceInfo, renderPass) - 8usize];
    ["Offset of field: VkCommandBufferInheritanceInfo::subpass"]
        [::core::mem::offset_of!(VkCommandBufferInheritanceInfo, subpass) - 16usize];
    ["Offset of field: VkCommandBufferInheritanceInfo::framebuffer"]
        [::core::mem::offset_of!(VkCommandBufferInheritanceInfo, framebuffer) - 24usize];
    ["Offset of field: VkCommandBufferInheritanceInfo::occlusionQueryEnable"]
        [::core::mem::offset_of!(VkCommandBufferInheritanceInfo, occlusionQueryEnable) - 32usize];
    ["Offset of field: VkCommandBufferInheritanceInfo::queryFlags"]
        [::core::mem::offset_of!(VkCommandBufferInheritanceInfo, queryFlags) - 36usize];
    ["Offset of field: VkCommandBufferInheritanceInfo::pipelineStatistics"]
        [::core::mem::offset_of!(VkCommandBufferInheritanceInfo, pipelineStatistics) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkCommandBufferBeginInfo"]
        [::core::mem::size_of::<VkCommandBufferBeginInfo>() - 16usize];
    ["Alignment of VkCommandBufferBeginInfo"]
        [::core::mem::align_of::<VkCommandBufferBeginInfo>() - 4usize];
    ["Offset of field: VkCommandBufferBeginInfo::sType"]
        [::core::mem::offset_of!(VkCommandBufferBeginInfo, sType) - 0usize];
    ["Offset of field: VkCommandBufferBeginInfo::pNext"]
        [::core::mem::offset_of!(VkCommandBufferBeginInfo, pNext) - 4usize];
    ["Offset of field: VkCommandBufferBeginInfo::flags"]
        [::core::mem::offset_of!(VkCommandBufferBeginInfo, flags) - 8usize];
    ["Offset of field: VkCommandBufferBeginInfo::pInheritanceInfo"]
        [::core::mem::offset_of!(VkCommandBufferBeginInfo, pInheritanceInfo) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkBufferCopy"][::core::mem::size_of::<VkBufferCopy>() - 24usize];
    ["Alignment of VkBufferCopy"][::core::mem::align_of::<VkBufferCopy>() - 8usize];
    ["Offset of field: VkBufferCopy::srcOffset"]
        [::core::mem::offset_of!(VkBufferCopy, srcOffset) - 0usize];
    ["Offset of field: VkBufferCopy::dstOffset"]
        [::core::mem::offset_of!(VkBufferCopy, dstOffset) - 8usize];
    ["Offset of field: VkBufferCopy::size"][::core::mem::offset_of!(VkBufferCopy, size) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImageSubresourceLayers"]
        [::core::mem::size_of::<VkImageSubresourceLayers>() - 16usize];
    ["Alignment of VkImageSubresourceLayers"]
        [::core::mem::align_of::<VkImageSubresourceLayers>() - 4usize];
    ["Offset of field: VkImageSubresourceLayers::aspectMask"]
        [::core::mem::offset_of!(VkImageSubresourceLayers, aspectMask) - 0usize];
    ["Offset of field: VkImageSubresourceLayers::mipLevel"]
        [::core::mem::offset_of!(VkImageSubresourceLayers, mipLevel) - 4usize];
    ["Offset of field: VkImageSubresourceLayers::baseArrayLayer"]
        [::core::mem::offset_of!(VkImageSubresourceLayers, baseArrayLayer) - 8usize];
    ["Offset of field: VkImageSubresourceLayers::layerCount"]
        [::core::mem::offset_of!(VkImageSubresourceLayers, layerCount) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkBufferImageCopy"][::core::mem::size_of::<VkBufferImageCopy>() - 56usize];
    ["Alignment of VkBufferImageCopy"][::core::mem::align_of::<VkBufferImageCopy>() - 8usize];
    ["Offset of field: VkBufferImageCopy::bufferOffset"]
        [::core::mem::offset_of!(VkBufferImageCopy, bufferOffset) - 0usize];
    ["Offset of field: VkBufferImageCopy::bufferRowLength"]
        [::core::mem::offset_of!(VkBufferImageCopy, bufferRowLength) - 8usize];
    ["Offset of field: VkBufferImageCopy::bufferImageHeight"]
        [::core::mem::offset_of!(VkBufferImageCopy, bufferImageHeight) - 12usize];
    ["Offset of field: VkBufferImageCopy::imageSubresource"]
        [::core::mem::offset_of!(VkBufferImageCopy, imageSubresource) - 16usize];
    ["Offset of field: VkBufferImageCopy::imageOffset"]
        [::core::mem::offset_of!(VkBufferImageCopy, imageOffset) - 32usize];
    ["Offset of field: VkBufferImageCopy::imageExtent"]
        [::core::mem::offset_of!(VkBufferImageCopy, imageExtent) - 44usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkClearColorValue"][::core::mem::size_of::<VkClearColorValue>() - 16usize];
    ["Alignment of VkClearColorValue"][::core::mem::align_of::<VkClearColorValue>() - 4usize];
    ["Offset of field: VkClearColorValue::float32"]
        [::core::mem::offset_of!(VkClearColorValue, float32) - 0usize];
    ["Offset of field: VkClearColorValue::int32"]
        [::core::mem::offset_of!(VkClearColorValue, int32) - 0usize];
    ["Offset of field: VkClearColorValue::uint32"]
        [::core::mem::offset_of!(VkClearColorValue, uint32) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkClearDepthStencilValue"]
        [::core::mem::size_of::<VkClearDepthStencilValue>() - 8usize];
    ["Alignment of VkClearDepthStencilValue"]
        [::core::mem::align_of::<VkClearDepthStencilValue>() - 4usize];
    ["Offset of field: VkClearDepthStencilValue::depth"]
        [::core::mem::offset_of!(VkClearDepthStencilValue, depth) - 0usize];
    ["Offset of field: VkClearDepthStencilValue::stencil"]
        [::core::mem::offset_of!(VkClearDepthStencilValue, stencil) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkClearValue"][::core::mem::size_of::<VkClearValue>() - 16usize];
    ["Alignment of VkClearValue"][::core::mem::align_of::<VkClearValue>() - 4usize];
    ["Offset of field: VkClearValue::color"][::core::mem::offset_of!(VkClearValue, color) - 0usize];
    ["Offset of field: VkClearValue::depthStencil"]
        [::core::mem::offset_of!(VkClearValue, depthStencil) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkClearAttachment"][::core::mem::size_of::<VkClearAttachment>() - 24usize];
    ["Alignment of VkClearAttachment"][::core::mem::align_of::<VkClearAttachment>() - 4usize];
    ["Offset of field: VkClearAttachment::aspectMask"]
        [::core::mem::offset_of!(VkClearAttachment, aspectMask) - 0usize];
    ["Offset of field: VkClearAttachment::colorAttachment"]
        [::core::mem::offset_of!(VkClearAttachment, colorAttachment) - 4usize];
    ["Offset of field: VkClearAttachment::clearValue"]
        [::core::mem::offset_of!(VkClearAttachment, clearValue) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkClearRect"][::core::mem::size_of::<VkClearRect>() - 24usize];
    ["Alignment of VkClearRect"][::core::mem::align_of::<VkClearRect>() - 4usize];
    ["Offset of field: VkClearRect::rect"][::core::mem::offset_of!(VkClearRect, rect) - 0usize];
    ["Offset of field: VkClearRect::baseArrayLayer"]
        [::core::mem::offset_of!(VkClearRect, baseArrayLayer) - 16usize];
    ["Offset of field: VkClearRect::layerCount"]
        [::core::mem::offset_of!(VkClearRect, layerCount) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImageBlit"][::core::mem::size_of::<VkImageBlit>() - 80usize];
    ["Alignment of VkImageBlit"][::core::mem::align_of::<VkImageBlit>() - 4usize];
    ["Offset of field: VkImageBlit::srcSubresource"]
        [::core::mem::offset_of!(VkImageBlit, srcSubresource) - 0usize];
    ["Offset of field: VkImageBlit::srcOffsets"]
        [::core::mem::offset_of!(VkImageBlit, srcOffsets) - 16usize];
    ["Offset of field: VkImageBlit::dstSubresource"]
        [::core::mem::offset_of!(VkImageBlit, dstSubresource) - 40usize];
    ["Offset of field: VkImageBlit::dstOffsets"]
        [::core::mem::offset_of!(VkImageBlit, dstOffsets) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImageCopy"][::core::mem::size_of::<VkImageCopy>() - 68usize];
    ["Alignment of VkImageCopy"][::core::mem::align_of::<VkImageCopy>() - 4usize];
    ["Offset of field: VkImageCopy::srcSubresource"]
        [::core::mem::offset_of!(VkImageCopy, srcSubresource) - 0usize];
    ["Offset of field: VkImageCopy::srcOffset"]
        [::core::mem::offset_of!(VkImageCopy, srcOffset) - 16usize];
    ["Offset of field: VkImageCopy::dstSubresource"]
        [::core::mem::offset_of!(VkImageCopy, dstSubresource) - 28usize];
    ["Offset of field: VkImageCopy::dstOffset"]
        [::core::mem::offset_of!(VkImageCopy, dstOffset) - 44usize];
    ["Offset of field: VkImageCopy::extent"]
        [::core::mem::offset_of!(VkImageCopy, extent) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImageResolve"][::core::mem::size_of::<VkImageResolve>() - 68usize];
    ["Alignment of VkImageResolve"][::core::mem::align_of::<VkImageResolve>() - 4usize];
    ["Offset of field: VkImageResolve::srcSubresource"]
        [::core::mem::offset_of!(VkImageResolve, srcSubresource) - 0usize];
    ["Offset of field: VkImageResolve::srcOffset"]
        [::core::mem::offset_of!(VkImageResolve, srcOffset) - 16usize];
    ["Offset of field: VkImageResolve::dstSubresource"]
        [::core::mem::offset_of!(VkImageResolve, dstSubresource) - 28usize];
    ["Offset of field: VkImageResolve::dstOffset"]
        [::core::mem::offset_of!(VkImageResolve, dstOffset) - 44usize];
    ["Offset of field: VkImageResolve::extent"]
        [::core::mem::offset_of!(VkImageResolve, extent) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkRenderPassBeginInfo"][::core::mem::size_of::<VkRenderPassBeginInfo>() - 48usize];
    ["Alignment of VkRenderPassBeginInfo"]
        [::core::mem::align_of::<VkRenderPassBeginInfo>() - 8usize];
    ["Offset of field: VkRenderPassBeginInfo::sType"]
        [::core::mem::offset_of!(VkRenderPassBeginInfo, sType) - 0usize];
    ["Offset of field: VkRenderPassBeginInfo::pNext"]
        [::core::mem::offset_of!(VkRenderPassBeginInfo, pNext) - 4usize];
    ["Offset of field: VkRenderPassBeginInfo::renderPass"]
        [::core::mem::offset_of!(VkRenderPassBeginInfo, renderPass) - 8usize];
    ["Offset of field: VkRenderPassBeginInfo::framebuffer"]
        [::core::mem::offset_of!(VkRenderPassBeginInfo, framebuffer) - 16usize];
    ["Offset of field: VkRenderPassBeginInfo::renderArea"]
        [::core::mem::offset_of!(VkRenderPassBeginInfo, renderArea) - 24usize];
    ["Offset of field: VkRenderPassBeginInfo::clearValueCount"]
        [::core::mem::offset_of!(VkRenderPassBeginInfo, clearValueCount) - 40usize];
    ["Offset of field: VkRenderPassBeginInfo::pClearValues"]
        [::core::mem::offset_of!(VkRenderPassBeginInfo, pClearValues) - 44usize];
};
pub const VkPointClippingBehavior_VK_POINT_CLIPPING_BEHAVIOR_ALL_CLIP_PLANES:
    VkPointClippingBehavior = 0;
pub const VkPointClippingBehavior_VK_POINT_CLIPPING_BEHAVIOR_USER_CLIP_PLANES_ONLY:
    VkPointClippingBehavior = 1;
pub const VkPointClippingBehavior_VK_POINT_CLIPPING_BEHAVIOR_ALL_CLIP_PLANES_KHR:
    VkPointClippingBehavior = 0;
pub const VkPointClippingBehavior_VK_POINT_CLIPPING_BEHAVIOR_USER_CLIP_PLANES_ONLY_KHR:
    VkPointClippingBehavior = 1;
pub const VkPointClippingBehavior_VK_POINT_CLIPPING_BEHAVIOR_MAX_ENUM: VkPointClippingBehavior =
    2147483647;
pub const VkTessellationDomainOrigin_VK_TESSELLATION_DOMAIN_ORIGIN_UPPER_LEFT:
    VkTessellationDomainOrigin = 0;
pub const VkTessellationDomainOrigin_VK_TESSELLATION_DOMAIN_ORIGIN_LOWER_LEFT:
    VkTessellationDomainOrigin = 1;
pub const VkTessellationDomainOrigin_VK_TESSELLATION_DOMAIN_ORIGIN_UPPER_LEFT_KHR:
    VkTessellationDomainOrigin = 0;
pub const VkTessellationDomainOrigin_VK_TESSELLATION_DOMAIN_ORIGIN_LOWER_LEFT_KHR:
    VkTessellationDomainOrigin = 1;
pub const VkTessellationDomainOrigin_VK_TESSELLATION_DOMAIN_ORIGIN_MAX_ENUM:
    VkTessellationDomainOrigin = 2147483647;
pub const VkSamplerYcbcrModelConversion_VK_SAMPLER_YCBCR_MODEL_CONVERSION_RGB_IDENTITY:
    VkSamplerYcbcrModelConversion = 0;
pub const VkSamplerYcbcrModelConversion_VK_SAMPLER_YCBCR_MODEL_CONVERSION_YCBCR_IDENTITY:
    VkSamplerYcbcrModelConversion = 1;
pub const VkSamplerYcbcrModelConversion_VK_SAMPLER_YCBCR_MODEL_CONVERSION_YCBCR_709:
    VkSamplerYcbcrModelConversion = 2;
pub const VkSamplerYcbcrModelConversion_VK_SAMPLER_YCBCR_MODEL_CONVERSION_YCBCR_601:
    VkSamplerYcbcrModelConversion = 3;
pub const VkSamplerYcbcrModelConversion_VK_SAMPLER_YCBCR_MODEL_CONVERSION_YCBCR_2020:
    VkSamplerYcbcrModelConversion = 4;
pub const VkSamplerYcbcrModelConversion_VK_SAMPLER_YCBCR_MODEL_CONVERSION_RGB_IDENTITY_KHR:
    VkSamplerYcbcrModelConversion = 0;
pub const VkSamplerYcbcrModelConversion_VK_SAMPLER_YCBCR_MODEL_CONVERSION_YCBCR_IDENTITY_KHR:
    VkSamplerYcbcrModelConversion = 1;
pub const VkSamplerYcbcrModelConversion_VK_SAMPLER_YCBCR_MODEL_CONVERSION_YCBCR_709_KHR:
    VkSamplerYcbcrModelConversion = 2;
pub const VkSamplerYcbcrModelConversion_VK_SAMPLER_YCBCR_MODEL_CONVERSION_YCBCR_601_KHR:
    VkSamplerYcbcrModelConversion = 3;
pub const VkSamplerYcbcrModelConversion_VK_SAMPLER_YCBCR_MODEL_CONVERSION_YCBCR_2020_KHR:
    VkSamplerYcbcrModelConversion = 4;
pub const VkSamplerYcbcrModelConversion_VK_SAMPLER_YCBCR_MODEL_CONVERSION_MAX_ENUM:
    VkSamplerYcbcrModelConversion = 2147483647;
pub const VkSamplerYcbcrRange_VK_SAMPLER_YCBCR_RANGE_ITU_FULL: VkSamplerYcbcrRange = 0;
pub const VkSamplerYcbcrRange_VK_SAMPLER_YCBCR_RANGE_ITU_NARROW: VkSamplerYcbcrRange = 1;
pub const VkSamplerYcbcrRange_VK_SAMPLER_YCBCR_RANGE_ITU_FULL_KHR: VkSamplerYcbcrRange = 0;
pub const VkSamplerYcbcrRange_VK_SAMPLER_YCBCR_RANGE_ITU_NARROW_KHR: VkSamplerYcbcrRange = 1;
pub const VkSamplerYcbcrRange_VK_SAMPLER_YCBCR_RANGE_MAX_ENUM: VkSamplerYcbcrRange = 2147483647;
pub const VkChromaLocation_VK_CHROMA_LOCATION_COSITED_EVEN: VkChromaLocation = 0;
pub const VkChromaLocation_VK_CHROMA_LOCATION_MIDPOINT: VkChromaLocation = 1;
pub const VkChromaLocation_VK_CHROMA_LOCATION_COSITED_EVEN_KHR: VkChromaLocation = 0;
pub const VkChromaLocation_VK_CHROMA_LOCATION_MIDPOINT_KHR: VkChromaLocation = 1;
pub const VkChromaLocation_VK_CHROMA_LOCATION_MAX_ENUM: VkChromaLocation = 2147483647;
pub const VkDescriptorUpdateTemplateType_VK_DESCRIPTOR_UPDATE_TEMPLATE_TYPE_DESCRIPTOR_SET:
    VkDescriptorUpdateTemplateType = 0;
pub const VkDescriptorUpdateTemplateType_VK_DESCRIPTOR_UPDATE_TEMPLATE_TYPE_PUSH_DESCRIPTORS:
    VkDescriptorUpdateTemplateType = 1;
pub const VkDescriptorUpdateTemplateType_VK_DESCRIPTOR_UPDATE_TEMPLATE_TYPE_PUSH_DESCRIPTORS_KHR:
    VkDescriptorUpdateTemplateType = 1;
pub const VkDescriptorUpdateTemplateType_VK_DESCRIPTOR_UPDATE_TEMPLATE_TYPE_DESCRIPTOR_SET_KHR:
    VkDescriptorUpdateTemplateType = 0;
pub const VkDescriptorUpdateTemplateType_VK_DESCRIPTOR_UPDATE_TEMPLATE_TYPE_MAX_ENUM:
    VkDescriptorUpdateTemplateType = 2147483647;
pub const VkSubgroupFeatureFlagBits_VK_SUBGROUP_FEATURE_BASIC_BIT: VkSubgroupFeatureFlagBits = 1;
pub const VkSubgroupFeatureFlagBits_VK_SUBGROUP_FEATURE_VOTE_BIT: VkSubgroupFeatureFlagBits = 2;
pub const VkSubgroupFeatureFlagBits_VK_SUBGROUP_FEATURE_ARITHMETIC_BIT: VkSubgroupFeatureFlagBits =
    4;
pub const VkSubgroupFeatureFlagBits_VK_SUBGROUP_FEATURE_BALLOT_BIT: VkSubgroupFeatureFlagBits = 8;
pub const VkSubgroupFeatureFlagBits_VK_SUBGROUP_FEATURE_SHUFFLE_BIT: VkSubgroupFeatureFlagBits = 16;
pub const VkSubgroupFeatureFlagBits_VK_SUBGROUP_FEATURE_SHUFFLE_RELATIVE_BIT:
    VkSubgroupFeatureFlagBits = 32;
pub const VkSubgroupFeatureFlagBits_VK_SUBGROUP_FEATURE_CLUSTERED_BIT: VkSubgroupFeatureFlagBits =
    64;
pub const VkSubgroupFeatureFlagBits_VK_SUBGROUP_FEATURE_QUAD_BIT: VkSubgroupFeatureFlagBits = 128;
pub const VkSubgroupFeatureFlagBits_VK_SUBGROUP_FEATURE_ROTATE_BIT: VkSubgroupFeatureFlagBits = 512;
pub const VkSubgroupFeatureFlagBits_VK_SUBGROUP_FEATURE_ROTATE_CLUSTERED_BIT:
    VkSubgroupFeatureFlagBits = 1024;
pub const VkSubgroupFeatureFlagBits_VK_SUBGROUP_FEATURE_PARTITIONED_BIT_NV:
    VkSubgroupFeatureFlagBits = 256;
pub const VkSubgroupFeatureFlagBits_VK_SUBGROUP_FEATURE_ROTATE_BIT_KHR: VkSubgroupFeatureFlagBits =
    512;
pub const VkSubgroupFeatureFlagBits_VK_SUBGROUP_FEATURE_ROTATE_CLUSTERED_BIT_KHR:
    VkSubgroupFeatureFlagBits = 1024;
pub const VkSubgroupFeatureFlagBits_VK_SUBGROUP_FEATURE_FLAG_BITS_MAX_ENUM:
    VkSubgroupFeatureFlagBits = 2147483647;
pub const VkPeerMemoryFeatureFlagBits_VK_PEER_MEMORY_FEATURE_COPY_SRC_BIT:
    VkPeerMemoryFeatureFlagBits = 1;
pub const VkPeerMemoryFeatureFlagBits_VK_PEER_MEMORY_FEATURE_COPY_DST_BIT:
    VkPeerMemoryFeatureFlagBits = 2;
pub const VkPeerMemoryFeatureFlagBits_VK_PEER_MEMORY_FEATURE_GENERIC_SRC_BIT:
    VkPeerMemoryFeatureFlagBits = 4;
pub const VkPeerMemoryFeatureFlagBits_VK_PEER_MEMORY_FEATURE_GENERIC_DST_BIT:
    VkPeerMemoryFeatureFlagBits = 8;
pub const VkPeerMemoryFeatureFlagBits_VK_PEER_MEMORY_FEATURE_COPY_SRC_BIT_KHR:
    VkPeerMemoryFeatureFlagBits = 1;
pub const VkPeerMemoryFeatureFlagBits_VK_PEER_MEMORY_FEATURE_COPY_DST_BIT_KHR:
    VkPeerMemoryFeatureFlagBits = 2;
pub const VkPeerMemoryFeatureFlagBits_VK_PEER_MEMORY_FEATURE_GENERIC_SRC_BIT_KHR:
    VkPeerMemoryFeatureFlagBits = 4;
pub const VkPeerMemoryFeatureFlagBits_VK_PEER_MEMORY_FEATURE_GENERIC_DST_BIT_KHR:
    VkPeerMemoryFeatureFlagBits = 8;
pub const VkPeerMemoryFeatureFlagBits_VK_PEER_MEMORY_FEATURE_FLAG_BITS_MAX_ENUM:
    VkPeerMemoryFeatureFlagBits = 2147483647;
pub const VkMemoryAllocateFlagBits_VK_MEMORY_ALLOCATE_DEVICE_MASK_BIT: VkMemoryAllocateFlagBits = 1;
pub const VkMemoryAllocateFlagBits_VK_MEMORY_ALLOCATE_DEVICE_ADDRESS_BIT: VkMemoryAllocateFlagBits =
    2;
pub const VkMemoryAllocateFlagBits_VK_MEMORY_ALLOCATE_DEVICE_ADDRESS_CAPTURE_REPLAY_BIT:
    VkMemoryAllocateFlagBits = 4;
pub const VkMemoryAllocateFlagBits_VK_MEMORY_ALLOCATE_ZERO_INITIALIZE_BIT_EXT:
    VkMemoryAllocateFlagBits = 8;
pub const VkMemoryAllocateFlagBits_VK_MEMORY_ALLOCATE_DEVICE_MASK_BIT_KHR:
    VkMemoryAllocateFlagBits = 1;
pub const VkMemoryAllocateFlagBits_VK_MEMORY_ALLOCATE_DEVICE_ADDRESS_BIT_KHR:
    VkMemoryAllocateFlagBits = 2;
pub const VkMemoryAllocateFlagBits_VK_MEMORY_ALLOCATE_DEVICE_ADDRESS_CAPTURE_REPLAY_BIT_KHR:
    VkMemoryAllocateFlagBits = 4;
pub const VkMemoryAllocateFlagBits_VK_MEMORY_ALLOCATE_FLAG_BITS_MAX_ENUM: VkMemoryAllocateFlagBits =
    2147483647;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_FD_BIT:
    VkExternalMemoryHandleTypeFlagBits = 1;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_WIN32_BIT:
    VkExternalMemoryHandleTypeFlagBits = 2;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_WIN32_KMT_BIT:
    VkExternalMemoryHandleTypeFlagBits = 4;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D11_TEXTURE_BIT:
    VkExternalMemoryHandleTypeFlagBits = 8;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D11_TEXTURE_KMT_BIT : VkExternalMemoryHandleTypeFlagBits = 16 ;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D12_HEAP_BIT:
    VkExternalMemoryHandleTypeFlagBits = 32;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D12_RESOURCE_BIT:
    VkExternalMemoryHandleTypeFlagBits = 64;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_DMA_BUF_BIT_EXT:
    VkExternalMemoryHandleTypeFlagBits = 512;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_ANDROID_HARDWARE_BUFFER_BIT_ANDROID : VkExternalMemoryHandleTypeFlagBits = 1024 ;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_HOST_ALLOCATION_BIT_EXT : VkExternalMemoryHandleTypeFlagBits = 128 ;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_HOST_MAPPED_FOREIGN_MEMORY_BIT_EXT : VkExternalMemoryHandleTypeFlagBits = 256 ;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_ZIRCON_VMO_BIT_FUCHSIA : VkExternalMemoryHandleTypeFlagBits = 2048 ;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_RDMA_ADDRESS_BIT_NV:
    VkExternalMemoryHandleTypeFlagBits = 4096;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_SCREEN_BUFFER_BIT_QNX : VkExternalMemoryHandleTypeFlagBits = 16384 ;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_MTLBUFFER_BIT_EXT:
    VkExternalMemoryHandleTypeFlagBits = 65536;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_MTLTEXTURE_BIT_EXT:
    VkExternalMemoryHandleTypeFlagBits = 131072;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_MTLHEAP_BIT_EXT:
    VkExternalMemoryHandleTypeFlagBits = 262144;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_FD_BIT_KHR:
    VkExternalMemoryHandleTypeFlagBits = 1;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_WIN32_BIT_KHR:
    VkExternalMemoryHandleTypeFlagBits = 2;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_OPAQUE_WIN32_KMT_BIT_KHR : VkExternalMemoryHandleTypeFlagBits = 4 ;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D11_TEXTURE_BIT_KHR : VkExternalMemoryHandleTypeFlagBits = 8 ;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D11_TEXTURE_KMT_BIT_KHR : VkExternalMemoryHandleTypeFlagBits = 16 ;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D12_HEAP_BIT_KHR:
    VkExternalMemoryHandleTypeFlagBits = 32;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_D3D12_RESOURCE_BIT_KHR : VkExternalMemoryHandleTypeFlagBits = 64 ;
pub const VkExternalMemoryHandleTypeFlagBits_VK_EXTERNAL_MEMORY_HANDLE_TYPE_FLAG_BITS_MAX_ENUM:
    VkExternalMemoryHandleTypeFlagBits = 2147483647;
pub const VkExternalMemoryFeatureFlagBits_VK_EXTERNAL_MEMORY_FEATURE_DEDICATED_ONLY_BIT:
    VkExternalMemoryFeatureFlagBits = 1;
pub const VkExternalMemoryFeatureFlagBits_VK_EXTERNAL_MEMORY_FEATURE_EXPORTABLE_BIT:
    VkExternalMemoryFeatureFlagBits = 2;
pub const VkExternalMemoryFeatureFlagBits_VK_EXTERNAL_MEMORY_FEATURE_IMPORTABLE_BIT:
    VkExternalMemoryFeatureFlagBits = 4;
pub const VkExternalMemoryFeatureFlagBits_VK_EXTERNAL_MEMORY_FEATURE_DEDICATED_ONLY_BIT_KHR:
    VkExternalMemoryFeatureFlagBits = 1;
pub const VkExternalMemoryFeatureFlagBits_VK_EXTERNAL_MEMORY_FEATURE_EXPORTABLE_BIT_KHR:
    VkExternalMemoryFeatureFlagBits = 2;
pub const VkExternalMemoryFeatureFlagBits_VK_EXTERNAL_MEMORY_FEATURE_IMPORTABLE_BIT_KHR:
    VkExternalMemoryFeatureFlagBits = 4;
pub const VkExternalMemoryFeatureFlagBits_VK_EXTERNAL_MEMORY_FEATURE_FLAG_BITS_MAX_ENUM:
    VkExternalMemoryFeatureFlagBits = 2147483647;
pub const VkExternalFenceHandleTypeFlagBits_VK_EXTERNAL_FENCE_HANDLE_TYPE_OPAQUE_FD_BIT:
    VkExternalFenceHandleTypeFlagBits = 1;
pub const VkExternalFenceHandleTypeFlagBits_VK_EXTERNAL_FENCE_HANDLE_TYPE_OPAQUE_WIN32_BIT:
    VkExternalFenceHandleTypeFlagBits = 2;
pub const VkExternalFenceHandleTypeFlagBits_VK_EXTERNAL_FENCE_HANDLE_TYPE_OPAQUE_WIN32_KMT_BIT:
    VkExternalFenceHandleTypeFlagBits = 4;
pub const VkExternalFenceHandleTypeFlagBits_VK_EXTERNAL_FENCE_HANDLE_TYPE_SYNC_FD_BIT:
    VkExternalFenceHandleTypeFlagBits = 8;
pub const VkExternalFenceHandleTypeFlagBits_VK_EXTERNAL_FENCE_HANDLE_TYPE_OPAQUE_FD_BIT_KHR:
    VkExternalFenceHandleTypeFlagBits = 1;
pub const VkExternalFenceHandleTypeFlagBits_VK_EXTERNAL_FENCE_HANDLE_TYPE_OPAQUE_WIN32_BIT_KHR:
    VkExternalFenceHandleTypeFlagBits = 2;
pub const VkExternalFenceHandleTypeFlagBits_VK_EXTERNAL_FENCE_HANDLE_TYPE_OPAQUE_WIN32_KMT_BIT_KHR : VkExternalFenceHandleTypeFlagBits = 4 ;
pub const VkExternalFenceHandleTypeFlagBits_VK_EXTERNAL_FENCE_HANDLE_TYPE_SYNC_FD_BIT_KHR:
    VkExternalFenceHandleTypeFlagBits = 8;
pub const VkExternalFenceHandleTypeFlagBits_VK_EXTERNAL_FENCE_HANDLE_TYPE_FLAG_BITS_MAX_ENUM:
    VkExternalFenceHandleTypeFlagBits = 2147483647;
pub const VkExternalFenceFeatureFlagBits_VK_EXTERNAL_FENCE_FEATURE_EXPORTABLE_BIT:
    VkExternalFenceFeatureFlagBits = 1;
pub const VkExternalFenceFeatureFlagBits_VK_EXTERNAL_FENCE_FEATURE_IMPORTABLE_BIT:
    VkExternalFenceFeatureFlagBits = 2;
pub const VkExternalFenceFeatureFlagBits_VK_EXTERNAL_FENCE_FEATURE_EXPORTABLE_BIT_KHR:
    VkExternalFenceFeatureFlagBits = 1;
pub const VkExternalFenceFeatureFlagBits_VK_EXTERNAL_FENCE_FEATURE_IMPORTABLE_BIT_KHR:
    VkExternalFenceFeatureFlagBits = 2;
pub const VkExternalFenceFeatureFlagBits_VK_EXTERNAL_FENCE_FEATURE_FLAG_BITS_MAX_ENUM:
    VkExternalFenceFeatureFlagBits = 2147483647;
pub const VkFenceImportFlagBits_VK_FENCE_IMPORT_TEMPORARY_BIT: VkFenceImportFlagBits = 1;
pub const VkFenceImportFlagBits_VK_FENCE_IMPORT_TEMPORARY_BIT_KHR: VkFenceImportFlagBits = 1;
pub const VkFenceImportFlagBits_VK_FENCE_IMPORT_FLAG_BITS_MAX_ENUM: VkFenceImportFlagBits =
    2147483647;
pub const VkSemaphoreImportFlagBits_VK_SEMAPHORE_IMPORT_TEMPORARY_BIT: VkSemaphoreImportFlagBits =
    1;
pub const VkSemaphoreImportFlagBits_VK_SEMAPHORE_IMPORT_TEMPORARY_BIT_KHR:
    VkSemaphoreImportFlagBits = 1;
pub const VkSemaphoreImportFlagBits_VK_SEMAPHORE_IMPORT_FLAG_BITS_MAX_ENUM:
    VkSemaphoreImportFlagBits = 2147483647;
pub const VkExternalSemaphoreHandleTypeFlagBits_VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_FD_BIT:
    VkExternalSemaphoreHandleTypeFlagBits = 1;
pub const VkExternalSemaphoreHandleTypeFlagBits_VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_WIN32_BIT : VkExternalSemaphoreHandleTypeFlagBits = 2 ;
pub const VkExternalSemaphoreHandleTypeFlagBits_VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_WIN32_KMT_BIT : VkExternalSemaphoreHandleTypeFlagBits = 4 ;
pub const VkExternalSemaphoreHandleTypeFlagBits_VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_D3D12_FENCE_BIT : VkExternalSemaphoreHandleTypeFlagBits = 8 ;
pub const VkExternalSemaphoreHandleTypeFlagBits_VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_SYNC_FD_BIT:
    VkExternalSemaphoreHandleTypeFlagBits = 16;
pub const VkExternalSemaphoreHandleTypeFlagBits_VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_ZIRCON_EVENT_BIT_FUCHSIA : VkExternalSemaphoreHandleTypeFlagBits = 128 ;
pub const VkExternalSemaphoreHandleTypeFlagBits_VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_D3D11_FENCE_BIT : VkExternalSemaphoreHandleTypeFlagBits = 8 ;
pub const VkExternalSemaphoreHandleTypeFlagBits_VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_FD_BIT_KHR : VkExternalSemaphoreHandleTypeFlagBits = 1 ;
pub const VkExternalSemaphoreHandleTypeFlagBits_VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_WIN32_BIT_KHR : VkExternalSemaphoreHandleTypeFlagBits = 2 ;
pub const VkExternalSemaphoreHandleTypeFlagBits_VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_OPAQUE_WIN32_KMT_BIT_KHR : VkExternalSemaphoreHandleTypeFlagBits = 4 ;
pub const VkExternalSemaphoreHandleTypeFlagBits_VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_D3D12_FENCE_BIT_KHR : VkExternalSemaphoreHandleTypeFlagBits = 8 ;
pub const VkExternalSemaphoreHandleTypeFlagBits_VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_SYNC_FD_BIT_KHR : VkExternalSemaphoreHandleTypeFlagBits = 16 ;
pub const VkExternalSemaphoreHandleTypeFlagBits_VK_EXTERNAL_SEMAPHORE_HANDLE_TYPE_FLAG_BITS_MAX_ENUM : VkExternalSemaphoreHandleTypeFlagBits = 2147483647 ;
pub const VkExternalSemaphoreFeatureFlagBits_VK_EXTERNAL_SEMAPHORE_FEATURE_EXPORTABLE_BIT:
    VkExternalSemaphoreFeatureFlagBits = 1;
pub const VkExternalSemaphoreFeatureFlagBits_VK_EXTERNAL_SEMAPHORE_FEATURE_IMPORTABLE_BIT:
    VkExternalSemaphoreFeatureFlagBits = 2;
pub const VkExternalSemaphoreFeatureFlagBits_VK_EXTERNAL_SEMAPHORE_FEATURE_EXPORTABLE_BIT_KHR:
    VkExternalSemaphoreFeatureFlagBits = 1;
pub const VkExternalSemaphoreFeatureFlagBits_VK_EXTERNAL_SEMAPHORE_FEATURE_IMPORTABLE_BIT_KHR:
    VkExternalSemaphoreFeatureFlagBits = 2;
pub const VkExternalSemaphoreFeatureFlagBits_VK_EXTERNAL_SEMAPHORE_FEATURE_FLAG_BITS_MAX_ENUM:
    VkExternalSemaphoreFeatureFlagBits = 2147483647;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceSubgroupProperties"]
        [::core::mem::size_of::<VkPhysicalDeviceSubgroupProperties>() - 24usize];
    ["Alignment of VkPhysicalDeviceSubgroupProperties"]
        [::core::mem::align_of::<VkPhysicalDeviceSubgroupProperties>() - 4usize];
    ["Offset of field: VkPhysicalDeviceSubgroupProperties::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceSubgroupProperties, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceSubgroupProperties::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceSubgroupProperties, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceSubgroupProperties::subgroupSize"]
        [::core::mem::offset_of!(VkPhysicalDeviceSubgroupProperties, subgroupSize) - 8usize];
    ["Offset of field: VkPhysicalDeviceSubgroupProperties::supportedStages"]
        [::core::mem::offset_of!(VkPhysicalDeviceSubgroupProperties, supportedStages) - 12usize];
    ["Offset of field: VkPhysicalDeviceSubgroupProperties::supportedOperations"][::core::mem::offset_of!(
        VkPhysicalDeviceSubgroupProperties,
        supportedOperations
    ) - 16usize];
    ["Offset of field: VkPhysicalDeviceSubgroupProperties::quadOperationsInAllStages"][::core::mem::offset_of!(
        VkPhysicalDeviceSubgroupProperties,
        quadOperationsInAllStages
    ) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkBindBufferMemoryInfo"][::core::mem::size_of::<VkBindBufferMemoryInfo>() - 32usize];
    ["Alignment of VkBindBufferMemoryInfo"]
        [::core::mem::align_of::<VkBindBufferMemoryInfo>() - 8usize];
    ["Offset of field: VkBindBufferMemoryInfo::sType"]
        [::core::mem::offset_of!(VkBindBufferMemoryInfo, sType) - 0usize];
    ["Offset of field: VkBindBufferMemoryInfo::pNext"]
        [::core::mem::offset_of!(VkBindBufferMemoryInfo, pNext) - 4usize];
    ["Offset of field: VkBindBufferMemoryInfo::buffer"]
        [::core::mem::offset_of!(VkBindBufferMemoryInfo, buffer) - 8usize];
    ["Offset of field: VkBindBufferMemoryInfo::memory"]
        [::core::mem::offset_of!(VkBindBufferMemoryInfo, memory) - 16usize];
    ["Offset of field: VkBindBufferMemoryInfo::memoryOffset"]
        [::core::mem::offset_of!(VkBindBufferMemoryInfo, memoryOffset) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkBindImageMemoryInfo"][::core::mem::size_of::<VkBindImageMemoryInfo>() - 32usize];
    ["Alignment of VkBindImageMemoryInfo"]
        [::core::mem::align_of::<VkBindImageMemoryInfo>() - 8usize];
    ["Offset of field: VkBindImageMemoryInfo::sType"]
        [::core::mem::offset_of!(VkBindImageMemoryInfo, sType) - 0usize];
    ["Offset of field: VkBindImageMemoryInfo::pNext"]
        [::core::mem::offset_of!(VkBindImageMemoryInfo, pNext) - 4usize];
    ["Offset of field: VkBindImageMemoryInfo::image"]
        [::core::mem::offset_of!(VkBindImageMemoryInfo, image) - 8usize];
    ["Offset of field: VkBindImageMemoryInfo::memory"]
        [::core::mem::offset_of!(VkBindImageMemoryInfo, memory) - 16usize];
    ["Offset of field: VkBindImageMemoryInfo::memoryOffset"]
        [::core::mem::offset_of!(VkBindImageMemoryInfo, memoryOffset) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDevice16BitStorageFeatures"]
        [::core::mem::size_of::<VkPhysicalDevice16BitStorageFeatures>() - 24usize];
    ["Alignment of VkPhysicalDevice16BitStorageFeatures"]
        [::core::mem::align_of::<VkPhysicalDevice16BitStorageFeatures>() - 4usize];
    ["Offset of field: VkPhysicalDevice16BitStorageFeatures::sType"]
        [::core::mem::offset_of!(VkPhysicalDevice16BitStorageFeatures, sType) - 0usize];
    ["Offset of field: VkPhysicalDevice16BitStorageFeatures::pNext"]
        [::core::mem::offset_of!(VkPhysicalDevice16BitStorageFeatures, pNext) - 4usize];
    ["Offset of field: VkPhysicalDevice16BitStorageFeatures::storageBuffer16BitAccess"][::core::mem::offset_of!(
        VkPhysicalDevice16BitStorageFeatures,
        storageBuffer16BitAccess
    ) - 8usize];
    ["Offset of field: VkPhysicalDevice16BitStorageFeatures::uniformAndStorageBuffer16BitAccess"][::core::mem::offset_of!(
        VkPhysicalDevice16BitStorageFeatures,
        uniformAndStorageBuffer16BitAccess
    )
        - 12usize];
    ["Offset of field: VkPhysicalDevice16BitStorageFeatures::storagePushConstant16"][::core::mem::offset_of!(
        VkPhysicalDevice16BitStorageFeatures,
        storagePushConstant16
    ) - 16usize];
    ["Offset of field: VkPhysicalDevice16BitStorageFeatures::storageInputOutput16"][::core::mem::offset_of!(
        VkPhysicalDevice16BitStorageFeatures,
        storageInputOutput16
    ) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkMemoryDedicatedRequirements"]
        [::core::mem::size_of::<VkMemoryDedicatedRequirements>() - 16usize];
    ["Alignment of VkMemoryDedicatedRequirements"]
        [::core::mem::align_of::<VkMemoryDedicatedRequirements>() - 4usize];
    ["Offset of field: VkMemoryDedicatedRequirements::sType"]
        [::core::mem::offset_of!(VkMemoryDedicatedRequirements, sType) - 0usize];
    ["Offset of field: VkMemoryDedicatedRequirements::pNext"]
        [::core::mem::offset_of!(VkMemoryDedicatedRequirements, pNext) - 4usize];
    ["Offset of field: VkMemoryDedicatedRequirements::prefersDedicatedAllocation"][::core::mem::offset_of!(
        VkMemoryDedicatedRequirements,
        prefersDedicatedAllocation
    ) - 8usize];
    ["Offset of field: VkMemoryDedicatedRequirements::requiresDedicatedAllocation"][::core::mem::offset_of!(
        VkMemoryDedicatedRequirements,
        requiresDedicatedAllocation
    ) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkMemoryDedicatedAllocateInfo"]
        [::core::mem::size_of::<VkMemoryDedicatedAllocateInfo>() - 24usize];
    ["Alignment of VkMemoryDedicatedAllocateInfo"]
        [::core::mem::align_of::<VkMemoryDedicatedAllocateInfo>() - 8usize];
    ["Offset of field: VkMemoryDedicatedAllocateInfo::sType"]
        [::core::mem::offset_of!(VkMemoryDedicatedAllocateInfo, sType) - 0usize];
    ["Offset of field: VkMemoryDedicatedAllocateInfo::pNext"]
        [::core::mem::offset_of!(VkMemoryDedicatedAllocateInfo, pNext) - 4usize];
    ["Offset of field: VkMemoryDedicatedAllocateInfo::image"]
        [::core::mem::offset_of!(VkMemoryDedicatedAllocateInfo, image) - 8usize];
    ["Offset of field: VkMemoryDedicatedAllocateInfo::buffer"]
        [::core::mem::offset_of!(VkMemoryDedicatedAllocateInfo, buffer) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkMemoryAllocateFlagsInfo"]
        [::core::mem::size_of::<VkMemoryAllocateFlagsInfo>() - 16usize];
    ["Alignment of VkMemoryAllocateFlagsInfo"]
        [::core::mem::align_of::<VkMemoryAllocateFlagsInfo>() - 4usize];
    ["Offset of field: VkMemoryAllocateFlagsInfo::sType"]
        [::core::mem::offset_of!(VkMemoryAllocateFlagsInfo, sType) - 0usize];
    ["Offset of field: VkMemoryAllocateFlagsInfo::pNext"]
        [::core::mem::offset_of!(VkMemoryAllocateFlagsInfo, pNext) - 4usize];
    ["Offset of field: VkMemoryAllocateFlagsInfo::flags"]
        [::core::mem::offset_of!(VkMemoryAllocateFlagsInfo, flags) - 8usize];
    ["Offset of field: VkMemoryAllocateFlagsInfo::deviceMask"]
        [::core::mem::offset_of!(VkMemoryAllocateFlagsInfo, deviceMask) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDeviceGroupRenderPassBeginInfo"]
        [::core::mem::size_of::<VkDeviceGroupRenderPassBeginInfo>() - 20usize];
    ["Alignment of VkDeviceGroupRenderPassBeginInfo"]
        [::core::mem::align_of::<VkDeviceGroupRenderPassBeginInfo>() - 4usize];
    ["Offset of field: VkDeviceGroupRenderPassBeginInfo::sType"]
        [::core::mem::offset_of!(VkDeviceGroupRenderPassBeginInfo, sType) - 0usize];
    ["Offset of field: VkDeviceGroupRenderPassBeginInfo::pNext"]
        [::core::mem::offset_of!(VkDeviceGroupRenderPassBeginInfo, pNext) - 4usize];
    ["Offset of field: VkDeviceGroupRenderPassBeginInfo::deviceMask"]
        [::core::mem::offset_of!(VkDeviceGroupRenderPassBeginInfo, deviceMask) - 8usize];
    ["Offset of field: VkDeviceGroupRenderPassBeginInfo::deviceRenderAreaCount"][::core::mem::offset_of!(
        VkDeviceGroupRenderPassBeginInfo,
        deviceRenderAreaCount
    ) - 12usize];
    ["Offset of field: VkDeviceGroupRenderPassBeginInfo::pDeviceRenderAreas"]
        [::core::mem::offset_of!(VkDeviceGroupRenderPassBeginInfo, pDeviceRenderAreas) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDeviceGroupCommandBufferBeginInfo"]
        [::core::mem::size_of::<VkDeviceGroupCommandBufferBeginInfo>() - 12usize];
    ["Alignment of VkDeviceGroupCommandBufferBeginInfo"]
        [::core::mem::align_of::<VkDeviceGroupCommandBufferBeginInfo>() - 4usize];
    ["Offset of field: VkDeviceGroupCommandBufferBeginInfo::sType"]
        [::core::mem::offset_of!(VkDeviceGroupCommandBufferBeginInfo, sType) - 0usize];
    ["Offset of field: VkDeviceGroupCommandBufferBeginInfo::pNext"]
        [::core::mem::offset_of!(VkDeviceGroupCommandBufferBeginInfo, pNext) - 4usize];
    ["Offset of field: VkDeviceGroupCommandBufferBeginInfo::deviceMask"]
        [::core::mem::offset_of!(VkDeviceGroupCommandBufferBeginInfo, deviceMask) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDeviceGroupSubmitInfo"]
        [::core::mem::size_of::<VkDeviceGroupSubmitInfo>() - 32usize];
    ["Alignment of VkDeviceGroupSubmitInfo"]
        [::core::mem::align_of::<VkDeviceGroupSubmitInfo>() - 4usize];
    ["Offset of field: VkDeviceGroupSubmitInfo::sType"]
        [::core::mem::offset_of!(VkDeviceGroupSubmitInfo, sType) - 0usize];
    ["Offset of field: VkDeviceGroupSubmitInfo::pNext"]
        [::core::mem::offset_of!(VkDeviceGroupSubmitInfo, pNext) - 4usize];
    ["Offset of field: VkDeviceGroupSubmitInfo::waitSemaphoreCount"]
        [::core::mem::offset_of!(VkDeviceGroupSubmitInfo, waitSemaphoreCount) - 8usize];
    ["Offset of field: VkDeviceGroupSubmitInfo::pWaitSemaphoreDeviceIndices"]
        [::core::mem::offset_of!(VkDeviceGroupSubmitInfo, pWaitSemaphoreDeviceIndices) - 12usize];
    ["Offset of field: VkDeviceGroupSubmitInfo::commandBufferCount"]
        [::core::mem::offset_of!(VkDeviceGroupSubmitInfo, commandBufferCount) - 16usize];
    ["Offset of field: VkDeviceGroupSubmitInfo::pCommandBufferDeviceMasks"]
        [::core::mem::offset_of!(VkDeviceGroupSubmitInfo, pCommandBufferDeviceMasks) - 20usize];
    ["Offset of field: VkDeviceGroupSubmitInfo::signalSemaphoreCount"]
        [::core::mem::offset_of!(VkDeviceGroupSubmitInfo, signalSemaphoreCount) - 24usize];
    ["Offset of field: VkDeviceGroupSubmitInfo::pSignalSemaphoreDeviceIndices"]
        [::core::mem::offset_of!(VkDeviceGroupSubmitInfo, pSignalSemaphoreDeviceIndices) - 28usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDeviceGroupBindSparseInfo"]
        [::core::mem::size_of::<VkDeviceGroupBindSparseInfo>() - 16usize];
    ["Alignment of VkDeviceGroupBindSparseInfo"]
        [::core::mem::align_of::<VkDeviceGroupBindSparseInfo>() - 4usize];
    ["Offset of field: VkDeviceGroupBindSparseInfo::sType"]
        [::core::mem::offset_of!(VkDeviceGroupBindSparseInfo, sType) - 0usize];
    ["Offset of field: VkDeviceGroupBindSparseInfo::pNext"]
        [::core::mem::offset_of!(VkDeviceGroupBindSparseInfo, pNext) - 4usize];
    ["Offset of field: VkDeviceGroupBindSparseInfo::resourceDeviceIndex"]
        [::core::mem::offset_of!(VkDeviceGroupBindSparseInfo, resourceDeviceIndex) - 8usize];
    ["Offset of field: VkDeviceGroupBindSparseInfo::memoryDeviceIndex"]
        [::core::mem::offset_of!(VkDeviceGroupBindSparseInfo, memoryDeviceIndex) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkBindBufferMemoryDeviceGroupInfo"]
        [::core::mem::size_of::<VkBindBufferMemoryDeviceGroupInfo>() - 16usize];
    ["Alignment of VkBindBufferMemoryDeviceGroupInfo"]
        [::core::mem::align_of::<VkBindBufferMemoryDeviceGroupInfo>() - 4usize];
    ["Offset of field: VkBindBufferMemoryDeviceGroupInfo::sType"]
        [::core::mem::offset_of!(VkBindBufferMemoryDeviceGroupInfo, sType) - 0usize];
    ["Offset of field: VkBindBufferMemoryDeviceGroupInfo::pNext"]
        [::core::mem::offset_of!(VkBindBufferMemoryDeviceGroupInfo, pNext) - 4usize];
    ["Offset of field: VkBindBufferMemoryDeviceGroupInfo::deviceIndexCount"]
        [::core::mem::offset_of!(VkBindBufferMemoryDeviceGroupInfo, deviceIndexCount) - 8usize];
    ["Offset of field: VkBindBufferMemoryDeviceGroupInfo::pDeviceIndices"]
        [::core::mem::offset_of!(VkBindBufferMemoryDeviceGroupInfo, pDeviceIndices) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkBindImageMemoryDeviceGroupInfo"]
        [::core::mem::size_of::<VkBindImageMemoryDeviceGroupInfo>() - 24usize];
    ["Alignment of VkBindImageMemoryDeviceGroupInfo"]
        [::core::mem::align_of::<VkBindImageMemoryDeviceGroupInfo>() - 4usize];
    ["Offset of field: VkBindImageMemoryDeviceGroupInfo::sType"]
        [::core::mem::offset_of!(VkBindImageMemoryDeviceGroupInfo, sType) - 0usize];
    ["Offset of field: VkBindImageMemoryDeviceGroupInfo::pNext"]
        [::core::mem::offset_of!(VkBindImageMemoryDeviceGroupInfo, pNext) - 4usize];
    ["Offset of field: VkBindImageMemoryDeviceGroupInfo::deviceIndexCount"]
        [::core::mem::offset_of!(VkBindImageMemoryDeviceGroupInfo, deviceIndexCount) - 8usize];
    ["Offset of field: VkBindImageMemoryDeviceGroupInfo::pDeviceIndices"]
        [::core::mem::offset_of!(VkBindImageMemoryDeviceGroupInfo, pDeviceIndices) - 12usize];
    ["Offset of field: VkBindImageMemoryDeviceGroupInfo::splitInstanceBindRegionCount"][::core::mem::offset_of!(
        VkBindImageMemoryDeviceGroupInfo,
        splitInstanceBindRegionCount
    )
        - 16usize];
    ["Offset of field: VkBindImageMemoryDeviceGroupInfo::pSplitInstanceBindRegions"][::core::mem::offset_of!(
        VkBindImageMemoryDeviceGroupInfo,
        pSplitInstanceBindRegions
    ) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceGroupProperties"]
        [::core::mem::size_of::<VkPhysicalDeviceGroupProperties>() - 144usize];
    ["Alignment of VkPhysicalDeviceGroupProperties"]
        [::core::mem::align_of::<VkPhysicalDeviceGroupProperties>() - 4usize];
    ["Offset of field: VkPhysicalDeviceGroupProperties::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceGroupProperties, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceGroupProperties::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceGroupProperties, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceGroupProperties::physicalDeviceCount"]
        [::core::mem::offset_of!(VkPhysicalDeviceGroupProperties, physicalDeviceCount) - 8usize];
    ["Offset of field: VkPhysicalDeviceGroupProperties::physicalDevices"]
        [::core::mem::offset_of!(VkPhysicalDeviceGroupProperties, physicalDevices) - 12usize];
    ["Offset of field: VkPhysicalDeviceGroupProperties::subsetAllocation"]
        [::core::mem::offset_of!(VkPhysicalDeviceGroupProperties, subsetAllocation) - 140usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDeviceGroupDeviceCreateInfo"]
        [::core::mem::size_of::<VkDeviceGroupDeviceCreateInfo>() - 16usize];
    ["Alignment of VkDeviceGroupDeviceCreateInfo"]
        [::core::mem::align_of::<VkDeviceGroupDeviceCreateInfo>() - 4usize];
    ["Offset of field: VkDeviceGroupDeviceCreateInfo::sType"]
        [::core::mem::offset_of!(VkDeviceGroupDeviceCreateInfo, sType) - 0usize];
    ["Offset of field: VkDeviceGroupDeviceCreateInfo::pNext"]
        [::core::mem::offset_of!(VkDeviceGroupDeviceCreateInfo, pNext) - 4usize];
    ["Offset of field: VkDeviceGroupDeviceCreateInfo::physicalDeviceCount"]
        [::core::mem::offset_of!(VkDeviceGroupDeviceCreateInfo, physicalDeviceCount) - 8usize];
    ["Offset of field: VkDeviceGroupDeviceCreateInfo::pPhysicalDevices"]
        [::core::mem::offset_of!(VkDeviceGroupDeviceCreateInfo, pPhysicalDevices) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkBufferMemoryRequirementsInfo2"]
        [::core::mem::size_of::<VkBufferMemoryRequirementsInfo2>() - 16usize];
    ["Alignment of VkBufferMemoryRequirementsInfo2"]
        [::core::mem::align_of::<VkBufferMemoryRequirementsInfo2>() - 8usize];
    ["Offset of field: VkBufferMemoryRequirementsInfo2::sType"]
        [::core::mem::offset_of!(VkBufferMemoryRequirementsInfo2, sType) - 0usize];
    ["Offset of field: VkBufferMemoryRequirementsInfo2::pNext"]
        [::core::mem::offset_of!(VkBufferMemoryRequirementsInfo2, pNext) - 4usize];
    ["Offset of field: VkBufferMemoryRequirementsInfo2::buffer"]
        [::core::mem::offset_of!(VkBufferMemoryRequirementsInfo2, buffer) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImageMemoryRequirementsInfo2"]
        [::core::mem::size_of::<VkImageMemoryRequirementsInfo2>() - 16usize];
    ["Alignment of VkImageMemoryRequirementsInfo2"]
        [::core::mem::align_of::<VkImageMemoryRequirementsInfo2>() - 8usize];
    ["Offset of field: VkImageMemoryRequirementsInfo2::sType"]
        [::core::mem::offset_of!(VkImageMemoryRequirementsInfo2, sType) - 0usize];
    ["Offset of field: VkImageMemoryRequirementsInfo2::pNext"]
        [::core::mem::offset_of!(VkImageMemoryRequirementsInfo2, pNext) - 4usize];
    ["Offset of field: VkImageMemoryRequirementsInfo2::image"]
        [::core::mem::offset_of!(VkImageMemoryRequirementsInfo2, image) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImageSparseMemoryRequirementsInfo2"]
        [::core::mem::size_of::<VkImageSparseMemoryRequirementsInfo2>() - 16usize];
    ["Alignment of VkImageSparseMemoryRequirementsInfo2"]
        [::core::mem::align_of::<VkImageSparseMemoryRequirementsInfo2>() - 8usize];
    ["Offset of field: VkImageSparseMemoryRequirementsInfo2::sType"]
        [::core::mem::offset_of!(VkImageSparseMemoryRequirementsInfo2, sType) - 0usize];
    ["Offset of field: VkImageSparseMemoryRequirementsInfo2::pNext"]
        [::core::mem::offset_of!(VkImageSparseMemoryRequirementsInfo2, pNext) - 4usize];
    ["Offset of field: VkImageSparseMemoryRequirementsInfo2::image"]
        [::core::mem::offset_of!(VkImageSparseMemoryRequirementsInfo2, image) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkMemoryRequirements2"][::core::mem::size_of::<VkMemoryRequirements2>() - 32usize];
    ["Alignment of VkMemoryRequirements2"]
        [::core::mem::align_of::<VkMemoryRequirements2>() - 8usize];
    ["Offset of field: VkMemoryRequirements2::sType"]
        [::core::mem::offset_of!(VkMemoryRequirements2, sType) - 0usize];
    ["Offset of field: VkMemoryRequirements2::pNext"]
        [::core::mem::offset_of!(VkMemoryRequirements2, pNext) - 4usize];
    ["Offset of field: VkMemoryRequirements2::memoryRequirements"]
        [::core::mem::offset_of!(VkMemoryRequirements2, memoryRequirements) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSparseImageMemoryRequirements2"]
        [::core::mem::size_of::<VkSparseImageMemoryRequirements2>() - 56usize];
    ["Alignment of VkSparseImageMemoryRequirements2"]
        [::core::mem::align_of::<VkSparseImageMemoryRequirements2>() - 8usize];
    ["Offset of field: VkSparseImageMemoryRequirements2::sType"]
        [::core::mem::offset_of!(VkSparseImageMemoryRequirements2, sType) - 0usize];
    ["Offset of field: VkSparseImageMemoryRequirements2::pNext"]
        [::core::mem::offset_of!(VkSparseImageMemoryRequirements2, pNext) - 4usize];
    ["Offset of field: VkSparseImageMemoryRequirements2::memoryRequirements"]
        [::core::mem::offset_of!(VkSparseImageMemoryRequirements2, memoryRequirements) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceFeatures2"]
        [::core::mem::size_of::<VkPhysicalDeviceFeatures2>() - 228usize];
    ["Alignment of VkPhysicalDeviceFeatures2"]
        [::core::mem::align_of::<VkPhysicalDeviceFeatures2>() - 4usize];
    ["Offset of field: VkPhysicalDeviceFeatures2::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures2, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceFeatures2::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures2, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceFeatures2::features"]
        [::core::mem::offset_of!(VkPhysicalDeviceFeatures2, features) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceProperties2"]
        [::core::mem::size_of::<VkPhysicalDeviceProperties2>() - 824usize];
    ["Alignment of VkPhysicalDeviceProperties2"]
        [::core::mem::align_of::<VkPhysicalDeviceProperties2>() - 8usize];
    ["Offset of field: VkPhysicalDeviceProperties2::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceProperties2, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceProperties2::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceProperties2, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceProperties2::properties"]
        [::core::mem::offset_of!(VkPhysicalDeviceProperties2, properties) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkFormatProperties2"][::core::mem::size_of::<VkFormatProperties2>() - 20usize];
    ["Alignment of VkFormatProperties2"][::core::mem::align_of::<VkFormatProperties2>() - 4usize];
    ["Offset of field: VkFormatProperties2::sType"]
        [::core::mem::offset_of!(VkFormatProperties2, sType) - 0usize];
    ["Offset of field: VkFormatProperties2::pNext"]
        [::core::mem::offset_of!(VkFormatProperties2, pNext) - 4usize];
    ["Offset of field: VkFormatProperties2::formatProperties"]
        [::core::mem::offset_of!(VkFormatProperties2, formatProperties) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImageFormatProperties2"]
        [::core::mem::size_of::<VkImageFormatProperties2>() - 40usize];
    ["Alignment of VkImageFormatProperties2"]
        [::core::mem::align_of::<VkImageFormatProperties2>() - 8usize];
    ["Offset of field: VkImageFormatProperties2::sType"]
        [::core::mem::offset_of!(VkImageFormatProperties2, sType) - 0usize];
    ["Offset of field: VkImageFormatProperties2::pNext"]
        [::core::mem::offset_of!(VkImageFormatProperties2, pNext) - 4usize];
    ["Offset of field: VkImageFormatProperties2::imageFormatProperties"]
        [::core::mem::offset_of!(VkImageFormatProperties2, imageFormatProperties) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceImageFormatInfo2"]
        [::core::mem::size_of::<VkPhysicalDeviceImageFormatInfo2>() - 28usize];
    ["Alignment of VkPhysicalDeviceImageFormatInfo2"]
        [::core::mem::align_of::<VkPhysicalDeviceImageFormatInfo2>() - 4usize];
    ["Offset of field: VkPhysicalDeviceImageFormatInfo2::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceImageFormatInfo2, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceImageFormatInfo2::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceImageFormatInfo2, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceImageFormatInfo2::format"]
        [::core::mem::offset_of!(VkPhysicalDeviceImageFormatInfo2, format) - 8usize];
    ["Offset of field: VkPhysicalDeviceImageFormatInfo2::type_"]
        [::core::mem::offset_of!(VkPhysicalDeviceImageFormatInfo2, type_) - 12usize];
    ["Offset of field: VkPhysicalDeviceImageFormatInfo2::tiling"]
        [::core::mem::offset_of!(VkPhysicalDeviceImageFormatInfo2, tiling) - 16usize];
    ["Offset of field: VkPhysicalDeviceImageFormatInfo2::usage"]
        [::core::mem::offset_of!(VkPhysicalDeviceImageFormatInfo2, usage) - 20usize];
    ["Offset of field: VkPhysicalDeviceImageFormatInfo2::flags"]
        [::core::mem::offset_of!(VkPhysicalDeviceImageFormatInfo2, flags) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkQueueFamilyProperties2"]
        [::core::mem::size_of::<VkQueueFamilyProperties2>() - 32usize];
    ["Alignment of VkQueueFamilyProperties2"]
        [::core::mem::align_of::<VkQueueFamilyProperties2>() - 4usize];
    ["Offset of field: VkQueueFamilyProperties2::sType"]
        [::core::mem::offset_of!(VkQueueFamilyProperties2, sType) - 0usize];
    ["Offset of field: VkQueueFamilyProperties2::pNext"]
        [::core::mem::offset_of!(VkQueueFamilyProperties2, pNext) - 4usize];
    ["Offset of field: VkQueueFamilyProperties2::queueFamilyProperties"]
        [::core::mem::offset_of!(VkQueueFamilyProperties2, queueFamilyProperties) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceMemoryProperties2"]
        [::core::mem::size_of::<VkPhysicalDeviceMemoryProperties2>() - 528usize];
    ["Alignment of VkPhysicalDeviceMemoryProperties2"]
        [::core::mem::align_of::<VkPhysicalDeviceMemoryProperties2>() - 8usize];
    ["Offset of field: VkPhysicalDeviceMemoryProperties2::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceMemoryProperties2, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceMemoryProperties2::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceMemoryProperties2, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceMemoryProperties2::memoryProperties"]
        [::core::mem::offset_of!(VkPhysicalDeviceMemoryProperties2, memoryProperties) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSparseImageFormatProperties2"]
        [::core::mem::size_of::<VkSparseImageFormatProperties2>() - 28usize];
    ["Alignment of VkSparseImageFormatProperties2"]
        [::core::mem::align_of::<VkSparseImageFormatProperties2>() - 4usize];
    ["Offset of field: VkSparseImageFormatProperties2::sType"]
        [::core::mem::offset_of!(VkSparseImageFormatProperties2, sType) - 0usize];
    ["Offset of field: VkSparseImageFormatProperties2::pNext"]
        [::core::mem::offset_of!(VkSparseImageFormatProperties2, pNext) - 4usize];
    ["Offset of field: VkSparseImageFormatProperties2::properties"]
        [::core::mem::offset_of!(VkSparseImageFormatProperties2, properties) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceSparseImageFormatInfo2"]
        [::core::mem::size_of::<VkPhysicalDeviceSparseImageFormatInfo2>() - 28usize];
    ["Alignment of VkPhysicalDeviceSparseImageFormatInfo2"]
        [::core::mem::align_of::<VkPhysicalDeviceSparseImageFormatInfo2>() - 4usize];
    ["Offset of field: VkPhysicalDeviceSparseImageFormatInfo2::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceSparseImageFormatInfo2, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceSparseImageFormatInfo2::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceSparseImageFormatInfo2, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceSparseImageFormatInfo2::format"]
        [::core::mem::offset_of!(VkPhysicalDeviceSparseImageFormatInfo2, format) - 8usize];
    ["Offset of field: VkPhysicalDeviceSparseImageFormatInfo2::type_"]
        [::core::mem::offset_of!(VkPhysicalDeviceSparseImageFormatInfo2, type_) - 12usize];
    ["Offset of field: VkPhysicalDeviceSparseImageFormatInfo2::samples"]
        [::core::mem::offset_of!(VkPhysicalDeviceSparseImageFormatInfo2, samples) - 16usize];
    ["Offset of field: VkPhysicalDeviceSparseImageFormatInfo2::usage"]
        [::core::mem::offset_of!(VkPhysicalDeviceSparseImageFormatInfo2, usage) - 20usize];
    ["Offset of field: VkPhysicalDeviceSparseImageFormatInfo2::tiling"]
        [::core::mem::offset_of!(VkPhysicalDeviceSparseImageFormatInfo2, tiling) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDevicePointClippingProperties"]
        [::core::mem::size_of::<VkPhysicalDevicePointClippingProperties>() - 12usize];
    ["Alignment of VkPhysicalDevicePointClippingProperties"]
        [::core::mem::align_of::<VkPhysicalDevicePointClippingProperties>() - 4usize];
    ["Offset of field: VkPhysicalDevicePointClippingProperties::sType"]
        [::core::mem::offset_of!(VkPhysicalDevicePointClippingProperties, sType) - 0usize];
    ["Offset of field: VkPhysicalDevicePointClippingProperties::pNext"]
        [::core::mem::offset_of!(VkPhysicalDevicePointClippingProperties, pNext) - 4usize];
    ["Offset of field: VkPhysicalDevicePointClippingProperties::pointClippingBehavior"][::core::mem::offset_of!(
        VkPhysicalDevicePointClippingProperties,
        pointClippingBehavior
    ) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkInputAttachmentAspectReference"]
        [::core::mem::size_of::<VkInputAttachmentAspectReference>() - 12usize];
    ["Alignment of VkInputAttachmentAspectReference"]
        [::core::mem::align_of::<VkInputAttachmentAspectReference>() - 4usize];
    ["Offset of field: VkInputAttachmentAspectReference::subpass"]
        [::core::mem::offset_of!(VkInputAttachmentAspectReference, subpass) - 0usize];
    ["Offset of field: VkInputAttachmentAspectReference::inputAttachmentIndex"]
        [::core::mem::offset_of!(VkInputAttachmentAspectReference, inputAttachmentIndex) - 4usize];
    ["Offset of field: VkInputAttachmentAspectReference::aspectMask"]
        [::core::mem::offset_of!(VkInputAttachmentAspectReference, aspectMask) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkRenderPassInputAttachmentAspectCreateInfo"]
        [::core::mem::size_of::<VkRenderPassInputAttachmentAspectCreateInfo>() - 16usize];
    ["Alignment of VkRenderPassInputAttachmentAspectCreateInfo"]
        [::core::mem::align_of::<VkRenderPassInputAttachmentAspectCreateInfo>() - 4usize];
    ["Offset of field: VkRenderPassInputAttachmentAspectCreateInfo::sType"]
        [::core::mem::offset_of!(VkRenderPassInputAttachmentAspectCreateInfo, sType) - 0usize];
    ["Offset of field: VkRenderPassInputAttachmentAspectCreateInfo::pNext"]
        [::core::mem::offset_of!(VkRenderPassInputAttachmentAspectCreateInfo, pNext) - 4usize];
    ["Offset of field: VkRenderPassInputAttachmentAspectCreateInfo::aspectReferenceCount"][::core::mem::offset_of!(
        VkRenderPassInputAttachmentAspectCreateInfo,
        aspectReferenceCount
    )
        - 8usize];
    ["Offset of field: VkRenderPassInputAttachmentAspectCreateInfo::pAspectReferences"][::core::mem::offset_of!(
        VkRenderPassInputAttachmentAspectCreateInfo,
        pAspectReferences
    )
        - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImageViewUsageCreateInfo"]
        [::core::mem::size_of::<VkImageViewUsageCreateInfo>() - 12usize];
    ["Alignment of VkImageViewUsageCreateInfo"]
        [::core::mem::align_of::<VkImageViewUsageCreateInfo>() - 4usize];
    ["Offset of field: VkImageViewUsageCreateInfo::sType"]
        [::core::mem::offset_of!(VkImageViewUsageCreateInfo, sType) - 0usize];
    ["Offset of field: VkImageViewUsageCreateInfo::pNext"]
        [::core::mem::offset_of!(VkImageViewUsageCreateInfo, pNext) - 4usize];
    ["Offset of field: VkImageViewUsageCreateInfo::usage"]
        [::core::mem::offset_of!(VkImageViewUsageCreateInfo, usage) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPipelineTessellationDomainOriginStateCreateInfo"]
        [::core::mem::size_of::<VkPipelineTessellationDomainOriginStateCreateInfo>() - 12usize];
    ["Alignment of VkPipelineTessellationDomainOriginStateCreateInfo"]
        [::core::mem::align_of::<VkPipelineTessellationDomainOriginStateCreateInfo>() - 4usize];
    ["Offset of field: VkPipelineTessellationDomainOriginStateCreateInfo::sType"][::core::mem::offset_of!(
        VkPipelineTessellationDomainOriginStateCreateInfo,
        sType
    ) - 0usize];
    ["Offset of field: VkPipelineTessellationDomainOriginStateCreateInfo::pNext"][::core::mem::offset_of!(
        VkPipelineTessellationDomainOriginStateCreateInfo,
        pNext
    ) - 4usize];
    ["Offset of field: VkPipelineTessellationDomainOriginStateCreateInfo::domainOrigin"][::core::mem::offset_of!(
        VkPipelineTessellationDomainOriginStateCreateInfo,
        domainOrigin
    )
        - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkRenderPassMultiviewCreateInfo"]
        [::core::mem::size_of::<VkRenderPassMultiviewCreateInfo>() - 32usize];
    ["Alignment of VkRenderPassMultiviewCreateInfo"]
        [::core::mem::align_of::<VkRenderPassMultiviewCreateInfo>() - 4usize];
    ["Offset of field: VkRenderPassMultiviewCreateInfo::sType"]
        [::core::mem::offset_of!(VkRenderPassMultiviewCreateInfo, sType) - 0usize];
    ["Offset of field: VkRenderPassMultiviewCreateInfo::pNext"]
        [::core::mem::offset_of!(VkRenderPassMultiviewCreateInfo, pNext) - 4usize];
    ["Offset of field: VkRenderPassMultiviewCreateInfo::subpassCount"]
        [::core::mem::offset_of!(VkRenderPassMultiviewCreateInfo, subpassCount) - 8usize];
    ["Offset of field: VkRenderPassMultiviewCreateInfo::pViewMasks"]
        [::core::mem::offset_of!(VkRenderPassMultiviewCreateInfo, pViewMasks) - 12usize];
    ["Offset of field: VkRenderPassMultiviewCreateInfo::dependencyCount"]
        [::core::mem::offset_of!(VkRenderPassMultiviewCreateInfo, dependencyCount) - 16usize];
    ["Offset of field: VkRenderPassMultiviewCreateInfo::pViewOffsets"]
        [::core::mem::offset_of!(VkRenderPassMultiviewCreateInfo, pViewOffsets) - 20usize];
    ["Offset of field: VkRenderPassMultiviewCreateInfo::correlationMaskCount"]
        [::core::mem::offset_of!(VkRenderPassMultiviewCreateInfo, correlationMaskCount) - 24usize];
    ["Offset of field: VkRenderPassMultiviewCreateInfo::pCorrelationMasks"]
        [::core::mem::offset_of!(VkRenderPassMultiviewCreateInfo, pCorrelationMasks) - 28usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceMultiviewFeatures"]
        [::core::mem::size_of::<VkPhysicalDeviceMultiviewFeatures>() - 20usize];
    ["Alignment of VkPhysicalDeviceMultiviewFeatures"]
        [::core::mem::align_of::<VkPhysicalDeviceMultiviewFeatures>() - 4usize];
    ["Offset of field: VkPhysicalDeviceMultiviewFeatures::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceMultiviewFeatures, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceMultiviewFeatures::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceMultiviewFeatures, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceMultiviewFeatures::multiview"]
        [::core::mem::offset_of!(VkPhysicalDeviceMultiviewFeatures, multiview) - 8usize];
    ["Offset of field: VkPhysicalDeviceMultiviewFeatures::multiviewGeometryShader"][::core::mem::offset_of!(
        VkPhysicalDeviceMultiviewFeatures,
        multiviewGeometryShader
    ) - 12usize];
    ["Offset of field: VkPhysicalDeviceMultiviewFeatures::multiviewTessellationShader"][::core::mem::offset_of!(
        VkPhysicalDeviceMultiviewFeatures,
        multiviewTessellationShader
    )
        - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceMultiviewProperties"]
        [::core::mem::size_of::<VkPhysicalDeviceMultiviewProperties>() - 16usize];
    ["Alignment of VkPhysicalDeviceMultiviewProperties"]
        [::core::mem::align_of::<VkPhysicalDeviceMultiviewProperties>() - 4usize];
    ["Offset of field: VkPhysicalDeviceMultiviewProperties::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceMultiviewProperties, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceMultiviewProperties::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceMultiviewProperties, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceMultiviewProperties::maxMultiviewViewCount"][::core::mem::offset_of!(
        VkPhysicalDeviceMultiviewProperties,
        maxMultiviewViewCount
    ) - 8usize];
    ["Offset of field: VkPhysicalDeviceMultiviewProperties::maxMultiviewInstanceIndex"][::core::mem::offset_of!(
        VkPhysicalDeviceMultiviewProperties,
        maxMultiviewInstanceIndex
    )
        - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceVariablePointersFeatures"]
        [::core::mem::size_of::<VkPhysicalDeviceVariablePointersFeatures>() - 16usize];
    ["Alignment of VkPhysicalDeviceVariablePointersFeatures"]
        [::core::mem::align_of::<VkPhysicalDeviceVariablePointersFeatures>() - 4usize];
    ["Offset of field: VkPhysicalDeviceVariablePointersFeatures::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceVariablePointersFeatures, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceVariablePointersFeatures::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceVariablePointersFeatures, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceVariablePointersFeatures::variablePointersStorageBuffer"][::core::mem::offset_of!(
        VkPhysicalDeviceVariablePointersFeatures,
        variablePointersStorageBuffer
    )
        - 8usize];
    ["Offset of field: VkPhysicalDeviceVariablePointersFeatures::variablePointers"][::core::mem::offset_of!(
        VkPhysicalDeviceVariablePointersFeatures,
        variablePointers
    ) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceProtectedMemoryFeatures"]
        [::core::mem::size_of::<VkPhysicalDeviceProtectedMemoryFeatures>() - 12usize];
    ["Alignment of VkPhysicalDeviceProtectedMemoryFeatures"]
        [::core::mem::align_of::<VkPhysicalDeviceProtectedMemoryFeatures>() - 4usize];
    ["Offset of field: VkPhysicalDeviceProtectedMemoryFeatures::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceProtectedMemoryFeatures, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceProtectedMemoryFeatures::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceProtectedMemoryFeatures, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceProtectedMemoryFeatures::protectedMemory"][::core::mem::offset_of!(
        VkPhysicalDeviceProtectedMemoryFeatures,
        protectedMemory
    ) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceProtectedMemoryProperties"]
        [::core::mem::size_of::<VkPhysicalDeviceProtectedMemoryProperties>() - 12usize];
    ["Alignment of VkPhysicalDeviceProtectedMemoryProperties"]
        [::core::mem::align_of::<VkPhysicalDeviceProtectedMemoryProperties>() - 4usize];
    ["Offset of field: VkPhysicalDeviceProtectedMemoryProperties::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceProtectedMemoryProperties, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceProtectedMemoryProperties::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceProtectedMemoryProperties, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceProtectedMemoryProperties::protectedNoFault"][::core::mem::offset_of!(
        VkPhysicalDeviceProtectedMemoryProperties,
        protectedNoFault
    ) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDeviceQueueInfo2"][::core::mem::size_of::<VkDeviceQueueInfo2>() - 20usize];
    ["Alignment of VkDeviceQueueInfo2"][::core::mem::align_of::<VkDeviceQueueInfo2>() - 4usize];
    ["Offset of field: VkDeviceQueueInfo2::sType"]
        [::core::mem::offset_of!(VkDeviceQueueInfo2, sType) - 0usize];
    ["Offset of field: VkDeviceQueueInfo2::pNext"]
        [::core::mem::offset_of!(VkDeviceQueueInfo2, pNext) - 4usize];
    ["Offset of field: VkDeviceQueueInfo2::flags"]
        [::core::mem::offset_of!(VkDeviceQueueInfo2, flags) - 8usize];
    ["Offset of field: VkDeviceQueueInfo2::queueFamilyIndex"]
        [::core::mem::offset_of!(VkDeviceQueueInfo2, queueFamilyIndex) - 12usize];
    ["Offset of field: VkDeviceQueueInfo2::queueIndex"]
        [::core::mem::offset_of!(VkDeviceQueueInfo2, queueIndex) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkProtectedSubmitInfo"][::core::mem::size_of::<VkProtectedSubmitInfo>() - 12usize];
    ["Alignment of VkProtectedSubmitInfo"]
        [::core::mem::align_of::<VkProtectedSubmitInfo>() - 4usize];
    ["Offset of field: VkProtectedSubmitInfo::sType"]
        [::core::mem::offset_of!(VkProtectedSubmitInfo, sType) - 0usize];
    ["Offset of field: VkProtectedSubmitInfo::pNext"]
        [::core::mem::offset_of!(VkProtectedSubmitInfo, pNext) - 4usize];
    ["Offset of field: VkProtectedSubmitInfo::protectedSubmit"]
        [::core::mem::offset_of!(VkProtectedSubmitInfo, protectedSubmit) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSamplerYcbcrConversionCreateInfo"]
        [::core::mem::size_of::<VkSamplerYcbcrConversionCreateInfo>() - 52usize];
    ["Alignment of VkSamplerYcbcrConversionCreateInfo"]
        [::core::mem::align_of::<VkSamplerYcbcrConversionCreateInfo>() - 4usize];
    ["Offset of field: VkSamplerYcbcrConversionCreateInfo::sType"]
        [::core::mem::offset_of!(VkSamplerYcbcrConversionCreateInfo, sType) - 0usize];
    ["Offset of field: VkSamplerYcbcrConversionCreateInfo::pNext"]
        [::core::mem::offset_of!(VkSamplerYcbcrConversionCreateInfo, pNext) - 4usize];
    ["Offset of field: VkSamplerYcbcrConversionCreateInfo::format"]
        [::core::mem::offset_of!(VkSamplerYcbcrConversionCreateInfo, format) - 8usize];
    ["Offset of field: VkSamplerYcbcrConversionCreateInfo::ycbcrModel"]
        [::core::mem::offset_of!(VkSamplerYcbcrConversionCreateInfo, ycbcrModel) - 12usize];
    ["Offset of field: VkSamplerYcbcrConversionCreateInfo::ycbcrRange"]
        [::core::mem::offset_of!(VkSamplerYcbcrConversionCreateInfo, ycbcrRange) - 16usize];
    ["Offset of field: VkSamplerYcbcrConversionCreateInfo::components"]
        [::core::mem::offset_of!(VkSamplerYcbcrConversionCreateInfo, components) - 20usize];
    ["Offset of field: VkSamplerYcbcrConversionCreateInfo::xChromaOffset"]
        [::core::mem::offset_of!(VkSamplerYcbcrConversionCreateInfo, xChromaOffset) - 36usize];
    ["Offset of field: VkSamplerYcbcrConversionCreateInfo::yChromaOffset"]
        [::core::mem::offset_of!(VkSamplerYcbcrConversionCreateInfo, yChromaOffset) - 40usize];
    ["Offset of field: VkSamplerYcbcrConversionCreateInfo::chromaFilter"]
        [::core::mem::offset_of!(VkSamplerYcbcrConversionCreateInfo, chromaFilter) - 44usize];
    ["Offset of field: VkSamplerYcbcrConversionCreateInfo::forceExplicitReconstruction"][::core::mem::offset_of!(
        VkSamplerYcbcrConversionCreateInfo,
        forceExplicitReconstruction
    )
        - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSamplerYcbcrConversionInfo"]
        [::core::mem::size_of::<VkSamplerYcbcrConversionInfo>() - 16usize];
    ["Alignment of VkSamplerYcbcrConversionInfo"]
        [::core::mem::align_of::<VkSamplerYcbcrConversionInfo>() - 8usize];
    ["Offset of field: VkSamplerYcbcrConversionInfo::sType"]
        [::core::mem::offset_of!(VkSamplerYcbcrConversionInfo, sType) - 0usize];
    ["Offset of field: VkSamplerYcbcrConversionInfo::pNext"]
        [::core::mem::offset_of!(VkSamplerYcbcrConversionInfo, pNext) - 4usize];
    ["Offset of field: VkSamplerYcbcrConversionInfo::conversion"]
        [::core::mem::offset_of!(VkSamplerYcbcrConversionInfo, conversion) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkBindImagePlaneMemoryInfo"]
        [::core::mem::size_of::<VkBindImagePlaneMemoryInfo>() - 12usize];
    ["Alignment of VkBindImagePlaneMemoryInfo"]
        [::core::mem::align_of::<VkBindImagePlaneMemoryInfo>() - 4usize];
    ["Offset of field: VkBindImagePlaneMemoryInfo::sType"]
        [::core::mem::offset_of!(VkBindImagePlaneMemoryInfo, sType) - 0usize];
    ["Offset of field: VkBindImagePlaneMemoryInfo::pNext"]
        [::core::mem::offset_of!(VkBindImagePlaneMemoryInfo, pNext) - 4usize];
    ["Offset of field: VkBindImagePlaneMemoryInfo::planeAspect"]
        [::core::mem::offset_of!(VkBindImagePlaneMemoryInfo, planeAspect) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImagePlaneMemoryRequirementsInfo"]
        [::core::mem::size_of::<VkImagePlaneMemoryRequirementsInfo>() - 12usize];
    ["Alignment of VkImagePlaneMemoryRequirementsInfo"]
        [::core::mem::align_of::<VkImagePlaneMemoryRequirementsInfo>() - 4usize];
    ["Offset of field: VkImagePlaneMemoryRequirementsInfo::sType"]
        [::core::mem::offset_of!(VkImagePlaneMemoryRequirementsInfo, sType) - 0usize];
    ["Offset of field: VkImagePlaneMemoryRequirementsInfo::pNext"]
        [::core::mem::offset_of!(VkImagePlaneMemoryRequirementsInfo, pNext) - 4usize];
    ["Offset of field: VkImagePlaneMemoryRequirementsInfo::planeAspect"]
        [::core::mem::offset_of!(VkImagePlaneMemoryRequirementsInfo, planeAspect) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceSamplerYcbcrConversionFeatures"]
        [::core::mem::size_of::<VkPhysicalDeviceSamplerYcbcrConversionFeatures>() - 12usize];
    ["Alignment of VkPhysicalDeviceSamplerYcbcrConversionFeatures"]
        [::core::mem::align_of::<VkPhysicalDeviceSamplerYcbcrConversionFeatures>() - 4usize];
    ["Offset of field: VkPhysicalDeviceSamplerYcbcrConversionFeatures::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceSamplerYcbcrConversionFeatures, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceSamplerYcbcrConversionFeatures::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceSamplerYcbcrConversionFeatures, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceSamplerYcbcrConversionFeatures::samplerYcbcrConversion"][::core::mem::offset_of!(
        VkPhysicalDeviceSamplerYcbcrConversionFeatures,
        samplerYcbcrConversion
    )
        - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSamplerYcbcrConversionImageFormatProperties"]
        [::core::mem::size_of::<VkSamplerYcbcrConversionImageFormatProperties>() - 12usize];
    ["Alignment of VkSamplerYcbcrConversionImageFormatProperties"]
        [::core::mem::align_of::<VkSamplerYcbcrConversionImageFormatProperties>() - 4usize];
    ["Offset of field: VkSamplerYcbcrConversionImageFormatProperties::sType"]
        [::core::mem::offset_of!(VkSamplerYcbcrConversionImageFormatProperties, sType) - 0usize];
    ["Offset of field: VkSamplerYcbcrConversionImageFormatProperties::pNext"]
        [::core::mem::offset_of!(VkSamplerYcbcrConversionImageFormatProperties, pNext) - 4usize];
    ["Offset of field: VkSamplerYcbcrConversionImageFormatProperties::combinedImageSamplerDescriptorCount"] [:: core :: mem :: offset_of ! (VkSamplerYcbcrConversionImageFormatProperties , combinedImageSamplerDescriptorCount) - 8usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDescriptorUpdateTemplateEntry"]
        [::core::mem::size_of::<VkDescriptorUpdateTemplateEntry>() - 24usize];
    ["Alignment of VkDescriptorUpdateTemplateEntry"]
        [::core::mem::align_of::<VkDescriptorUpdateTemplateEntry>() - 4usize];
    ["Offset of field: VkDescriptorUpdateTemplateEntry::dstBinding"]
        [::core::mem::offset_of!(VkDescriptorUpdateTemplateEntry, dstBinding) - 0usize];
    ["Offset of field: VkDescriptorUpdateTemplateEntry::dstArrayElement"]
        [::core::mem::offset_of!(VkDescriptorUpdateTemplateEntry, dstArrayElement) - 4usize];
    ["Offset of field: VkDescriptorUpdateTemplateEntry::descriptorCount"]
        [::core::mem::offset_of!(VkDescriptorUpdateTemplateEntry, descriptorCount) - 8usize];
    ["Offset of field: VkDescriptorUpdateTemplateEntry::descriptorType"]
        [::core::mem::offset_of!(VkDescriptorUpdateTemplateEntry, descriptorType) - 12usize];
    ["Offset of field: VkDescriptorUpdateTemplateEntry::offset"]
        [::core::mem::offset_of!(VkDescriptorUpdateTemplateEntry, offset) - 16usize];
    ["Offset of field: VkDescriptorUpdateTemplateEntry::stride"]
        [::core::mem::offset_of!(VkDescriptorUpdateTemplateEntry, stride) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDescriptorUpdateTemplateCreateInfo"]
        [::core::mem::size_of::<VkDescriptorUpdateTemplateCreateInfo>() - 56usize];
    ["Alignment of VkDescriptorUpdateTemplateCreateInfo"]
        [::core::mem::align_of::<VkDescriptorUpdateTemplateCreateInfo>() - 8usize];
    ["Offset of field: VkDescriptorUpdateTemplateCreateInfo::sType"]
        [::core::mem::offset_of!(VkDescriptorUpdateTemplateCreateInfo, sType) - 0usize];
    ["Offset of field: VkDescriptorUpdateTemplateCreateInfo::pNext"]
        [::core::mem::offset_of!(VkDescriptorUpdateTemplateCreateInfo, pNext) - 4usize];
    ["Offset of field: VkDescriptorUpdateTemplateCreateInfo::flags"]
        [::core::mem::offset_of!(VkDescriptorUpdateTemplateCreateInfo, flags) - 8usize];
    ["Offset of field: VkDescriptorUpdateTemplateCreateInfo::descriptorUpdateEntryCount"][::core::mem::offset_of!(
        VkDescriptorUpdateTemplateCreateInfo,
        descriptorUpdateEntryCount
    )
        - 12usize];
    ["Offset of field: VkDescriptorUpdateTemplateCreateInfo::pDescriptorUpdateEntries"][::core::mem::offset_of!(
        VkDescriptorUpdateTemplateCreateInfo,
        pDescriptorUpdateEntries
    )
        - 16usize];
    ["Offset of field: VkDescriptorUpdateTemplateCreateInfo::templateType"]
        [::core::mem::offset_of!(VkDescriptorUpdateTemplateCreateInfo, templateType) - 20usize];
    ["Offset of field: VkDescriptorUpdateTemplateCreateInfo::descriptorSetLayout"][::core::mem::offset_of!(
        VkDescriptorUpdateTemplateCreateInfo,
        descriptorSetLayout
    ) - 24usize];
    ["Offset of field: VkDescriptorUpdateTemplateCreateInfo::pipelineBindPoint"][::core::mem::offset_of!(
        VkDescriptorUpdateTemplateCreateInfo,
        pipelineBindPoint
    ) - 32usize];
    ["Offset of field: VkDescriptorUpdateTemplateCreateInfo::pipelineLayout"]
        [::core::mem::offset_of!(VkDescriptorUpdateTemplateCreateInfo, pipelineLayout) - 40usize];
    ["Offset of field: VkDescriptorUpdateTemplateCreateInfo::set"]
        [::core::mem::offset_of!(VkDescriptorUpdateTemplateCreateInfo, set) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkExternalMemoryProperties"]
        [::core::mem::size_of::<VkExternalMemoryProperties>() - 12usize];
    ["Alignment of VkExternalMemoryProperties"]
        [::core::mem::align_of::<VkExternalMemoryProperties>() - 4usize];
    ["Offset of field: VkExternalMemoryProperties::externalMemoryFeatures"]
        [::core::mem::offset_of!(VkExternalMemoryProperties, externalMemoryFeatures) - 0usize];
    ["Offset of field: VkExternalMemoryProperties::exportFromImportedHandleTypes"][::core::mem::offset_of!(
        VkExternalMemoryProperties,
        exportFromImportedHandleTypes
    ) - 4usize];
    ["Offset of field: VkExternalMemoryProperties::compatibleHandleTypes"]
        [::core::mem::offset_of!(VkExternalMemoryProperties, compatibleHandleTypes) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceExternalImageFormatInfo"]
        [::core::mem::size_of::<VkPhysicalDeviceExternalImageFormatInfo>() - 12usize];
    ["Alignment of VkPhysicalDeviceExternalImageFormatInfo"]
        [::core::mem::align_of::<VkPhysicalDeviceExternalImageFormatInfo>() - 4usize];
    ["Offset of field: VkPhysicalDeviceExternalImageFormatInfo::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceExternalImageFormatInfo, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceExternalImageFormatInfo::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceExternalImageFormatInfo, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceExternalImageFormatInfo::handleType"]
        [::core::mem::offset_of!(VkPhysicalDeviceExternalImageFormatInfo, handleType) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkExternalImageFormatProperties"]
        [::core::mem::size_of::<VkExternalImageFormatProperties>() - 20usize];
    ["Alignment of VkExternalImageFormatProperties"]
        [::core::mem::align_of::<VkExternalImageFormatProperties>() - 4usize];
    ["Offset of field: VkExternalImageFormatProperties::sType"]
        [::core::mem::offset_of!(VkExternalImageFormatProperties, sType) - 0usize];
    ["Offset of field: VkExternalImageFormatProperties::pNext"]
        [::core::mem::offset_of!(VkExternalImageFormatProperties, pNext) - 4usize];
    ["Offset of field: VkExternalImageFormatProperties::externalMemoryProperties"][::core::mem::offset_of!(
        VkExternalImageFormatProperties,
        externalMemoryProperties
    ) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceExternalBufferInfo"]
        [::core::mem::size_of::<VkPhysicalDeviceExternalBufferInfo>() - 20usize];
    ["Alignment of VkPhysicalDeviceExternalBufferInfo"]
        [::core::mem::align_of::<VkPhysicalDeviceExternalBufferInfo>() - 4usize];
    ["Offset of field: VkPhysicalDeviceExternalBufferInfo::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceExternalBufferInfo, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceExternalBufferInfo::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceExternalBufferInfo, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceExternalBufferInfo::flags"]
        [::core::mem::offset_of!(VkPhysicalDeviceExternalBufferInfo, flags) - 8usize];
    ["Offset of field: VkPhysicalDeviceExternalBufferInfo::usage"]
        [::core::mem::offset_of!(VkPhysicalDeviceExternalBufferInfo, usage) - 12usize];
    ["Offset of field: VkPhysicalDeviceExternalBufferInfo::handleType"]
        [::core::mem::offset_of!(VkPhysicalDeviceExternalBufferInfo, handleType) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkExternalBufferProperties"]
        [::core::mem::size_of::<VkExternalBufferProperties>() - 20usize];
    ["Alignment of VkExternalBufferProperties"]
        [::core::mem::align_of::<VkExternalBufferProperties>() - 4usize];
    ["Offset of field: VkExternalBufferProperties::sType"]
        [::core::mem::offset_of!(VkExternalBufferProperties, sType) - 0usize];
    ["Offset of field: VkExternalBufferProperties::pNext"]
        [::core::mem::offset_of!(VkExternalBufferProperties, pNext) - 4usize];
    ["Offset of field: VkExternalBufferProperties::externalMemoryProperties"]
        [::core::mem::offset_of!(VkExternalBufferProperties, externalMemoryProperties) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceIDProperties"]
        [::core::mem::size_of::<VkPhysicalDeviceIDProperties>() - 56usize];
    ["Alignment of VkPhysicalDeviceIDProperties"]
        [::core::mem::align_of::<VkPhysicalDeviceIDProperties>() - 4usize];
    ["Offset of field: VkPhysicalDeviceIDProperties::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceIDProperties, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceIDProperties::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceIDProperties, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceIDProperties::deviceUUID"]
        [::core::mem::offset_of!(VkPhysicalDeviceIDProperties, deviceUUID) - 8usize];
    ["Offset of field: VkPhysicalDeviceIDProperties::driverUUID"]
        [::core::mem::offset_of!(VkPhysicalDeviceIDProperties, driverUUID) - 24usize];
    ["Offset of field: VkPhysicalDeviceIDProperties::deviceLUID"]
        [::core::mem::offset_of!(VkPhysicalDeviceIDProperties, deviceLUID) - 40usize];
    ["Offset of field: VkPhysicalDeviceIDProperties::deviceNodeMask"]
        [::core::mem::offset_of!(VkPhysicalDeviceIDProperties, deviceNodeMask) - 48usize];
    ["Offset of field: VkPhysicalDeviceIDProperties::deviceLUIDValid"]
        [::core::mem::offset_of!(VkPhysicalDeviceIDProperties, deviceLUIDValid) - 52usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkExternalMemoryImageCreateInfo"]
        [::core::mem::size_of::<VkExternalMemoryImageCreateInfo>() - 12usize];
    ["Alignment of VkExternalMemoryImageCreateInfo"]
        [::core::mem::align_of::<VkExternalMemoryImageCreateInfo>() - 4usize];
    ["Offset of field: VkExternalMemoryImageCreateInfo::sType"]
        [::core::mem::offset_of!(VkExternalMemoryImageCreateInfo, sType) - 0usize];
    ["Offset of field: VkExternalMemoryImageCreateInfo::pNext"]
        [::core::mem::offset_of!(VkExternalMemoryImageCreateInfo, pNext) - 4usize];
    ["Offset of field: VkExternalMemoryImageCreateInfo::handleTypes"]
        [::core::mem::offset_of!(VkExternalMemoryImageCreateInfo, handleTypes) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkExternalMemoryBufferCreateInfo"]
        [::core::mem::size_of::<VkExternalMemoryBufferCreateInfo>() - 12usize];
    ["Alignment of VkExternalMemoryBufferCreateInfo"]
        [::core::mem::align_of::<VkExternalMemoryBufferCreateInfo>() - 4usize];
    ["Offset of field: VkExternalMemoryBufferCreateInfo::sType"]
        [::core::mem::offset_of!(VkExternalMemoryBufferCreateInfo, sType) - 0usize];
    ["Offset of field: VkExternalMemoryBufferCreateInfo::pNext"]
        [::core::mem::offset_of!(VkExternalMemoryBufferCreateInfo, pNext) - 4usize];
    ["Offset of field: VkExternalMemoryBufferCreateInfo::handleTypes"]
        [::core::mem::offset_of!(VkExternalMemoryBufferCreateInfo, handleTypes) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkExportMemoryAllocateInfo"]
        [::core::mem::size_of::<VkExportMemoryAllocateInfo>() - 12usize];
    ["Alignment of VkExportMemoryAllocateInfo"]
        [::core::mem::align_of::<VkExportMemoryAllocateInfo>() - 4usize];
    ["Offset of field: VkExportMemoryAllocateInfo::sType"]
        [::core::mem::offset_of!(VkExportMemoryAllocateInfo, sType) - 0usize];
    ["Offset of field: VkExportMemoryAllocateInfo::pNext"]
        [::core::mem::offset_of!(VkExportMemoryAllocateInfo, pNext) - 4usize];
    ["Offset of field: VkExportMemoryAllocateInfo::handleTypes"]
        [::core::mem::offset_of!(VkExportMemoryAllocateInfo, handleTypes) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceExternalFenceInfo"]
        [::core::mem::size_of::<VkPhysicalDeviceExternalFenceInfo>() - 12usize];
    ["Alignment of VkPhysicalDeviceExternalFenceInfo"]
        [::core::mem::align_of::<VkPhysicalDeviceExternalFenceInfo>() - 4usize];
    ["Offset of field: VkPhysicalDeviceExternalFenceInfo::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceExternalFenceInfo, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceExternalFenceInfo::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceExternalFenceInfo, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceExternalFenceInfo::handleType"]
        [::core::mem::offset_of!(VkPhysicalDeviceExternalFenceInfo, handleType) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkExternalFenceProperties"]
        [::core::mem::size_of::<VkExternalFenceProperties>() - 20usize];
    ["Alignment of VkExternalFenceProperties"]
        [::core::mem::align_of::<VkExternalFenceProperties>() - 4usize];
    ["Offset of field: VkExternalFenceProperties::sType"]
        [::core::mem::offset_of!(VkExternalFenceProperties, sType) - 0usize];
    ["Offset of field: VkExternalFenceProperties::pNext"]
        [::core::mem::offset_of!(VkExternalFenceProperties, pNext) - 4usize];
    ["Offset of field: VkExternalFenceProperties::exportFromImportedHandleTypes"][::core::mem::offset_of!(
        VkExternalFenceProperties,
        exportFromImportedHandleTypes
    ) - 8usize];
    ["Offset of field: VkExternalFenceProperties::compatibleHandleTypes"]
        [::core::mem::offset_of!(VkExternalFenceProperties, compatibleHandleTypes) - 12usize];
    ["Offset of field: VkExternalFenceProperties::externalFenceFeatures"]
        [::core::mem::offset_of!(VkExternalFenceProperties, externalFenceFeatures) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkExportFenceCreateInfo"]
        [::core::mem::size_of::<VkExportFenceCreateInfo>() - 12usize];
    ["Alignment of VkExportFenceCreateInfo"]
        [::core::mem::align_of::<VkExportFenceCreateInfo>() - 4usize];
    ["Offset of field: VkExportFenceCreateInfo::sType"]
        [::core::mem::offset_of!(VkExportFenceCreateInfo, sType) - 0usize];
    ["Offset of field: VkExportFenceCreateInfo::pNext"]
        [::core::mem::offset_of!(VkExportFenceCreateInfo, pNext) - 4usize];
    ["Offset of field: VkExportFenceCreateInfo::handleTypes"]
        [::core::mem::offset_of!(VkExportFenceCreateInfo, handleTypes) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkExportSemaphoreCreateInfo"]
        [::core::mem::size_of::<VkExportSemaphoreCreateInfo>() - 12usize];
    ["Alignment of VkExportSemaphoreCreateInfo"]
        [::core::mem::align_of::<VkExportSemaphoreCreateInfo>() - 4usize];
    ["Offset of field: VkExportSemaphoreCreateInfo::sType"]
        [::core::mem::offset_of!(VkExportSemaphoreCreateInfo, sType) - 0usize];
    ["Offset of field: VkExportSemaphoreCreateInfo::pNext"]
        [::core::mem::offset_of!(VkExportSemaphoreCreateInfo, pNext) - 4usize];
    ["Offset of field: VkExportSemaphoreCreateInfo::handleTypes"]
        [::core::mem::offset_of!(VkExportSemaphoreCreateInfo, handleTypes) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceExternalSemaphoreInfo"]
        [::core::mem::size_of::<VkPhysicalDeviceExternalSemaphoreInfo>() - 12usize];
    ["Alignment of VkPhysicalDeviceExternalSemaphoreInfo"]
        [::core::mem::align_of::<VkPhysicalDeviceExternalSemaphoreInfo>() - 4usize];
    ["Offset of field: VkPhysicalDeviceExternalSemaphoreInfo::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceExternalSemaphoreInfo, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceExternalSemaphoreInfo::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceExternalSemaphoreInfo, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceExternalSemaphoreInfo::handleType"]
        [::core::mem::offset_of!(VkPhysicalDeviceExternalSemaphoreInfo, handleType) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkExternalSemaphoreProperties"]
        [::core::mem::size_of::<VkExternalSemaphoreProperties>() - 20usize];
    ["Alignment of VkExternalSemaphoreProperties"]
        [::core::mem::align_of::<VkExternalSemaphoreProperties>() - 4usize];
    ["Offset of field: VkExternalSemaphoreProperties::sType"]
        [::core::mem::offset_of!(VkExternalSemaphoreProperties, sType) - 0usize];
    ["Offset of field: VkExternalSemaphoreProperties::pNext"]
        [::core::mem::offset_of!(VkExternalSemaphoreProperties, pNext) - 4usize];
    ["Offset of field: VkExternalSemaphoreProperties::exportFromImportedHandleTypes"][::core::mem::offset_of!(
        VkExternalSemaphoreProperties,
        exportFromImportedHandleTypes
    ) - 8usize];
    ["Offset of field: VkExternalSemaphoreProperties::compatibleHandleTypes"]
        [::core::mem::offset_of!(VkExternalSemaphoreProperties, compatibleHandleTypes) - 12usize];
    ["Offset of field: VkExternalSemaphoreProperties::externalSemaphoreFeatures"][::core::mem::offset_of!(
        VkExternalSemaphoreProperties,
        externalSemaphoreFeatures
    ) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceMaintenance3Properties"]
        [::core::mem::size_of::<VkPhysicalDeviceMaintenance3Properties>() - 24usize];
    ["Alignment of VkPhysicalDeviceMaintenance3Properties"]
        [::core::mem::align_of::<VkPhysicalDeviceMaintenance3Properties>() - 8usize];
    ["Offset of field: VkPhysicalDeviceMaintenance3Properties::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceMaintenance3Properties, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceMaintenance3Properties::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceMaintenance3Properties, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceMaintenance3Properties::maxPerSetDescriptors"][::core::mem::offset_of!(
        VkPhysicalDeviceMaintenance3Properties,
        maxPerSetDescriptors
    ) - 8usize];
    ["Offset of field: VkPhysicalDeviceMaintenance3Properties::maxMemoryAllocationSize"][::core::mem::offset_of!(
        VkPhysicalDeviceMaintenance3Properties,
        maxMemoryAllocationSize
    )
        - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDescriptorSetLayoutSupport"]
        [::core::mem::size_of::<VkDescriptorSetLayoutSupport>() - 12usize];
    ["Alignment of VkDescriptorSetLayoutSupport"]
        [::core::mem::align_of::<VkDescriptorSetLayoutSupport>() - 4usize];
    ["Offset of field: VkDescriptorSetLayoutSupport::sType"]
        [::core::mem::offset_of!(VkDescriptorSetLayoutSupport, sType) - 0usize];
    ["Offset of field: VkDescriptorSetLayoutSupport::pNext"]
        [::core::mem::offset_of!(VkDescriptorSetLayoutSupport, pNext) - 4usize];
    ["Offset of field: VkDescriptorSetLayoutSupport::supported"]
        [::core::mem::offset_of!(VkDescriptorSetLayoutSupport, supported) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceShaderDrawParametersFeatures"]
        [::core::mem::size_of::<VkPhysicalDeviceShaderDrawParametersFeatures>() - 12usize];
    ["Alignment of VkPhysicalDeviceShaderDrawParametersFeatures"]
        [::core::mem::align_of::<VkPhysicalDeviceShaderDrawParametersFeatures>() - 4usize];
    ["Offset of field: VkPhysicalDeviceShaderDrawParametersFeatures::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceShaderDrawParametersFeatures, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceShaderDrawParametersFeatures::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceShaderDrawParametersFeatures, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceShaderDrawParametersFeatures::shaderDrawParameters"][::core::mem::offset_of!(
        VkPhysicalDeviceShaderDrawParametersFeatures,
        shaderDrawParameters
    )
        - 8usize];
};
pub const VkDriverId_VK_DRIVER_ID_AMD_PROPRIETARY: VkDriverId = 1;
pub const VkDriverId_VK_DRIVER_ID_AMD_OPEN_SOURCE: VkDriverId = 2;
pub const VkDriverId_VK_DRIVER_ID_MESA_RADV: VkDriverId = 3;
pub const VkDriverId_VK_DRIVER_ID_NVIDIA_PROPRIETARY: VkDriverId = 4;
pub const VkDriverId_VK_DRIVER_ID_INTEL_PROPRIETARY_WINDOWS: VkDriverId = 5;
pub const VkDriverId_VK_DRIVER_ID_INTEL_OPEN_SOURCE_MESA: VkDriverId = 6;
pub const VkDriverId_VK_DRIVER_ID_IMAGINATION_PROPRIETARY: VkDriverId = 7;
pub const VkDriverId_VK_DRIVER_ID_QUALCOMM_PROPRIETARY: VkDriverId = 8;
pub const VkDriverId_VK_DRIVER_ID_ARM_PROPRIETARY: VkDriverId = 9;
pub const VkDriverId_VK_DRIVER_ID_GOOGLE_SWIFTSHADER: VkDriverId = 10;
pub const VkDriverId_VK_DRIVER_ID_GGP_PROPRIETARY: VkDriverId = 11;
pub const VkDriverId_VK_DRIVER_ID_BROADCOM_PROPRIETARY: VkDriverId = 12;
pub const VkDriverId_VK_DRIVER_ID_MESA_LLVMPIPE: VkDriverId = 13;
pub const VkDriverId_VK_DRIVER_ID_MOLTENVK: VkDriverId = 14;
pub const VkDriverId_VK_DRIVER_ID_COREAVI_PROPRIETARY: VkDriverId = 15;
pub const VkDriverId_VK_DRIVER_ID_JUICE_PROPRIETARY: VkDriverId = 16;
pub const VkDriverId_VK_DRIVER_ID_VERISILICON_PROPRIETARY: VkDriverId = 17;
pub const VkDriverId_VK_DRIVER_ID_MESA_TURNIP: VkDriverId = 18;
pub const VkDriverId_VK_DRIVER_ID_MESA_V3DV: VkDriverId = 19;
pub const VkDriverId_VK_DRIVER_ID_MESA_PANVK: VkDriverId = 20;
pub const VkDriverId_VK_DRIVER_ID_SAMSUNG_PROPRIETARY: VkDriverId = 21;
pub const VkDriverId_VK_DRIVER_ID_MESA_VENUS: VkDriverId = 22;
pub const VkDriverId_VK_DRIVER_ID_MESA_DOZEN: VkDriverId = 23;
pub const VkDriverId_VK_DRIVER_ID_MESA_NVK: VkDriverId = 24;
pub const VkDriverId_VK_DRIVER_ID_IMAGINATION_OPEN_SOURCE_MESA: VkDriverId = 25;
pub const VkDriverId_VK_DRIVER_ID_MESA_HONEYKRISP: VkDriverId = 26;
pub const VkDriverId_VK_DRIVER_ID_VULKAN_SC_EMULATION_ON_VULKAN: VkDriverId = 27;
pub const VkDriverId_VK_DRIVER_ID_AMD_PROPRIETARY_KHR: VkDriverId = 1;
pub const VkDriverId_VK_DRIVER_ID_AMD_OPEN_SOURCE_KHR: VkDriverId = 2;
pub const VkDriverId_VK_DRIVER_ID_MESA_RADV_KHR: VkDriverId = 3;
pub const VkDriverId_VK_DRIVER_ID_NVIDIA_PROPRIETARY_KHR: VkDriverId = 4;
pub const VkDriverId_VK_DRIVER_ID_INTEL_PROPRIETARY_WINDOWS_KHR: VkDriverId = 5;
pub const VkDriverId_VK_DRIVER_ID_INTEL_OPEN_SOURCE_MESA_KHR: VkDriverId = 6;
pub const VkDriverId_VK_DRIVER_ID_IMAGINATION_PROPRIETARY_KHR: VkDriverId = 7;
pub const VkDriverId_VK_DRIVER_ID_QUALCOMM_PROPRIETARY_KHR: VkDriverId = 8;
pub const VkDriverId_VK_DRIVER_ID_ARM_PROPRIETARY_KHR: VkDriverId = 9;
pub const VkDriverId_VK_DRIVER_ID_GOOGLE_SWIFTSHADER_KHR: VkDriverId = 10;
pub const VkDriverId_VK_DRIVER_ID_GGP_PROPRIETARY_KHR: VkDriverId = 11;
pub const VkDriverId_VK_DRIVER_ID_BROADCOM_PROPRIETARY_KHR: VkDriverId = 12;
pub const VkDriverId_VK_DRIVER_ID_MAX_ENUM: VkDriverId = 2147483647;
pub const VkShaderFloatControlsIndependence_VK_SHADER_FLOAT_CONTROLS_INDEPENDENCE_32_BIT_ONLY:
    VkShaderFloatControlsIndependence = 0;
pub const VkShaderFloatControlsIndependence_VK_SHADER_FLOAT_CONTROLS_INDEPENDENCE_ALL:
    VkShaderFloatControlsIndependence = 1;
pub const VkShaderFloatControlsIndependence_VK_SHADER_FLOAT_CONTROLS_INDEPENDENCE_NONE:
    VkShaderFloatControlsIndependence = 2;
pub const VkShaderFloatControlsIndependence_VK_SHADER_FLOAT_CONTROLS_INDEPENDENCE_32_BIT_ONLY_KHR : VkShaderFloatControlsIndependence = 0 ;
pub const VkShaderFloatControlsIndependence_VK_SHADER_FLOAT_CONTROLS_INDEPENDENCE_ALL_KHR:
    VkShaderFloatControlsIndependence = 1;
pub const VkShaderFloatControlsIndependence_VK_SHADER_FLOAT_CONTROLS_INDEPENDENCE_NONE_KHR:
    VkShaderFloatControlsIndependence = 2;
pub const VkShaderFloatControlsIndependence_VK_SHADER_FLOAT_CONTROLS_INDEPENDENCE_MAX_ENUM:
    VkShaderFloatControlsIndependence = 2147483647;
pub const VkSamplerReductionMode_VK_SAMPLER_REDUCTION_MODE_WEIGHTED_AVERAGE:
    VkSamplerReductionMode = 0;
pub const VkSamplerReductionMode_VK_SAMPLER_REDUCTION_MODE_MIN: VkSamplerReductionMode = 1;
pub const VkSamplerReductionMode_VK_SAMPLER_REDUCTION_MODE_MAX: VkSamplerReductionMode = 2;
pub const VkSamplerReductionMode_VK_SAMPLER_REDUCTION_MODE_WEIGHTED_AVERAGE_RANGECLAMP_QCOM:
    VkSamplerReductionMode = 1000521000;
pub const VkSamplerReductionMode_VK_SAMPLER_REDUCTION_MODE_WEIGHTED_AVERAGE_EXT:
    VkSamplerReductionMode = 0;
pub const VkSamplerReductionMode_VK_SAMPLER_REDUCTION_MODE_MIN_EXT: VkSamplerReductionMode = 1;
pub const VkSamplerReductionMode_VK_SAMPLER_REDUCTION_MODE_MAX_EXT: VkSamplerReductionMode = 2;
pub const VkSamplerReductionMode_VK_SAMPLER_REDUCTION_MODE_MAX_ENUM: VkSamplerReductionMode =
    2147483647;
pub const VkSemaphoreType_VK_SEMAPHORE_TYPE_BINARY: VkSemaphoreType = 0;
pub const VkSemaphoreType_VK_SEMAPHORE_TYPE_TIMELINE: VkSemaphoreType = 1;
pub const VkSemaphoreType_VK_SEMAPHORE_TYPE_BINARY_KHR: VkSemaphoreType = 0;
pub const VkSemaphoreType_VK_SEMAPHORE_TYPE_TIMELINE_KHR: VkSemaphoreType = 1;
pub const VkSemaphoreType_VK_SEMAPHORE_TYPE_MAX_ENUM: VkSemaphoreType = 2147483647;
pub const VkResolveModeFlagBits_VK_RESOLVE_MODE_NONE: VkResolveModeFlagBits = 0;
pub const VkResolveModeFlagBits_VK_RESOLVE_MODE_SAMPLE_ZERO_BIT: VkResolveModeFlagBits = 1;
pub const VkResolveModeFlagBits_VK_RESOLVE_MODE_AVERAGE_BIT: VkResolveModeFlagBits = 2;
pub const VkResolveModeFlagBits_VK_RESOLVE_MODE_MIN_BIT: VkResolveModeFlagBits = 4;
pub const VkResolveModeFlagBits_VK_RESOLVE_MODE_MAX_BIT: VkResolveModeFlagBits = 8;
pub const VkResolveModeFlagBits_VK_RESOLVE_MODE_EXTERNAL_FORMAT_DOWNSAMPLE_ANDROID:
    VkResolveModeFlagBits = 16;
pub const VkResolveModeFlagBits_VK_RESOLVE_MODE_NONE_KHR: VkResolveModeFlagBits = 0;
pub const VkResolveModeFlagBits_VK_RESOLVE_MODE_SAMPLE_ZERO_BIT_KHR: VkResolveModeFlagBits = 1;
pub const VkResolveModeFlagBits_VK_RESOLVE_MODE_AVERAGE_BIT_KHR: VkResolveModeFlagBits = 2;
pub const VkResolveModeFlagBits_VK_RESOLVE_MODE_MIN_BIT_KHR: VkResolveModeFlagBits = 4;
pub const VkResolveModeFlagBits_VK_RESOLVE_MODE_MAX_BIT_KHR: VkResolveModeFlagBits = 8;
pub const VkResolveModeFlagBits_VK_RESOLVE_MODE_FLAG_BITS_MAX_ENUM: VkResolveModeFlagBits =
    2147483647;
pub const VkDescriptorBindingFlagBits_VK_DESCRIPTOR_BINDING_UPDATE_AFTER_BIND_BIT:
    VkDescriptorBindingFlagBits = 1;
pub const VkDescriptorBindingFlagBits_VK_DESCRIPTOR_BINDING_UPDATE_UNUSED_WHILE_PENDING_BIT:
    VkDescriptorBindingFlagBits = 2;
pub const VkDescriptorBindingFlagBits_VK_DESCRIPTOR_BINDING_PARTIALLY_BOUND_BIT:
    VkDescriptorBindingFlagBits = 4;
pub const VkDescriptorBindingFlagBits_VK_DESCRIPTOR_BINDING_VARIABLE_DESCRIPTOR_COUNT_BIT:
    VkDescriptorBindingFlagBits = 8;
pub const VkDescriptorBindingFlagBits_VK_DESCRIPTOR_BINDING_UPDATE_AFTER_BIND_BIT_EXT:
    VkDescriptorBindingFlagBits = 1;
pub const VkDescriptorBindingFlagBits_VK_DESCRIPTOR_BINDING_UPDATE_UNUSED_WHILE_PENDING_BIT_EXT:
    VkDescriptorBindingFlagBits = 2;
pub const VkDescriptorBindingFlagBits_VK_DESCRIPTOR_BINDING_PARTIALLY_BOUND_BIT_EXT:
    VkDescriptorBindingFlagBits = 4;
pub const VkDescriptorBindingFlagBits_VK_DESCRIPTOR_BINDING_VARIABLE_DESCRIPTOR_COUNT_BIT_EXT:
    VkDescriptorBindingFlagBits = 8;
pub const VkDescriptorBindingFlagBits_VK_DESCRIPTOR_BINDING_FLAG_BITS_MAX_ENUM:
    VkDescriptorBindingFlagBits = 2147483647;
pub const VkSemaphoreWaitFlagBits_VK_SEMAPHORE_WAIT_ANY_BIT: VkSemaphoreWaitFlagBits = 1;
pub const VkSemaphoreWaitFlagBits_VK_SEMAPHORE_WAIT_ANY_BIT_KHR: VkSemaphoreWaitFlagBits = 1;
pub const VkSemaphoreWaitFlagBits_VK_SEMAPHORE_WAIT_FLAG_BITS_MAX_ENUM: VkSemaphoreWaitFlagBits =
    2147483647;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceVulkan11Features"]
        [::core::mem::size_of::<VkPhysicalDeviceVulkan11Features>() - 56usize];
    ["Alignment of VkPhysicalDeviceVulkan11Features"]
        [::core::mem::align_of::<VkPhysicalDeviceVulkan11Features>() - 4usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Features::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Features, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Features::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Features, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Features::storageBuffer16BitAccess"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan11Features,
        storageBuffer16BitAccess
    ) - 8usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Features::uniformAndStorageBuffer16BitAccess"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan11Features,
        uniformAndStorageBuffer16BitAccess
    )
        - 12usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Features::storagePushConstant16"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan11Features,
        storagePushConstant16
    ) - 16usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Features::storageInputOutput16"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Features, storageInputOutput16) - 20usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Features::multiview"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Features, multiview) - 24usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Features::multiviewGeometryShader"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan11Features,
        multiviewGeometryShader
    ) - 28usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Features::multiviewTessellationShader"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan11Features,
        multiviewTessellationShader
    ) - 32usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Features::variablePointersStorageBuffer"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan11Features,
        variablePointersStorageBuffer
    )
        - 36usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Features::variablePointers"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Features, variablePointers) - 40usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Features::protectedMemory"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Features, protectedMemory) - 44usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Features::samplerYcbcrConversion"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan11Features,
        samplerYcbcrConversion
    ) - 48usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Features::shaderDrawParameters"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Features, shaderDrawParameters) - 52usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceVulkan11Properties"]
        [::core::mem::size_of::<VkPhysicalDeviceVulkan11Properties>() - 104usize];
    ["Alignment of VkPhysicalDeviceVulkan11Properties"]
        [::core::mem::align_of::<VkPhysicalDeviceVulkan11Properties>() - 8usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Properties, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Properties, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::deviceUUID"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Properties, deviceUUID) - 8usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::driverUUID"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Properties, driverUUID) - 24usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::deviceLUID"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Properties, deviceLUID) - 40usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::deviceNodeMask"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Properties, deviceNodeMask) - 48usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::deviceLUIDValid"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Properties, deviceLUIDValid) - 52usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::subgroupSize"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Properties, subgroupSize) - 56usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::subgroupSupportedStages"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan11Properties,
        subgroupSupportedStages
    ) - 60usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::subgroupSupportedOperations"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan11Properties,
        subgroupSupportedOperations
    )
        - 64usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::subgroupQuadOperationsInAllStages"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan11Properties,
        subgroupQuadOperationsInAllStages
    )
        - 68usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::pointClippingBehavior"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan11Properties,
        pointClippingBehavior
    ) - 72usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::maxMultiviewViewCount"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan11Properties,
        maxMultiviewViewCount
    ) - 76usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::maxMultiviewInstanceIndex"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan11Properties,
        maxMultiviewInstanceIndex
    ) - 80usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::protectedNoFault"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan11Properties, protectedNoFault) - 84usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::maxPerSetDescriptors"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan11Properties,
        maxPerSetDescriptors
    ) - 88usize];
    ["Offset of field: VkPhysicalDeviceVulkan11Properties::maxMemoryAllocationSize"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan11Properties,
        maxMemoryAllocationSize
    ) - 96usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceVulkan12Features"]
        [::core::mem::size_of::<VkPhysicalDeviceVulkan12Features>() - 196usize];
    ["Alignment of VkPhysicalDeviceVulkan12Features"]
        [::core::mem::align_of::<VkPhysicalDeviceVulkan12Features>() - 4usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Features, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Features, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::samplerMirrorClampToEdge"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        samplerMirrorClampToEdge
    ) - 8usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::drawIndirectCount"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Features, drawIndirectCount) - 12usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::storageBuffer8BitAccess"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        storageBuffer8BitAccess
    ) - 16usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::uniformAndStorageBuffer8BitAccess"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        uniformAndStorageBuffer8BitAccess
    )
        - 20usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::storagePushConstant8"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Features, storagePushConstant8) - 24usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderBufferInt64Atomics"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        shaderBufferInt64Atomics
    ) - 28usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderSharedInt64Atomics"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        shaderSharedInt64Atomics
    ) - 32usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderFloat16"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Features, shaderFloat16) - 36usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderInt8"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Features, shaderInt8) - 40usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::descriptorIndexing"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Features, descriptorIndexing) - 44usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderInputAttachmentArrayDynamicIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , shaderInputAttachmentArrayDynamicIndexing) - 48usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderUniformTexelBufferArrayDynamicIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , shaderUniformTexelBufferArrayDynamicIndexing) - 52usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderStorageTexelBufferArrayDynamicIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , shaderStorageTexelBufferArrayDynamicIndexing) - 56usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderUniformBufferArrayNonUniformIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , shaderUniformBufferArrayNonUniformIndexing) - 60usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderSampledImageArrayNonUniformIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , shaderSampledImageArrayNonUniformIndexing) - 64usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderStorageBufferArrayNonUniformIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , shaderStorageBufferArrayNonUniformIndexing) - 68usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderStorageImageArrayNonUniformIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , shaderStorageImageArrayNonUniformIndexing) - 72usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderInputAttachmentArrayNonUniformIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , shaderInputAttachmentArrayNonUniformIndexing) - 76usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderUniformTexelBufferArrayNonUniformIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , shaderUniformTexelBufferArrayNonUniformIndexing) - 80usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderStorageTexelBufferArrayNonUniformIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , shaderStorageTexelBufferArrayNonUniformIndexing) - 84usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::descriptorBindingUniformBufferUpdateAfterBind"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , descriptorBindingUniformBufferUpdateAfterBind) - 88usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::descriptorBindingSampledImageUpdateAfterBind"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , descriptorBindingSampledImageUpdateAfterBind) - 92usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::descriptorBindingStorageImageUpdateAfterBind"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , descriptorBindingStorageImageUpdateAfterBind) - 96usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::descriptorBindingStorageBufferUpdateAfterBind"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , descriptorBindingStorageBufferUpdateAfterBind) - 100usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::descriptorBindingUniformTexelBufferUpdateAfterBind"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , descriptorBindingUniformTexelBufferUpdateAfterBind) - 104usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::descriptorBindingStorageTexelBufferUpdateAfterBind"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , descriptorBindingStorageTexelBufferUpdateAfterBind) - 108usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::descriptorBindingUpdateUnusedWhilePending"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , descriptorBindingUpdateUnusedWhilePending) - 112usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::descriptorBindingPartiallyBound"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        descriptorBindingPartiallyBound
    )
        - 116usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::descriptorBindingVariableDescriptorCount"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , descriptorBindingVariableDescriptorCount) - 120usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::runtimeDescriptorArray"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        runtimeDescriptorArray
    ) - 124usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::samplerFilterMinmax"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Features, samplerFilterMinmax) - 128usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::scalarBlockLayout"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Features, scalarBlockLayout) - 132usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::imagelessFramebuffer"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        imagelessFramebuffer
    ) - 136usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::uniformBufferStandardLayout"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        uniformBufferStandardLayout
    )
        - 140usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderSubgroupExtendedTypes"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        shaderSubgroupExtendedTypes
    )
        - 144usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::separateDepthStencilLayouts"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        separateDepthStencilLayouts
    )
        - 148usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::hostQueryReset"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Features, hostQueryReset) - 152usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::timelineSemaphore"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Features, timelineSemaphore) - 156usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::bufferDeviceAddress"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Features, bufferDeviceAddress) - 160usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::bufferDeviceAddressCaptureReplay"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        bufferDeviceAddressCaptureReplay
    )
        - 164usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::bufferDeviceAddressMultiDevice"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        bufferDeviceAddressMultiDevice
    )
        - 168usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::vulkanMemoryModel"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Features, vulkanMemoryModel) - 172usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::vulkanMemoryModelDeviceScope"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        vulkanMemoryModelDeviceScope
    )
        - 176usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::vulkanMemoryModelAvailabilityVisibilityChains"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Features , vulkanMemoryModelAvailabilityVisibilityChains) - 180usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderOutputViewportIndex"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        shaderOutputViewportIndex
    ) - 184usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::shaderOutputLayer"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Features, shaderOutputLayer) - 188usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Features::subgroupBroadcastDynamicId"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Features,
        subgroupBroadcastDynamicId
    ) - 192usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkConformanceVersion"][::core::mem::size_of::<VkConformanceVersion>() - 4usize];
    ["Alignment of VkConformanceVersion"][::core::mem::align_of::<VkConformanceVersion>() - 1usize];
    ["Offset of field: VkConformanceVersion::major"]
        [::core::mem::offset_of!(VkConformanceVersion, major) - 0usize];
    ["Offset of field: VkConformanceVersion::minor"]
        [::core::mem::offset_of!(VkConformanceVersion, minor) - 1usize];
    ["Offset of field: VkConformanceVersion::subminor"]
        [::core::mem::offset_of!(VkConformanceVersion, subminor) - 2usize];
    ["Offset of field: VkConformanceVersion::patch"]
        [::core::mem::offset_of!(VkConformanceVersion, patch) - 3usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceVulkan12Properties"]
        [::core::mem::size_of::<VkPhysicalDeviceVulkan12Properties>() - 728usize];
    ["Alignment of VkPhysicalDeviceVulkan12Properties"]
        [::core::mem::align_of::<VkPhysicalDeviceVulkan12Properties>() - 8usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Properties, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Properties, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::driverID"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Properties, driverID) - 8usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::driverName"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Properties, driverName) - 12usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::driverInfo"]
        [::core::mem::offset_of!(VkPhysicalDeviceVulkan12Properties, driverInfo) - 268usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::conformanceVersion"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        conformanceVersion
    ) - 524usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::denormBehaviorIndependence"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        denormBehaviorIndependence
    )
        - 528usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::roundingModeIndependence"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        roundingModeIndependence
    ) - 532usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderSignedZeroInfNanPreserveFloat16"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , shaderSignedZeroInfNanPreserveFloat16) - 536usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderSignedZeroInfNanPreserveFloat32"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , shaderSignedZeroInfNanPreserveFloat32) - 540usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderSignedZeroInfNanPreserveFloat64"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , shaderSignedZeroInfNanPreserveFloat64) - 544usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderDenormPreserveFloat16"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        shaderDenormPreserveFloat16
    )
        - 548usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderDenormPreserveFloat32"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        shaderDenormPreserveFloat32
    )
        - 552usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderDenormPreserveFloat64"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        shaderDenormPreserveFloat64
    )
        - 556usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderDenormFlushToZeroFloat16"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        shaderDenormFlushToZeroFloat16
    )
        - 560usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderDenormFlushToZeroFloat32"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        shaderDenormFlushToZeroFloat32
    )
        - 564usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderDenormFlushToZeroFloat64"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        shaderDenormFlushToZeroFloat64
    )
        - 568usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderRoundingModeRTEFloat16"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        shaderRoundingModeRTEFloat16
    )
        - 572usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderRoundingModeRTEFloat32"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        shaderRoundingModeRTEFloat32
    )
        - 576usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderRoundingModeRTEFloat64"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        shaderRoundingModeRTEFloat64
    )
        - 580usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderRoundingModeRTZFloat16"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        shaderRoundingModeRTZFloat16
    )
        - 584usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderRoundingModeRTZFloat32"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        shaderRoundingModeRTZFloat32
    )
        - 588usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderRoundingModeRTZFloat64"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        shaderRoundingModeRTZFloat64
    )
        - 592usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxUpdateAfterBindDescriptorsInAllPools"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , maxUpdateAfterBindDescriptorsInAllPools) - 596usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderUniformBufferArrayNonUniformIndexingNative"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , shaderUniformBufferArrayNonUniformIndexingNative) - 600usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderSampledImageArrayNonUniformIndexingNative"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , shaderSampledImageArrayNonUniformIndexingNative) - 604usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderStorageBufferArrayNonUniformIndexingNative"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , shaderStorageBufferArrayNonUniformIndexingNative) - 608usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderStorageImageArrayNonUniformIndexingNative"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , shaderStorageImageArrayNonUniformIndexingNative) - 612usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::shaderInputAttachmentArrayNonUniformIndexingNative"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , shaderInputAttachmentArrayNonUniformIndexingNative) - 616usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::robustBufferAccessUpdateAfterBind"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        robustBufferAccessUpdateAfterBind
    )
        - 620usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::quadDivergentImplicitLod"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        quadDivergentImplicitLod
    ) - 624usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxPerStageDescriptorUpdateAfterBindSamplers"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , maxPerStageDescriptorUpdateAfterBindSamplers) - 628usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxPerStageDescriptorUpdateAfterBindUniformBuffers"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , maxPerStageDescriptorUpdateAfterBindUniformBuffers) - 632usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxPerStageDescriptorUpdateAfterBindStorageBuffers"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , maxPerStageDescriptorUpdateAfterBindStorageBuffers) - 636usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxPerStageDescriptorUpdateAfterBindSampledImages"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , maxPerStageDescriptorUpdateAfterBindSampledImages) - 640usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxPerStageDescriptorUpdateAfterBindStorageImages"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , maxPerStageDescriptorUpdateAfterBindStorageImages) - 644usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxPerStageDescriptorUpdateAfterBindInputAttachments"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , maxPerStageDescriptorUpdateAfterBindInputAttachments) - 648usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxPerStageUpdateAfterBindResources"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        maxPerStageUpdateAfterBindResources
    )
        - 652usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxDescriptorSetUpdateAfterBindSamplers"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , maxDescriptorSetUpdateAfterBindSamplers) - 656usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxDescriptorSetUpdateAfterBindUniformBuffers"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , maxDescriptorSetUpdateAfterBindUniformBuffers) - 660usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxDescriptorSetUpdateAfterBindUniformBuffersDynamic"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , maxDescriptorSetUpdateAfterBindUniformBuffersDynamic) - 664usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxDescriptorSetUpdateAfterBindStorageBuffers"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , maxDescriptorSetUpdateAfterBindStorageBuffers) - 668usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxDescriptorSetUpdateAfterBindStorageBuffersDynamic"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , maxDescriptorSetUpdateAfterBindStorageBuffersDynamic) - 672usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxDescriptorSetUpdateAfterBindSampledImages"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , maxDescriptorSetUpdateAfterBindSampledImages) - 676usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxDescriptorSetUpdateAfterBindStorageImages"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , maxDescriptorSetUpdateAfterBindStorageImages) - 680usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxDescriptorSetUpdateAfterBindInputAttachments"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceVulkan12Properties , maxDescriptorSetUpdateAfterBindInputAttachments) - 684usize] ;
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::supportedDepthResolveModes"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        supportedDepthResolveModes
    )
        - 688usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::supportedStencilResolveModes"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        supportedStencilResolveModes
    )
        - 692usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::independentResolveNone"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        independentResolveNone
    ) - 696usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::independentResolve"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        independentResolve
    ) - 700usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::filterMinmaxSingleComponentFormats"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        filterMinmaxSingleComponentFormats
    )
        - 704usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::filterMinmaxImageComponentMapping"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        filterMinmaxImageComponentMapping
    )
        - 708usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::maxTimelineSemaphoreValueDifference"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        maxTimelineSemaphoreValueDifference
    )
        - 712usize];
    ["Offset of field: VkPhysicalDeviceVulkan12Properties::framebufferIntegerColorSampleCounts"][::core::mem::offset_of!(
        VkPhysicalDeviceVulkan12Properties,
        framebufferIntegerColorSampleCounts
    )
        - 720usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkImageFormatListCreateInfo"]
        [::core::mem::size_of::<VkImageFormatListCreateInfo>() - 16usize];
    ["Alignment of VkImageFormatListCreateInfo"]
        [::core::mem::align_of::<VkImageFormatListCreateInfo>() - 4usize];
    ["Offset of field: VkImageFormatListCreateInfo::sType"]
        [::core::mem::offset_of!(VkImageFormatListCreateInfo, sType) - 0usize];
    ["Offset of field: VkImageFormatListCreateInfo::pNext"]
        [::core::mem::offset_of!(VkImageFormatListCreateInfo, pNext) - 4usize];
    ["Offset of field: VkImageFormatListCreateInfo::viewFormatCount"]
        [::core::mem::offset_of!(VkImageFormatListCreateInfo, viewFormatCount) - 8usize];
    ["Offset of field: VkImageFormatListCreateInfo::pViewFormats"]
        [::core::mem::offset_of!(VkImageFormatListCreateInfo, pViewFormats) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkAttachmentDescription2"]
        [::core::mem::size_of::<VkAttachmentDescription2>() - 44usize];
    ["Alignment of VkAttachmentDescription2"]
        [::core::mem::align_of::<VkAttachmentDescription2>() - 4usize];
    ["Offset of field: VkAttachmentDescription2::sType"]
        [::core::mem::offset_of!(VkAttachmentDescription2, sType) - 0usize];
    ["Offset of field: VkAttachmentDescription2::pNext"]
        [::core::mem::offset_of!(VkAttachmentDescription2, pNext) - 4usize];
    ["Offset of field: VkAttachmentDescription2::flags"]
        [::core::mem::offset_of!(VkAttachmentDescription2, flags) - 8usize];
    ["Offset of field: VkAttachmentDescription2::format"]
        [::core::mem::offset_of!(VkAttachmentDescription2, format) - 12usize];
    ["Offset of field: VkAttachmentDescription2::samples"]
        [::core::mem::offset_of!(VkAttachmentDescription2, samples) - 16usize];
    ["Offset of field: VkAttachmentDescription2::loadOp"]
        [::core::mem::offset_of!(VkAttachmentDescription2, loadOp) - 20usize];
    ["Offset of field: VkAttachmentDescription2::storeOp"]
        [::core::mem::offset_of!(VkAttachmentDescription2, storeOp) - 24usize];
    ["Offset of field: VkAttachmentDescription2::stencilLoadOp"]
        [::core::mem::offset_of!(VkAttachmentDescription2, stencilLoadOp) - 28usize];
    ["Offset of field: VkAttachmentDescription2::stencilStoreOp"]
        [::core::mem::offset_of!(VkAttachmentDescription2, stencilStoreOp) - 32usize];
    ["Offset of field: VkAttachmentDescription2::initialLayout"]
        [::core::mem::offset_of!(VkAttachmentDescription2, initialLayout) - 36usize];
    ["Offset of field: VkAttachmentDescription2::finalLayout"]
        [::core::mem::offset_of!(VkAttachmentDescription2, finalLayout) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkAttachmentReference2"][::core::mem::size_of::<VkAttachmentReference2>() - 20usize];
    ["Alignment of VkAttachmentReference2"]
        [::core::mem::align_of::<VkAttachmentReference2>() - 4usize];
    ["Offset of field: VkAttachmentReference2::sType"]
        [::core::mem::offset_of!(VkAttachmentReference2, sType) - 0usize];
    ["Offset of field: VkAttachmentReference2::pNext"]
        [::core::mem::offset_of!(VkAttachmentReference2, pNext) - 4usize];
    ["Offset of field: VkAttachmentReference2::attachment"]
        [::core::mem::offset_of!(VkAttachmentReference2, attachment) - 8usize];
    ["Offset of field: VkAttachmentReference2::layout"]
        [::core::mem::offset_of!(VkAttachmentReference2, layout) - 12usize];
    ["Offset of field: VkAttachmentReference2::aspectMask"]
        [::core::mem::offset_of!(VkAttachmentReference2, aspectMask) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSubpassDescription2"][::core::mem::size_of::<VkSubpassDescription2>() - 52usize];
    ["Alignment of VkSubpassDescription2"]
        [::core::mem::align_of::<VkSubpassDescription2>() - 4usize];
    ["Offset of field: VkSubpassDescription2::sType"]
        [::core::mem::offset_of!(VkSubpassDescription2, sType) - 0usize];
    ["Offset of field: VkSubpassDescription2::pNext"]
        [::core::mem::offset_of!(VkSubpassDescription2, pNext) - 4usize];
    ["Offset of field: VkSubpassDescription2::flags"]
        [::core::mem::offset_of!(VkSubpassDescription2, flags) - 8usize];
    ["Offset of field: VkSubpassDescription2::pipelineBindPoint"]
        [::core::mem::offset_of!(VkSubpassDescription2, pipelineBindPoint) - 12usize];
    ["Offset of field: VkSubpassDescription2::viewMask"]
        [::core::mem::offset_of!(VkSubpassDescription2, viewMask) - 16usize];
    ["Offset of field: VkSubpassDescription2::inputAttachmentCount"]
        [::core::mem::offset_of!(VkSubpassDescription2, inputAttachmentCount) - 20usize];
    ["Offset of field: VkSubpassDescription2::pInputAttachments"]
        [::core::mem::offset_of!(VkSubpassDescription2, pInputAttachments) - 24usize];
    ["Offset of field: VkSubpassDescription2::colorAttachmentCount"]
        [::core::mem::offset_of!(VkSubpassDescription2, colorAttachmentCount) - 28usize];
    ["Offset of field: VkSubpassDescription2::pColorAttachments"]
        [::core::mem::offset_of!(VkSubpassDescription2, pColorAttachments) - 32usize];
    ["Offset of field: VkSubpassDescription2::pResolveAttachments"]
        [::core::mem::offset_of!(VkSubpassDescription2, pResolveAttachments) - 36usize];
    ["Offset of field: VkSubpassDescription2::pDepthStencilAttachment"]
        [::core::mem::offset_of!(VkSubpassDescription2, pDepthStencilAttachment) - 40usize];
    ["Offset of field: VkSubpassDescription2::preserveAttachmentCount"]
        [::core::mem::offset_of!(VkSubpassDescription2, preserveAttachmentCount) - 44usize];
    ["Offset of field: VkSubpassDescription2::pPreserveAttachments"]
        [::core::mem::offset_of!(VkSubpassDescription2, pPreserveAttachments) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSubpassDependency2"][::core::mem::size_of::<VkSubpassDependency2>() - 40usize];
    ["Alignment of VkSubpassDependency2"][::core::mem::align_of::<VkSubpassDependency2>() - 4usize];
    ["Offset of field: VkSubpassDependency2::sType"]
        [::core::mem::offset_of!(VkSubpassDependency2, sType) - 0usize];
    ["Offset of field: VkSubpassDependency2::pNext"]
        [::core::mem::offset_of!(VkSubpassDependency2, pNext) - 4usize];
    ["Offset of field: VkSubpassDependency2::srcSubpass"]
        [::core::mem::offset_of!(VkSubpassDependency2, srcSubpass) - 8usize];
    ["Offset of field: VkSubpassDependency2::dstSubpass"]
        [::core::mem::offset_of!(VkSubpassDependency2, dstSubpass) - 12usize];
    ["Offset of field: VkSubpassDependency2::srcStageMask"]
        [::core::mem::offset_of!(VkSubpassDependency2, srcStageMask) - 16usize];
    ["Offset of field: VkSubpassDependency2::dstStageMask"]
        [::core::mem::offset_of!(VkSubpassDependency2, dstStageMask) - 20usize];
    ["Offset of field: VkSubpassDependency2::srcAccessMask"]
        [::core::mem::offset_of!(VkSubpassDependency2, srcAccessMask) - 24usize];
    ["Offset of field: VkSubpassDependency2::dstAccessMask"]
        [::core::mem::offset_of!(VkSubpassDependency2, dstAccessMask) - 28usize];
    ["Offset of field: VkSubpassDependency2::dependencyFlags"]
        [::core::mem::offset_of!(VkSubpassDependency2, dependencyFlags) - 32usize];
    ["Offset of field: VkSubpassDependency2::viewOffset"]
        [::core::mem::offset_of!(VkSubpassDependency2, viewOffset) - 36usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkRenderPassCreateInfo2"]
        [::core::mem::size_of::<VkRenderPassCreateInfo2>() - 44usize];
    ["Alignment of VkRenderPassCreateInfo2"]
        [::core::mem::align_of::<VkRenderPassCreateInfo2>() - 4usize];
    ["Offset of field: VkRenderPassCreateInfo2::sType"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo2, sType) - 0usize];
    ["Offset of field: VkRenderPassCreateInfo2::pNext"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo2, pNext) - 4usize];
    ["Offset of field: VkRenderPassCreateInfo2::flags"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo2, flags) - 8usize];
    ["Offset of field: VkRenderPassCreateInfo2::attachmentCount"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo2, attachmentCount) - 12usize];
    ["Offset of field: VkRenderPassCreateInfo2::pAttachments"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo2, pAttachments) - 16usize];
    ["Offset of field: VkRenderPassCreateInfo2::subpassCount"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo2, subpassCount) - 20usize];
    ["Offset of field: VkRenderPassCreateInfo2::pSubpasses"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo2, pSubpasses) - 24usize];
    ["Offset of field: VkRenderPassCreateInfo2::dependencyCount"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo2, dependencyCount) - 28usize];
    ["Offset of field: VkRenderPassCreateInfo2::pDependencies"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo2, pDependencies) - 32usize];
    ["Offset of field: VkRenderPassCreateInfo2::correlatedViewMaskCount"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo2, correlatedViewMaskCount) - 36usize];
    ["Offset of field: VkRenderPassCreateInfo2::pCorrelatedViewMasks"]
        [::core::mem::offset_of!(VkRenderPassCreateInfo2, pCorrelatedViewMasks) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSubpassBeginInfo"][::core::mem::size_of::<VkSubpassBeginInfo>() - 12usize];
    ["Alignment of VkSubpassBeginInfo"][::core::mem::align_of::<VkSubpassBeginInfo>() - 4usize];
    ["Offset of field: VkSubpassBeginInfo::sType"]
        [::core::mem::offset_of!(VkSubpassBeginInfo, sType) - 0usize];
    ["Offset of field: VkSubpassBeginInfo::pNext"]
        [::core::mem::offset_of!(VkSubpassBeginInfo, pNext) - 4usize];
    ["Offset of field: VkSubpassBeginInfo::contents"]
        [::core::mem::offset_of!(VkSubpassBeginInfo, contents) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkSubpassEndInfo"][::core::mem::size_of::<VkSubpassEndInfo>() - 8usize];
    ["Alignment of VkSubpassEndInfo"][::core::mem::align_of::<VkSubpassEndInfo>() - 4usize];
    ["Offset of field: VkSubpassEndInfo::sType"]
        [::core::mem::offset_of!(VkSubpassEndInfo, sType) - 0usize];
    ["Offset of field: VkSubpassEndInfo::pNext"]
        [::core::mem::offset_of!(VkSubpassEndInfo, pNext) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDevice8BitStorageFeatures"]
        [::core::mem::size_of::<VkPhysicalDevice8BitStorageFeatures>() - 20usize];
    ["Alignment of VkPhysicalDevice8BitStorageFeatures"]
        [::core::mem::align_of::<VkPhysicalDevice8BitStorageFeatures>() - 4usize];
    ["Offset of field: VkPhysicalDevice8BitStorageFeatures::sType"]
        [::core::mem::offset_of!(VkPhysicalDevice8BitStorageFeatures, sType) - 0usize];
    ["Offset of field: VkPhysicalDevice8BitStorageFeatures::pNext"]
        [::core::mem::offset_of!(VkPhysicalDevice8BitStorageFeatures, pNext) - 4usize];
    ["Offset of field: VkPhysicalDevice8BitStorageFeatures::storageBuffer8BitAccess"][::core::mem::offset_of!(
        VkPhysicalDevice8BitStorageFeatures,
        storageBuffer8BitAccess
    ) - 8usize];
    ["Offset of field: VkPhysicalDevice8BitStorageFeatures::uniformAndStorageBuffer8BitAccess"][::core::mem::offset_of!(
        VkPhysicalDevice8BitStorageFeatures,
        uniformAndStorageBuffer8BitAccess
    )
        - 12usize];
    ["Offset of field: VkPhysicalDevice8BitStorageFeatures::storagePushConstant8"][::core::mem::offset_of!(
        VkPhysicalDevice8BitStorageFeatures,
        storagePushConstant8
    ) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceDriverProperties"]
        [::core::mem::size_of::<VkPhysicalDeviceDriverProperties>() - 528usize];
    ["Alignment of VkPhysicalDeviceDriverProperties"]
        [::core::mem::align_of::<VkPhysicalDeviceDriverProperties>() - 4usize];
    ["Offset of field: VkPhysicalDeviceDriverProperties::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceDriverProperties, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceDriverProperties::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceDriverProperties, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceDriverProperties::driverID"]
        [::core::mem::offset_of!(VkPhysicalDeviceDriverProperties, driverID) - 8usize];
    ["Offset of field: VkPhysicalDeviceDriverProperties::driverName"]
        [::core::mem::offset_of!(VkPhysicalDeviceDriverProperties, driverName) - 12usize];
    ["Offset of field: VkPhysicalDeviceDriverProperties::driverInfo"]
        [::core::mem::offset_of!(VkPhysicalDeviceDriverProperties, driverInfo) - 268usize];
    ["Offset of field: VkPhysicalDeviceDriverProperties::conformanceVersion"]
        [::core::mem::offset_of!(VkPhysicalDeviceDriverProperties, conformanceVersion) - 524usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceShaderAtomicInt64Features"]
        [::core::mem::size_of::<VkPhysicalDeviceShaderAtomicInt64Features>() - 16usize];
    ["Alignment of VkPhysicalDeviceShaderAtomicInt64Features"]
        [::core::mem::align_of::<VkPhysicalDeviceShaderAtomicInt64Features>() - 4usize];
    ["Offset of field: VkPhysicalDeviceShaderAtomicInt64Features::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceShaderAtomicInt64Features, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceShaderAtomicInt64Features::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceShaderAtomicInt64Features, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceShaderAtomicInt64Features::shaderBufferInt64Atomics"][::core::mem::offset_of!(
        VkPhysicalDeviceShaderAtomicInt64Features,
        shaderBufferInt64Atomics
    )
        - 8usize];
    ["Offset of field: VkPhysicalDeviceShaderAtomicInt64Features::shaderSharedInt64Atomics"][::core::mem::offset_of!(
        VkPhysicalDeviceShaderAtomicInt64Features,
        shaderSharedInt64Atomics
    )
        - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceShaderFloat16Int8Features"]
        [::core::mem::size_of::<VkPhysicalDeviceShaderFloat16Int8Features>() - 16usize];
    ["Alignment of VkPhysicalDeviceShaderFloat16Int8Features"]
        [::core::mem::align_of::<VkPhysicalDeviceShaderFloat16Int8Features>() - 4usize];
    ["Offset of field: VkPhysicalDeviceShaderFloat16Int8Features::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceShaderFloat16Int8Features, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceShaderFloat16Int8Features::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceShaderFloat16Int8Features, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceShaderFloat16Int8Features::shaderFloat16"][::core::mem::offset_of!(
        VkPhysicalDeviceShaderFloat16Int8Features,
        shaderFloat16
    ) - 8usize];
    ["Offset of field: VkPhysicalDeviceShaderFloat16Int8Features::shaderInt8"]
        [::core::mem::offset_of!(VkPhysicalDeviceShaderFloat16Int8Features, shaderInt8) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceFloatControlsProperties"]
        [::core::mem::size_of::<VkPhysicalDeviceFloatControlsProperties>() - 76usize];
    ["Alignment of VkPhysicalDeviceFloatControlsProperties"]
        [::core::mem::align_of::<VkPhysicalDeviceFloatControlsProperties>() - 4usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceFloatControlsProperties, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceFloatControlsProperties, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::denormBehaviorIndependence"][::core::mem::offset_of!(
        VkPhysicalDeviceFloatControlsProperties,
        denormBehaviorIndependence
    )
        - 8usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::roundingModeIndependence"][::core::mem::offset_of!(
        VkPhysicalDeviceFloatControlsProperties,
        roundingModeIndependence
    )
        - 12usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::shaderSignedZeroInfNanPreserveFloat16"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceFloatControlsProperties , shaderSignedZeroInfNanPreserveFloat16) - 16usize] ;
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::shaderSignedZeroInfNanPreserveFloat32"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceFloatControlsProperties , shaderSignedZeroInfNanPreserveFloat32) - 20usize] ;
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::shaderSignedZeroInfNanPreserveFloat64"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceFloatControlsProperties , shaderSignedZeroInfNanPreserveFloat64) - 24usize] ;
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::shaderDenormPreserveFloat16"][::core::mem::offset_of!(
        VkPhysicalDeviceFloatControlsProperties,
        shaderDenormPreserveFloat16
    )
        - 28usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::shaderDenormPreserveFloat32"][::core::mem::offset_of!(
        VkPhysicalDeviceFloatControlsProperties,
        shaderDenormPreserveFloat32
    )
        - 32usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::shaderDenormPreserveFloat64"][::core::mem::offset_of!(
        VkPhysicalDeviceFloatControlsProperties,
        shaderDenormPreserveFloat64
    )
        - 36usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::shaderDenormFlushToZeroFloat16"][::core::mem::offset_of!(
        VkPhysicalDeviceFloatControlsProperties,
        shaderDenormFlushToZeroFloat16
    )
        - 40usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::shaderDenormFlushToZeroFloat32"][::core::mem::offset_of!(
        VkPhysicalDeviceFloatControlsProperties,
        shaderDenormFlushToZeroFloat32
    )
        - 44usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::shaderDenormFlushToZeroFloat64"][::core::mem::offset_of!(
        VkPhysicalDeviceFloatControlsProperties,
        shaderDenormFlushToZeroFloat64
    )
        - 48usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::shaderRoundingModeRTEFloat16"][::core::mem::offset_of!(
        VkPhysicalDeviceFloatControlsProperties,
        shaderRoundingModeRTEFloat16
    )
        - 52usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::shaderRoundingModeRTEFloat32"][::core::mem::offset_of!(
        VkPhysicalDeviceFloatControlsProperties,
        shaderRoundingModeRTEFloat32
    )
        - 56usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::shaderRoundingModeRTEFloat64"][::core::mem::offset_of!(
        VkPhysicalDeviceFloatControlsProperties,
        shaderRoundingModeRTEFloat64
    )
        - 60usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::shaderRoundingModeRTZFloat16"][::core::mem::offset_of!(
        VkPhysicalDeviceFloatControlsProperties,
        shaderRoundingModeRTZFloat16
    )
        - 64usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::shaderRoundingModeRTZFloat32"][::core::mem::offset_of!(
        VkPhysicalDeviceFloatControlsProperties,
        shaderRoundingModeRTZFloat32
    )
        - 68usize];
    ["Offset of field: VkPhysicalDeviceFloatControlsProperties::shaderRoundingModeRTZFloat64"][::core::mem::offset_of!(
        VkPhysicalDeviceFloatControlsProperties,
        shaderRoundingModeRTZFloat64
    )
        - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkDescriptorSetLayoutBindingFlagsCreateInfo"]
        [::core::mem::size_of::<VkDescriptorSetLayoutBindingFlagsCreateInfo>() - 16usize];
    ["Alignment of VkDescriptorSetLayoutBindingFlagsCreateInfo"]
        [::core::mem::align_of::<VkDescriptorSetLayoutBindingFlagsCreateInfo>() - 4usize];
    ["Offset of field: VkDescriptorSetLayoutBindingFlagsCreateInfo::sType"]
        [::core::mem::offset_of!(VkDescriptorSetLayoutBindingFlagsCreateInfo, sType) - 0usize];
    ["Offset of field: VkDescriptorSetLayoutBindingFlagsCreateInfo::pNext"]
        [::core::mem::offset_of!(VkDescriptorSetLayoutBindingFlagsCreateInfo, pNext) - 4usize];
    ["Offset of field: VkDescriptorSetLayoutBindingFlagsCreateInfo::bindingCount"][::core::mem::offset_of!(
        VkDescriptorSetLayoutBindingFlagsCreateInfo,
        bindingCount
    ) - 8usize];
    ["Offset of field: VkDescriptorSetLayoutBindingFlagsCreateInfo::pBindingFlags"][::core::mem::offset_of!(
        VkDescriptorSetLayoutBindingFlagsCreateInfo,
        pBindingFlags
    ) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VkPhysicalDeviceDescriptorIndexingFeatures"]
        [::core::mem::size_of::<VkPhysicalDeviceDescriptorIndexingFeatures>() - 88usize];
    ["Alignment of VkPhysicalDeviceDescriptorIndexingFeatures"]
        [::core::mem::align_of::<VkPhysicalDeviceDescriptorIndexingFeatures>() - 4usize];
    ["Offset of field: VkPhysicalDeviceDescriptorIndexingFeatures::sType"]
        [::core::mem::offset_of!(VkPhysicalDeviceDescriptorIndexingFeatures, sType) - 0usize];
    ["Offset of field: VkPhysicalDeviceDescriptorIndexingFeatures::pNext"]
        [::core::mem::offset_of!(VkPhysicalDeviceDescriptorIndexingFeatures, pNext) - 4usize];
    ["Offset of field: VkPhysicalDeviceDescriptorIndexingFeatures::shaderInputAttachmentArrayDynamicIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceDescriptorIndexingFeatures , shaderInputAttachmentArrayDynamicIndexing) - 8usize] ;
    ["Offset of field: VkPhysicalDeviceDescriptorIndexingFeatures::shaderUniformTexelBufferArrayDynamicIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceDescriptorIndexingFeatures , shaderUniformTexelBufferArrayDynamicIndexing) - 12usize] ;
    ["Offset of field: VkPhysicalDeviceDescriptorIndexingFeatures::shaderStorageTexelBufferArrayDynamicIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceDescriptorIndexingFeatures , shaderStorageTexelBufferArrayDynamicIndexing) - 16usize] ;
    ["Offset of field: VkPhysicalDeviceDescriptorIndexingFeatures::shaderUniformBufferArrayNonUniformIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceDescriptorIndexingFeatures , shaderUniformBufferArrayNonUniformIndexing) - 20usize] ;
    ["Offset of field: VkPhysicalDeviceDescriptorIndexingFeatures::shaderSampledImageArrayNonUniformIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceDescriptorIndexingFeatures , shaderSampledImageArrayNonUniformIndexing) - 24usize] ;
    ["Offset of field: VkPhysicalDeviceDescriptorIndexingFeatures::shaderStorageBufferArrayNonUniformIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceDescriptorIndexingFeatures , shaderStorageBufferArrayNonUniformIndexing) - 28usize] ;
    ["Offset of field: VkPhysicalDeviceDescriptorIndexingFeatures::shaderStorageImageArrayNonUniformIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceDescriptorIndexingFeatures , shaderStorageImageArrayNonUniformIndexing) - 32usize] ;
    ["Offset of field: VkPhysicalDeviceDescriptorIndexingFeatures::shaderInputAttachmentArrayNonUniformIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceDescriptorIndexingFeatures , shaderInputAttachmentArrayNonUniformIndexing) - 36usize] ;
    ["Offset of field: VkPhysicalDeviceDescriptorIndexingFeatures::shaderUniformTexelBufferArrayNonUniformIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceDescriptorIndexingFeatures , shaderUniformTexelBufferArrayNonUniformIndexing) - 40usize] ;
    ["Offset of field: VkPhysicalDeviceDescriptorIndexingFeatures::shaderStorageTexelBufferArrayNonUniformIndexing"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceDescriptorIndexingFeatures , shaderStorageTexelBufferArrayNonUniformIndexing) - 44usize] ;
    ["Offset of field: VkPhysicalDeviceDescriptorIndexingFeatures::descriptorBindingUniformBufferUpdateAfterBind"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceDescriptorIndexingFeatures , descriptorBindingUniformBufferUpdateAfterBind) - 48usize] ;
    ["Offset of field: VkPhysicalDeviceDescriptorIndexingFeatures::descriptorBindingSampledImageUpdateAfterBind"] [:: core :: mem :: offset_of ! (VkPhysicalDeviceDescriptorIndexingFeatures , descriptorBindingSampledImageUpdateAfterBind) - 52usize] ;
